[
{ "title": "Java EE 8 の新機能", "category": "java", "body": "クラウドとリアクティブ・プログラミング向けに作成された次期 Java Platform Enterprise Edition は、今後数年のうちに、エンタープライズ・アプリケーション開発を方向付けることになるでしょう。この記事では、Java エンタープライズ・セキュリティー、JSON バインディング、HTTP/2 サーバー・プッシュなどに対応するための新しい API とアップグレードについて紹介します。" }
,{ "title": "Spring Framework 5 の新機能", "category": "java", "body": "Spring Framework 5.0 は今後数年のうちに、開発者が Spring ベースのアプリケーションを理解して作成する方法を変えていくでしょう。Spring 5 では、そのコア構造に関数型プログラミング・モデルとリアクティブ・プログラミング・モデルを統合しています。さらに、主要な依存関係を更新し、レガシーの重荷から解放されてパフォーマンス・ブーストを達成しながらも、お馴染みの Spring Framework のルック・アンド・フィールを維持している仕組みを学んでください。" }
,{ "title": "今まで知らなかった 5 つの事項: Apache Maven のプラグイン", "category": "java", "body": "Maven を最大限に利用しきれていませんか？それは誰にとっても同じことです！プラグインのゴールが Maven のライフサイクルにどのように対応するのかを学んで、GitHub の Maven Site、Codehaus の Maven Cargo を含め、作成するプロジェクトを次のレベルに引き上げる 4 つのプラグインを導入してください。" }
,{ "title": "Java 8 のイディオム: 完璧なラムダ式がたった 1 行である理由", "category": "java", "body": "ラムダ式を短く簡潔に作成できれば、関数型スタイルのプログラミングがもたらす主なメリットの 1 つである、コードの可読性を高めることになります。読みにくく、複数行にわたるラムダ式は、読んで理解しにくいだけでなく、テストするにも再利用するにも難しいことから、重複する作業を繰り返したり、コードの品質を低下させたりする原因となりがちです。今回のチュートリアルで、理解しやすく、テストしやすく、再利用しやすいコードにするために、単一行のラムダ式を作成する方法を学んでください。" }
,{ "title": "Java 8 のイディオム: 関数型インターフェース", "category": "java", "body": "Java 8 では、ラムダ式が関数型インターフェースの型として扱われています。この記事では、この設計上の意思決定が Java 言語の古いバージョンとの後方互換性をサポートする仕組みを説明した後、Java プログラム内でのカスタム関数型インターフェースと組み込み関数型インターフェースの両方の例を見ていきます。カスタム・インターフェースを使うのが当然のように思える場合でも、通常は、組み込みインターフェースを使用するのが最善の結果となる理由を理解してください。" }
,{ "title": "Minecraft とIBM Cloud, 第 1 回: Docker 内で Minecraft サーバーを実行する", "category": "java", "body": "このチュートリアル・シリーズでは、Docker、Eclipse、IBM Cloud を使用して独自の Minecraft サーバーを開発、拡張、ホストする方法を説明します。具体的には、Eclipse を使用して Minecraft プラグインを作成し、作成した Minecraft プラグインをローカルで Docker を使用してテストした後、IBM Cloud を利用してインターネット上で Docker コンテナーをホストする方法を説明します。また、Minecraft 内から IBM Watson の強力な機能を利用して、より教育的かつ対話型のゲームへと拡張します。第 1 回では、Minecraft および Docker の開発環境をローカルに構築するとともに、Minecraft 用のカスタム・サーバーを構築する上での Docker の強力さを確かめます。さらに、ローカルにホストされた独自のサーバー上で実際に Minecraft をプレイし始めます！" }
,{ "title": "Minecraft とIBM Cloud, 第 3 回: Kubernetes 内で Spigot サーバーを稼働させる", "category": "java", "body": "このチュートリアル・シリーズでは、Docker、Eclipse、IBM Cloud を使用して独自の Minecraft サーバーを開発、拡張、ホストする方法を説明します。具体的には、Eclipse を使用して Minecraft プラグインを作成し、作成した Minecraft プラグインをローカルで Docker を使用してテストした後、IBM Cloud を利用してインターネット上で Docker コンテナーをホストする方法を説明します。また、Minecraft 内から IBM Watson の強力な機能を利用して、より教育的かつ対話型のゲームへと拡張します。この第 3 回では、第 2 回で作成したプラグインを次の段階に進めるために、Web 上の IBM Cloud 内でプラグインが動作するようにします。" }
,{ "title": "Minecraft とIBM Cloud, 第 2 回: Docker と Eclipse を使って Minecraft 用のプラグインを作成する", "category": "java", "body": "このチュートリアル・シリーズでは、Docker、Eclipse、IBM Cloud を使用して独自の Minecraft サーバーを開発、拡張、ホストする方法を説明します。具体的には、Eclipse を使用して Minecraft プラグインを作成し、作成したプラグインをローカルで Docker を使用してテストした後、IBM Cloud を利用してインターネット上で Docker コンテナーをホストする方法を説明します。また、Minecraft 内から IBM Watson の強力な機能を利用して、より教育的かつ対話型のゲームへと拡張します。第 2 回では、Eclipse でローカル開発環境を構築してから、独自のサーバー・サイド Minecraft プラグインを開発、作成して、そのプラグインをローカル Docker イメージにエクスポートします。" }
,{ "title": "Watsonサンプル・コード: Watson Visual Recognition サービスを使用して画像に含まれるオブジェクトを識別する (node.js API)", "category": "java", "body": "ここに記載するコードは、Watson Visual Recognition サービスの node.js API の使用法を説明するものです。このサービスでは、Watson が特定の画像を基に、その画像に含まれるオブジェクトの識別を試みます。" }
,{ "title": "Watsonサンプル・コード: Watson Visual Recognition サービスを使用して画像に含まれる顔を認識および識別する (node.js API)", "category": "java", "body": "ここに記載するコードは、Watson Visual Recognition サービスの node.js API の使用法を説明するものです。このサービスでは、Watson が特定の画像を基に、その画像に含まれる顔を探して、その人物の認識を試みます。" }
,{ "title": "Watsonサンプル・コード: Watson Personality Insights サービスを使用してテキストを分析する (Java API)", "category": "java", "body": "ここに記載するコードは、Watson Personality Insights サービスの Java API の使用法を説明するものです。このサービスでは、Watson が特定のテキストを基に、その話者の開放性、誠実性、外向性、協調性、情緒安定性、そしてニーズを分析します。" }
,{ "title": "Watsonサンプル・コード: Watson Tone Analyzer サービスを使用して文書のトーンを識別する (node.js API)", "category": "java", "body": "ここに記載するコードは、Watson Tone Analyzer サービスの node.js API の使用法を説明するものです。このサービスでは、Watson が特定のテキストを基に、その話者のトーンを評価して、怒り、嫌悪、喜び、不安、悲しみなどといった感情のレベルを検出します。" }
,{ "title": "Watsonサンプル・コード: Watson Language Translator サービスを使用してテキストを翻訳する (Java API)", "category": "java", "body": "ここに記載するコードは、Watson Language Translator サービスの Java API の使用法を説明するものです。このサービスでは、指定されたテキスト、ソース言語、ターゲット言語に基づき、Watson がそのテキストを翻訳し、1 つ以上の結果を返します。" }
,{ "title": "Watsonサンプル・コード: Watson Natural Language Classifier サービスを使用して自然言語のコンテキストを識別する (Java API)", "category": "java", "body": "ここに記載するコードは、Watson Natural Language Classification サービスの Java API の使用法を説明するものです。このサービスでは、指定されたテキストとコンテキストに基づき、Watson がテキストを分析し、そのテキストに関連するカテゴリーのリストを返します。" }
,{ "title": "Watsonサンプル・コード: Watson Natural Language Classifier サービスを使用して自然言語のコンテキストを識別する (node.js API)", "category": "java", "body": "ここに記載するコードは、Watson Natural Language Classification サービスの node.js API の使用法を説明するものです。このサービスでは、指定されたテキストとコンテキストに基づき、Watson がテキストを分析し、そのテキストに関連するカテゴリーのリストを返します。" }
,{ "title": "Watsonサンプル・コード: Watson Language Translator サービスを使用してテキストを翻訳する (node.js API)", "category": "java", "body": "ここに記載するコードは、Watson Language Translator サービスの node.js API の使用法を説明するものです。このサービスでは、指定されたテキスト、ソース言語、ターゲット言語に基づき、Watson がそのテキストを翻訳し、1 つ以上の結果を返します。" }
,{ "title": "マイクロサービスへのリファクタリング: 第 1 回 モノリスから移行する際の考慮事項", "category": "java", "body": "ここのところ、マイクロサービスが開発の世界に旋風を巻き起こしています。この全 3 回からなるシリーズでは、マイクロサービスが重要な理由、マイクロサービスへの移行手法を計画する際に考慮すべき要因、データ分析の役割を取り上げ、マイクロサービスへの移行プロセスをステップ・バイ・ステップで説明します。第 1 回ではマイクロサービスについて紹介し、アプリケーションをリファクタリングしてマイクロサービス・アーキテクチャーを利用する際の考慮事項を説明します。" }
,{ "title": "Watsonサンプル・コード: Watson Tone Analyzer サービスを利用して文書のトーンを識別する", "category": "java", "body": "Watson Tone Analyzer サービスの Java API の使用法を説明するコードを記載します。Watson はテキストを基に話者のトーンを評価して、怒り、嫌悪、喜び、不安、悲しみなどといった感情のレベルを検出します。" }
,{ "title": "Java 8 のイディオム: パススルーに代わる手段", "category": "java", "body": "パススルー・ラムダ式のバリエーションの数は限られていますが、ほぼ常に、これらのラムダ式が引き起こす面倒はラムダ式の価値を打ち消してしまいます。一般的なパススルーのバリエーションをコード内で識別する方法を学び、そのそれぞれを単純で表現豊かなメソッド参照で置き換えた場合の結果を確かめてください。" }
,{ "title": "Spring Boot の基礎", "category": "java", "body": "Spring Boot のスターター、見解、実行可能 JAR ファイル構造を使用して、「そのまま実行」できる Spring ベースのアプリケーションを迅速に作成する方法を学んでください。" }
,{ "title": "Java 8 のイディオム: 役に立つコーディングの慣例への賞賛", "category": "java", "body": "Java 8 で慣例としている関数合成の表記は、作成するコードの品質を高めるだけでなく、他の開発者たちとの関係にも良い影響を与える可能性があります。" }
,{ "title": "Javaプログラミング入門, 第 2 回: 実際のアプリケーションに対応するための構成体", "category": "java", "body": "引き続き、Java プラットフォーム上でのオブジェクト指向プログラミングについての理解を深めてください。チュートリアル「Java プログラミング入門」の後半となるこの第 2 回では、実際の複雑な Java アプリケーションを開発する際に必要となる、より高度な構文とライブラリーを紹介します。" }
,{ "title": "Javaプログラミング入門, 第 1 回: Java 言語の基本", "category": "java", "body": "全 2 回からなるこのチュートリアルでは、Java 言語の構造、構文、プログラミング・パラダイムを紹介します。プロの開発者として目にするはずの Java 構文を理解し、堅牢で保守しやすい Java アプリケーションを構築するために使用できる Java プログラミングのイディオムを学んでください。第 1 回で習得するのは、関数型 Java 構文を含め、Java プラットフォーム上でのオブジェクト指向プログラミングに不可欠の要素です。まず、Java オブジェクトを作成する方法、そして Java オブジェクトに動作を追加する方法をひと通り説明した後、Java コーディングのベスト・プラクティスを要約して第 1 回を締めくくります。" }
,{ "title": "Java 開発者のためのブロックチェーン・チェーンコード", "category": "java", "body": "現在、ブロックチェーンが、インターネット上でビジネス・トランザクションを実行する方法を変えつつあります。このチュートリアルでは、ブロックチェーン・ネットワークをインストールして、Java 言語で作成されたチェーンコード (スマート・コントラクト) を実行する手順を説明します。" }
,{ "title": "今まで知らなかった 5 つの事項: マルチスレッド Java プログラミング", "category": "java", "body": "マルチスレッド・プログラミングで簡単なものはありません。しかし JVM がコードの構成体の微妙な違いをどのように処理するかを理解していると、マルチスレッド・プログラミングにも役立ちます。この記事では、著者の Steven Haines が、同期メソッド、volatile 変数、アトミック・クラスを扱う場合に、十分理解した上で判断するのに役立つ 5 つのヒントを説明します。" }
,{ "title": "今まで知らなかった 5 つの事項: Java のパフォーマンス・モニタリング、第 1 回", "category": "java", "body": "質の悪いコード (または質の悪いコード作成者) を非難しても、パフォーマンスのボトルネックを見つけたり Java アプリケーションの処理速度を改善したりするためには役立ちません。同様に、推測も役に立ちません。そこで、Ted Neward が皆さんの関心を Java パフォーマンス・モニタリング用ツールに向けるために、まずは JConsole という Java に付属のプロファイラーを使用する際の 5 つのヒントを紹介します。" }
,{ "title": "今まで知らなかった 5 つの事項: Java のパフォーマンス・モニタリング、第 2 回", "category": "java", "body": "JDK に JConsole というフル機能のプロファイラーが付属していることを今まで知らなかった人であれば、この記事で紹介するスタンドアロンの 5 つのプロファイリング・ユーティリティーについて知ると、さらに驚くことでしょう。スレッド不足、デッドロック、オブジェクトのリークといったパフォーマンスのボトルネックを解決する上で、Java プロセスのモニタリングや分析のための軽量な (そして場合によると実験的な) ツールがどれほど役立つかを学びましょう。" }
,{ "title": "今まで知らなかった 5 つの事項: Java Database Connectivity", "category": "java", "body": "JDBC、つまり Java Database Connectivity は、JDK 全体の中で最も頻繁に使われるパッケージの 1 つでありながら、JDBC の機能をフルに利用している Java 開発者や JDBC の最新機能を利用している Java 開発者はごく稀です。この記事では Ted Neward が JDBC の新機能を紹介します。具体的には、自動的にスクロールし、オンザフライで更新できる ResultSet、データベース接続が開いているか否かによらず動作する Rowset、ネットワークを 1 度素早く往復するだけで複数の SQL 文を実行できるバッチ更新、などについて説明します。" }
,{ "title": "今まで知らなかった 5 つの事項: Apache Maven", "category": "java", "body": "皆さんはプロファイルについて十分理解しているかもしれませんが、Maven でプロファイルを使用すると、さまざまな環境で特定の動作を実行できることをご存じでしょうか。今回の「今まで知らなかった 5 つの事項」では Maven のビルド機能以外の機能について説明します。そのなかには、プロジェクトのライフサイクルを管理するための基本ツールについての説明も含まれています。この記事で紹介する 5 つのヒントを参考にすれば、生産性を高めることや、Maven で容易にアプリケーションを管理することが可能になります。" }
,{ "title": "今まで知らなかった 5 つの事項: 日常的な Java ツール", "category": "java", "body": "Java ツールの中には、うまくカテゴリーに分類することができず、「役に立つ機能」といった注釈の下にまとめられがちなものがあります。今回の「今まで知らなかった 5 つの事項」では、(結局どこかにしまい込んでしまうことになっても) あると便利な一連のツールについて説明します。" }
,{ "title": "今まで知らなかった 5 つの事項: java.util.concurrent 第 1 回", "category": "java", "body": "優れたパフォーマンスを実現し、なおかつアプリケーションが破損しないように動作するマルチスレッド・コードを作成する作業は、ともかく非常に困難です。そこで java.util.concurrent が登場します。この記事では著者の Ted Neward が、CopyOnWriteArrayList、BlockingQueue、ConcurrentMap などの並行コレクション・クラスで標準的なコレクション・クラスを置き換え、並行プログラミングの要求に応える方法について説明します。" }
,{ "title": "今まで知らなかった 5 つの事項: Swing を強化する", "category": "java", "body": "Swing は古いツールキットです。素晴らしいユーザー・インターフェースが登場する、はるか以前に開発されたため、Swing にはリッチな UI の作成に必要なコンポーネントの一部が欠けています。幸いなことに、Substance、SwingX、Java Look-and-Feel Graphics Repository などのオープンソース・プロジェクトにより、そのギャップを埋めることができます。この記事では著者の Steven Haines が、ツリー・テーブルや、構文の強調表示、その他の機能を苦労せずに Swing の UI に追加する方法について説明します。" }
,{ "title": "今まで知らなかった 5 つの事項: java.util.concurrent 第 2 回", "category": "java", "body": "java.util.concurrent には並行処理に有効なコレクションの他にも、マルチスレッド・アプリケーションでのスレッドの制御や実行に役立つ作成済みのコンポーネントが導入されています。この記事では、Ted Neward が java.util.concurrent パッケージの中で Java プログラミングに必ず必要な事項をさらに 5 つ紹介します。" }
,{ "title": "今まで知らなかった 5 つの事項: Java 6 コレクション API の場合: 第 1 回", "category": "java", "body": "Java 6 コレクション API は単なる配列の置き換え以上の機能を持っていますが、配列の置き換えは出発点として悪くはありません。この記事では Ted Neward が、Java コレクション API のカスタマイズ方法や拡張方法の基本を含め、コレクションをさらに活用するための 5 つのヒントを紹介します。" }
,{ "title": "今まで知らなかった 5 つの事項: JAR", "category": "java", "body": "多くの Java 開発者は JAR に関して基本事項以上のことは考えもせず、単にクラスをバンドルして本番サーバーに送るために JAR を使用しているにすぎません。しかし JAR は単に ZIP ファイルをリネームしたもの以上の機能を備えています。この記事では、Spring の依存関係や構成ファイルを JAR に含めるためのヒントを始めとし、Java Archive ファイルの機能を最大限に利用する方法について学びましょう。" }
,{ "title": "今まで知らなかった 5 つの事項: Java 6 コレクション API の場合: 第 2 回", "category": "java", "body": "Java のコレクションはどこででも使えますが、軽く考えてはいけません。コレクションには知られていない性質があり、適切に扱わないとトラブルにつながる場合があります。今回の「今まで知らなかった 5 つの事項」では、Ted Neward が Java コレクション API の可変かつ複雑な側面を説明します。このヒントによって、Iterable、HashMap、SortedSet を一層活用できるようになり、コードにバグが発生しなくなるはずです。" }
,{ "title": "Java 8 のイディオム: 関数型プログラミングへの移行の近道", "category": "java", "body": "Java プログラムに関数型手法を容易に導入する最初のステップは、命令型ではなく、宣言型の考え方でプログラミングする方法を学ぶことです。" }
,{ "title": "Java 8 のイディオム: 従来の for ループに代わる関数型の手法", "category": "java", "body": "for ループは至るところで使用されているかもしれませんが、代わりがきかないわけではありません。Jave での複雑な繰り返し処理であっても、range、iterate、および limit メソッドが厄介な手間を省く仕組みを学んでください。" }
,{ "title": "Java 8 のイディオム: 関数合成およびコレクション・パイプライン・パターン", "category": "java", "body": "コード内でコレクションを繰り返し処理する方法は、無限ループだけではありません。関数合成とコレクション・パイプラインは、ステートメントではなく式を使ってコレクションをソートできる、Java での 2 つのパターンです。" }
,{ "title": "Java Streams, Part 3: Streams の内幕", "category": "java", "body": "このシリーズでは、Java 言語アーキテクトである Brian Goetz が、Java SE 8 で導入された Java Streams ライブラリーの詳細を解説します。この java.util.stream パッケージは、ラムダ式の力を利用することによって、コレクションや配列などのさまざまなデータ・セットに対し、関数型スタイルのクエリーを簡単に実行できるようにします。今回の記事で、クエリーを微調整して可能な限り効率化するにはどのようにするのかを学んでください。" }
,{ "title": "Java Streams, Part 2: Streams を使用した集約", "category": "java", "body": "このシリーズでは、Java 言語アーキテクトである Brian Goetz が、Java SE 8 で導入された Java Streams ライブラリーの詳細を解説します。この java.util.stream パッケージは、ラムダ式の威力を利用することによって、コレクションや配列などのさまざまなデータ・セットに対し、関数型スタイルのクエリーを簡単に実行できるようにします。今回の記事では、java.util.stream パッケージを使用して、どのようにして効率的にデータを集約および要約するのかを学んでください。" }
,{ "title": "Java Streams, Part 1: java.util.stream ライブラリー入門", "category": "java", "body": "このシリーズでは、Java 言語アーキテクトである Brian Goetz が、Java SE 8 で導入された Java Streams ライブラリーの詳細を解説します。この java.util.stream パッケージは、ラムダ式の威力を利用することによって、コレクションや配列などのさまざまなデータ・セットに対し、関数形式のクエリーを簡単に実行できるようにします。" }
,{ "title": "Java Streams, Part 5: 並列ストリームのパフォーマンス", "category": "java", "body": "この全 5 回からなるシリーズ「Java Streams」の最終回となるこの記事では、前回の記事を引き継いで、並列処理の効率性に影響を与える要因について説明し、それらの概念を Streams ライブラリーに当てはめて考えます。一部のストリーム・パイプラインが他のパイプラインよりも並列化になぜすぐれているのかを明らかにし、独自のストリーム・コードを使用して並列化効率をどのように分析するのかを紹介します。" }
,{ "title": "Java Streams, Part 4: 並行処理から並列処理へ", "category": "java", "body": "この全 5 回からなるシリーズ「Java Streams」の第 4 回では、並列処理の効率性を決定付ける要因を特定し、歴史的および技術的観点から説明します。並列実行を目的とした Streams ライブラリーを最適に利用するには、これらの決定要因を理解することが基礎となります (次回の記事で、今回説明する原則をそのまま Streams に当てはめます)。" }
,{ "title": "Elasticsearch を Java アプリケーションの中で使用する", "category": "java", "body": "使いやすい REST API と、クラスターの自動スケーリングを組み合わせた Elasticsearch は、全文検索の分野を席巻しています。Elasticsearch をコマンド・シェルから、そして Java アプリケーション内から使用する方法について、この実践的な入門チュートリアルで学んでください。" }
,{ "title": "Bluemix を利用したハイブリッド・クラウドに Java アプリケーションをマイグレーションする、パート 4", "category": "java", "body": "Secure Gateway サービスを利用して、Bluemix 内で実行される Java Platform, Enterprise Edition アプリケーションを、Bluemix の外部で実行されるリレーショナル・データベースに接続してください。" }
,{ "title": "Minecraft とBluemix: 第 4 回 Bluemix 上で Minecraft に Watson を統合する", "category": "java", "body": "このチュートリアル・シリーズでは、Docker、Eclipse、Bluemix を使用して独自の Minecraft サーバーを開発、拡張、ホストする方法を説明します。具体的には、Eclipse を使用して Minecraft プラグインを作成し、作成した Minecraft プラグインをローカルで Docker を使用してテストした後、Bluemix を利用してインターネット上で Docker コンテナーをホストする方法を説明します。また、Minecraft 内から IBM Watson の強力な機能を利用して、より教育的かつ対話型のゲームへと拡張します。第 4 回では、Bluemix の Watson コグニティブ・サービスを利用するプラグインで Spigot サーバーを拡張し、ゲーム・プレイに科学的な知識を少し加えます。" }
,{ "title": "Docker: 今どきの開発者への朗報", "category": "java", "body": "Docker を使用することで、より生産的にコーディングを行い、より効率的にスキルを高めてください。コンテナー化されたアプリケーションを扱うことで、開発環境を整えて、依存関係の競合を取り除き、開発および学習にかかる時間を削減してください。" }
,{ "title": "developerWorks Technology からのお知らせ: 2015 年の選り抜きの Java 関連チュートリアル", "category": "java", "body": "developerWorks Technology のエディターが、2015年に Java 開発者向けに公開された、選り抜きのチュートリアルを紹介します。" }
,{ "title": "Play を使った Web アプリケーション開発: 第 1 回: Play Framework と Scala でユーザー認証を管理する", "category": "java", "body": "Play Framework アプリケーション用のユーザー管理を実装するために Scala のスキルを活用してください。このチュートリアルでは、認証と承認を扱う基本的な Play アプリケーションを作成する方法を Pablo Pedemonte が説明します。このアプリケーションのコードは、皆さん独自の Play プロジェクトのスターター・コードとして、ユーザー管理機能の開発時間を短縮するために利用することもできます。" }
,{ "title": "Bluemix を利用したハイブリッド・クラウドに Java アプリケーションをマイグレーションする、パート 1", "category": "java", "body": "このチュートリアルでは、ハイブリッド・アプリケーションを階層化する方法を紹介するとともに、企業内にそのまま残すのが最善のサービスとの接続を維持しながら、Tomcat 上で実行されるアプリケーションまたは WebSphere アプリケーションを Bluemix へマイグレーションする方法をステップバイステップで説明します。また、アプリケーションが Bluemix Liberty Java ビルドパック内で実行されるものであるかどうかを判断するために使用できるツールを紹介し、クラウド内またはオンプレミスの SQL データベースに接続する方法や、セッション・パーシスタンス、スケーリング、ロギングをはじめとするクラウドの重要な考慮事項に対処するためにアプリケーションを更新する方法についても説明します。" }
,{ "title": "Bluemix を利用したハイブリッド・クラウドに Java アプリケーションをマイグレーションする、パート 2", "category": "java", "body": "Eclipse ツールを使用して、Tomcat 上で実行されるアプリケーションを IBM Bluemix へ迅速マイグレーションしたくはありませんか？このチュートリアルでは、Tomcat 上で実行されるアプリケーションを分析、マイグレーション、そして Bluemix 内の Liberty for Java へデプロイするように Eclipse ツールをセットアップする方法をステップバイステップで説明します。さらに、Java ランタイムと SQL Database をセットアップする方法や、アプリケーションをデータベースにバインドする方法も説明します。" }
,{ "title": "Bluemix を利用したハイブリッド・クラウドに Java アプリケーションをマイグレーションする、パート 3", "category": "java", "body": "このチュートリアルでは、スタンドアロンの Java プログラムを Bluemix 内で実行する方法を検討します。その中で Cloud Foundry マニュアルのナビゲーション方法、CF コマンド・ライン・ツールの使用方法、Cloud Foundry および Bluemix でのデバッグ方法についての専門家によるヒントを紹介します。" }
,{ "title": "Vaadin を使用してクラウド内でフルスタック Java のアプリを開発する", "category": "java", "body": "Vaadin Rich Web Starter ボイラープレートを利用して、DB2 をバックエンドに持つ 3 層構造の注文デスク・アプリを数分でカスタマイズして Bluemix クラウドにデプロイしてください。" }
,{ "title": "Vaadin を使用したフルスタック Java の Web 開発", "category": "java", "body": "Web アプリで魅力的な対話型のユーザー・エクスペリエンスを創り出すために、Java Web 開発者が (最新のブラウザーの基礎となっている) JavaScript、CSS、HTML5 を学ばなければならないことはよくあります。Java 開発者は、オープンソースの Vaadin フレームワークを使用することで、100% Java の世界の中でフルスタックの制御をできるようになります。" }
,{ "title": "JVM の並行性: Akka を使って非同期に振舞う", "category": "java", "body": "並行プログラミングに対する手法として長きにわたって確立されているアクター・モデルを使用すると、並行性とスケーラビリティーに優れたアプリケーションを簡単に構築できるようになります。この記事でアクター・モデルについて学び、Akka で実装したモデルを Scala または Java で扱うようになってください。" }
,{ "title": "JVM の並行性: Akka を使ってアクター・アプリケーションを作成する", "category": "java", "body": "アクター・アプリケーションには、シングルスレッド・アプリケーションで用いられる線形アプローチとは異なるスタイルのプログラミングが必要です。ツールキットおよびランタイムとして Akka を使用してシステムを構築する方法について、Scala コードのアクターとメッセージという観点でさらに深く探ってください。" }
,{ "title": "Java Integration ステージにおけるユーザコードのデバッグ", "category": "java", "body": "IBM InfoSphere Information Server バージョン 9.1 から提供されている Java Integration ステージを使用することにより、InfoSphere Data Stage and Quality Stage のパラレル・ジョブから Java コードを呼び出し、データを加工・変換する ETL (Extract, Transform, Load) ジョブに統合することが可能となります。お客様がもつ Java コードの資産や多種多様なオープンソース API やフレームワークの利用により、より付加価値の高いデータの生成が可能となります。本稿では、Java Integration ステージ上で動作するユーザコードのデバッグ方法について説明します。" }
,{ "title": "Java マルチテナンシーの紹介", "category": "java", "body": "最近、IBM SDK, Java Technology Edition, Version 7 Release 1 に含まれる形で、マルチテナント型 JVM がテクノロジー・プレビューとして利用できるようになりました。単一のマルチテナント型 JVM で複数のアプリケーションを実行すれば、クラウド・システムでアプリケーションの起動時間を短縮できるとともに、アプリケーションのメモリー・フットプリントを削減することができます。この記事では、マルチテナント型クラウド JVM を支えるテクノロジーを紹介し、この JVM を使用することでもたらされるメリットとそれに伴う代償の主なものを説明します。" }
,{ "title": "Bluemix DevOps Services デリバリー・パイプラインで Maven を使用する", "category": "java", "body": "既存の Apache Maven プロジェクトを Bluemix DevOps Services のデリバリー・パイプラインに統合する方法と、Maven プロジェクトを Bluemix DevOps Services プロジェクトとして使用できるようにセットアップする方法を学んでください。" }
,{ "title": "Java、Weka、そして dashDB サービスを利用してデータ・マイニング・アプリケーションを構築する", "category": "java", "body": "dashDB サービス (以前は Analytics Warehouse サービス、または BLU Acceleration サービスと呼ばれていました) は、IBM Bluemix 上でデータウェアハウジングとアナリティクスをサービスとして提供します。開発者は、クラウド内で提供される、極めて高速に動作する IBM BLU データベースのテクノロジーを利用して重要な分析アプリケーションを開発し、デプロイすることができます。IBM BLU 列指向データベースを活用し、Weka 統計分析ツールを使用してデータ・マイニング・アプリケーションを開発する方法を学んでください。" }
,{ "title": "Liberty JAAS ログイン・モジュールを使用して Bluemix のシングル・サインオンに対応する", "category": "java", "body": "このチュートリアルでは、Bluemix の SSO サービスを利用して Liberty に対応した認証を行う手法を紹介します。ユーザー・ログインに Bluemix の SSO サービスを利用するサンプル・アプリケーションを作成してください。このサンプル・アプリケーションは、認証に成功すると Liberty サーバーが必要なオブジェクト (Subject、Principal、Session) をすべて作成する Liberty アプリケーションで、Bluemix の SSO 機能を利用することができます。そして、認証メカニズムがアプリケーション・コードから抽象化されるように、SSO サービスを利用した JAAS 認証を使用します。" }
,{ "title": "3 層からなるリッチな Web アプリを手早く作成する: 第 2 回 アプリケーション層を作成する", "category": "java", "body": "この全 3 回からなるチュートリアル・シリーズでは、IBM Rational Application Developer と IBM Bluemix を使用して、多層 Java Enterprise Edition (JEE) アプリを迅速に作成およびホストする方法を学びます。データ・モデルとデータベースの作成、Java Persistence API (JPA) を使用するデータ・アクセス・コードの生成、Enterprise JavaBeans (EJB) と Web サービスの作成、データを表示および変更するためのリッチな Web UI の Dojo による作成、といった各ステージに要する時間を短縮する方法を理解してください。アプリケーションが完成したら、IBM の Platform as a Service (PaaS) である IBM Bluemix にデプロイします。" }
,{ "title": "3 層からなるリッチな Web アプリを手早く作成する: 第 1 回 データベースを作成する", "category": "java", "body": "この全 3 回からなるチュートリアル・シリーズでは、IBM Rational Application Developer と IBM Bluemix を使用して、多層 Java Enterprise Edition (JEE) アプリを迅速に作成およびホストする方法を学びます。データ・モデルとデータベースの作成、Java Persistence API (JPA) を使用するデータ・アクセス・コードの生成、Enterprise JavaBeans (EJB) と Web サービスの作成、データを表示および変更するためのリッチな Web UI の Dojo による作成、といった各ステージに要する時間を短縮する方法を理解してください。アプリケーションが完成したら、IBM の Platform as a Service (PaaS) である IBM Bluemix にデプロイします。" }
,{ "title": "3 層からなるリッチな Web アプリを手早く作成する: 第 3 回 リッチな Web UI を作成する", "category": "java", "body": "この全 3 回からなるチュートリアル・シリーズでは、IBM Rational Application Developer と IBM Bluemix を使用して、多層 Java Enterprise Edition (JEE) アプリを迅速に作成およびホストする方法を学びます。データ・モデルとデータベースの作成、Java Persistence API (JPA) を使用するデータ・アクセス・コードの生成、Enterprise JavaBeans (EJB) と Web サービスの作成、データを表示および変更するためのリッチな Web UI の Dojo による作成、といった各ステージに要する時間を短縮する方法を理解してください。アプリケーションが完成したら、IBM の Platform as a Service (PaaS) である IBM Bluemix にデプロイします。" }
,{ "title": "Java でクラウド・アプリケーションを作成および管理する", "category": "java", "body": "完全な継続的インテグレーションを実現するには、クラウド内でのアプリケーションのデプロイメントを自動化する必要があります。このチュートリアルには、Cloud Foundry の Java クライアント・ライブラリーを使用して、IBM Bluemix 内でのアプリケーションの作成および管理を自動化する方法を示すサンプル・コードが含まれています。" }
,{ "title": "Java プログラミングで実装する OAuth 2.0 クライアント: 第 3 回 認可コードによるグラント", "category": "java", "body": "この複数のパートで構成されるシリーズは、あらゆる OAuth 2.0 対応サーバーとインターフェースを取るために使用できる、汎用的かつ再利用可能な OAuth 2.0 クライアントを開発する上で役に立ちます。第 1 回では、リソース・オーナー・パスワード・クレデンシャル・グラントを実装する方法を説明し、第 2 回では、クライアント・クレデンシャル・グラントを実装する方法を説明しました。第 3 回となる今回の記事では、認可コードによるグラントを実装する方法を説明します。" }
,{ "title": "Java プログラミングで実装する OAuth 2.0 クライアント: 第 2 回 クライアント・クレデンシャル・グラント", "category": "java", "body": "この複数のパートで構成されるシリーズは、あらゆる OAuth 2.0 対応サーバーとインターフェースを取るために使用できる、汎用的かつ再利用可能な OAuth 2.0 クライアントを開発する上で役に立ちます。第 1 回では、リソース・オーナー・パスワード・クレデンシャル・グラントを実装する方法を説明しました。第 2 回となる今回の記事では、クライアント・クレデンシャル・グラントを実装する方法を説明します。" }
,{ "title": "developerWorks の最前線から: 2014 年のオープン・テクノロジー関連のベスト・コンテンツ", "category": "java", "body": "developerWorks では、サイトの開設 15 周年をお祝いしていますが、技術に関する全体的な様相が、今年ほど刺激的または複雑だったことはありません。数え切れないほどの製品、プロジェクト、テクニックがあるなかで、余計な情報は省いて、現在ホットなものを概観します。" }
,{ "title": "JVM の並行性: Scala での非同期イベント処理", "category": "java", "body": "Scala の Future クラスと Promise クラスは、イベントを編成して順序付けるノンブロッキング手法を含め、非同期処理を扱う強力な手段を提供します。しかも Scala では、マクロとして実装された async / await 構成体によって、ノンブロッキング型のイベント処理をより簡単に作成することができます。このチュートリアルでは、Future と Promise を使用する基本手法の実際を紹介した後、async / await を利用して、単純なブロッキング型のように見えるコードをノンブロッキング方式で実行されるように変換する方法をデモンストレーションします。" }
,{ "title": "Java、Ajax、Cloudant を使ってハングマン・ゲームを作成する", "category": "java", "body": "Bluemix のサービスである Liberty for Java ランタイムと Cloudant NoSQL データベースを利用してオンラインのハングマン・ゲームを作成する方法を学んでください。" }
,{ "title": "IBM PureApplication System における WebSphere eXtreme Scale ベースのキャッシュ・サービスを探る", "category": "java", "body": "クラウド・エンタープライズ・アプリケーションのパフォーマンスとスケーラビリティーの問題に対処するには、キャッシュ・サービスがソリューションとしてよく使われます。この記事では、IBM PureApplication System のクラウド・システムに用意されている 3 つのキャッシュ・サービスについて探ります。対象とするのは、組み込みキャッシュ・サービス、WebSphere eXtreme Scale をベースにクラスターで仮想システム・パターンを使用して作成するキャッシュ・サービス、そして同じく WebSphere eXtreme Scale をベースに仮想システム・パターンとコア OS イメージを使用して作成するキャッシュ・サービスです。" }
,{ "title": "JVM の並行性: ブロックすべきか、すべきでないか？", "category": "java", "body": "Java 8 で追加された CompletableFuture クラスには、非同期処理の完了に対処する新しい方法が用意されており、その中にはノンブロッキング手法で複数のイベントを作成して結合するやり方も含まれています。この記事では、イベントの完了に対処する際にブロッキング手法を使用する場合とノンブロッキング手法を使用する場合の違いを、読者が理解する助けとなるように説明し、さらにはノンブロッキング手法を優先するべき理由についても説明します。" }
,{ "title": "Java のマルチテナンシー: 構成オプション、テナント・ライフサイクル、そして分離の実際", "category": "java", "body": "IBM SDK Java Technology Edition バージョン 7 リリース 1 では、マルチテナント型 JVM をテクノロジー・プレビューとして利用できるようになっています。単一のマルチテナント型 JVM の中で複数のアプリケーションが実行されるようにすることで、クラウド・システムはアプリケーションの起動時間を短縮することや、アプリケーションのメモリー・フットプリントを削減することができます。この記事を読むことで、テナントのライフサイクルを検証し、使用可能な構成オプションのいくつかを学んで、テナント・アプリケーションで静的フィールドを分離するメリットを確かめてください。この記事は、以前の developerWorks 記事「Java マルチテナンシーの紹介」を基に作成されています。" }
,{ "title": "SLDT を使用してデータを SoftLayer オブジェクト・ストレージに転送する", "category": "java", "body": "SoftLayer は、OpenStack Swift をベースにしたオブジェクト・ストレージ・サービスを提供しています。SoftLayer API や、cURL などのコマンドライン・ツールを使用すれば、オブジェクト・ストアとの間でのファイル転送を行うことができますが、大容量のファイルを扱うとなると、面倒な作業になることがあります。この記事では、SLDT という単純な Java ツールを使用して、認証、オブジェクトのセグメント化、SoftLayer オブジェクト・ストアとの間でのデータ転送などを扱う方法を説明します。" }
,{ "title": "Software Defined Networking を使用して IaaS を最適化する", "category": "java", "body": "この記事では IaaS (Infrastructure as a Service) を、相互運用性、ユーザーとプロバイダーの期待値マネジメント、開発者と管理者の要件、効果的なリスク軽減といった点で強化および最適化する手法としての SDN (Software Defined Networking) <mdash></mdash> ソフトウェア抽象化層を介したネットワーク管理手法 <mdash></mdash> について探ります。" }
,{ "title": "Web サービスを統合した、移植可能な Java 旅行アプリを作成する", "category": "java", "body": "クラウド上で Java PaaS Web アプリケーションを開発およびデプロイする方法を学んでください。" }
,{ "title": "IBM SmarterCloud Orchestrator対応の Windows イメージを作成する", "category": "java", "body": "IBM SmarterCloud Orchestrator からデプロイできるイメージを作成するには、オペレーティング・システムの知識、イメージのデプロイ先とするハイパーバイザーとそれに対応するハイパーバイザー・マネージャーの知識が必要です。この記事を読んで、SmarterCloud Orchestrator 対応の Windows イメージを簡単かつ円滑に作成する方法を学んでください。" }
,{ "title": "Java.next: 次に採用する JVM 言語を選択する", "category": "java", "body": "Java.next 言語はどれを取っても、次に採用するプログラミング言語にはぴったりの候補です。そのうちの 1 つを選ぶには、どうすればよいのでしょう？この重大な決定を左右する要素を調査してください。" }
,{ "title": "Java.next: Java.next としての Java 8", "category": "java", "body": "連載「Java.next」の今回の記事では、皆さんが次に使用するプログラミング言語の有力な候補として Java 8 リリースを取り上げます。ラムダ式ブロックと Stream API がどのような形で Java を最新の言語にアップグレードするかを理解してください。" }
,{ "title": "JVM の並行性: Java 8 での並行処理の基礎", "category": "java", "body": "Java 8 には、並行プログラムをはじめとする各種プログラムの作成を容易にする、新しい言語機能と追加クラスが組み込まれています。この記事で、CompletableFuture や Stream などの Java 8 の機能拡張によって実現された、この言語の新しい強力な並列処理サポートについて学んでください。これらの新しい機能と、この連載の最初の記事で探った Scala の機能のいくつかの間には、類似点があることに気付くはずです。" }
,{ "title": "Java 8 言語での変更内容", "category": "java", "body": "Java 8 には、より簡単にプログラムを作成できるようにする、重要な新しい言語機能が組み込まれています。ラムダ式が定義する、インライン・コード・ブロック用の新しい構文は、遥かに少ないボイラープレートで匿名内部クラスと同様の柔軟性を実現します。また、Java 8 で加えられたインターフェースに対する変更によって、既存のインターフェースに追加をしても、既存のコードをそのまま使用できるようになりました。この記事では、これらの Java 8 での変更内容をともに使用する方法を説明します。" }
,{ "title": "Java.next: Clojure での並行処理", "category": "java", "body": "すべての Java.next 言語のなかで、Clojure は並行処理に関して最も急進的な手法を採用しています。この記事では、Epochal Time Model、ソフトウェア・トランザクション・メモリーをはじめとする、Clojure の並行処理に関するさまざまな側面のうちのいくつかを取り上げて、詳細を探ります。" }
,{ "title": "Java.next: 並行性を比較対照する", "category": "java", "body": "スレッド化、並行性、並列性には、おそらく Java.next 言語の間で最も顕著な違いがあります。今回の記事では、Scala、Groovy、Clojure の既存の関数型のコードを並列コードにする簡単な方法を説明した後、Scala でのアクター並行性モデルを調べます。" }
,{ "title": "JVM の並行性: Java と Scala での並行処理の基礎", "category": "java", "body": "Java プラットフォームでは、あらゆる JVM ベースの言語での並行プログラミングを強力にサポートしています。Scala は Java 言語の並行性サポートを拡張し、さらに多くの方法によりプロセッサー間で処理を共有して結果を調整できるようにしています。この JVM の並行性に関する新しい連載の第 1 回では、Java 7 における最先端の並行プログラミングを取り上げ、Scala による機能強化をいくつか紹介します。この記事は、Java 8 における並行性の機能を理解するための準備にも役立ちます。" }
,{ "title": "Java.next: メモ化、そして関数型での相乗効果", "category": "java", "body": "Scala と Clojure はどちらも関数型言語であり、Groovy もライブラリーによって関数型の機能を数多く取り入れます。連載 Java.next の今回の記事では、各 Java.next 言語でのメモ化の実装方法と、関数型の機能を結合して、コードを簡潔に表現する方法を探ります。" }
,{ "title": "Java.next: シノニムのややこしさを克服する", "category": "java", "body": "前回の Java.next の記事 (「関数型のコーディング・スタイル」) では、Scala、Groovy、Clojure といった 3 つの言語での関数型コーディング・スタイルを比較対照しました。今回の記事では、連載の著者である Neal Ford が Java.next 言語でのフィルター関数、マップ関数、および集約関数について、さらに深く掘り下げます。3 つの言語では、これらの重要な関数型構成体にさまざまな名前が付けられていますが、この若干ややこしい言語間での違いを整理できるように、一連の簡潔なコーディング・サンプルを記載します。" }
,{ "title": "DITADoclet と DITA API 特殊化を利用して DITA Java API リファレンス・マニュアルを生成する", "category": "java", "body": "DITADoclet と DITA API 特殊化を組み合わせることで、時間を節約しながらも、品質の高い API ドキュメントを Java ソース・コードから直接作成します。" }
,{ "title": "Java ベースのワークロードを対象とした、クラウドでのトランスペアレントなネットワーク高速化", "category": "java", "body": "Java Sockets over RDMA (JSOR) は、Linux プラットフォーム向けの IBM SDK Java Technology Edition Version 7 に含まれる新しい通信ライブラリーです。JSOR は RDMA 対応の高速ネットワーク・アダプターを活用することにより、クラウド環境で実行されるクライアント・サーバー・アプリケーションのスループットを改善し、遅延を軽減します。JSOR の基礎となる技術について学び、このライブラリーの使い方を知り、JSOR のパフォーマンスを他の通信プロトコル・ベースのソリューションと比較しましょう。" }
,{ "title": "Apache Tomcat でのバナー・グラビングを廃絶する", "category": "java", "body": "バナー・グラビングを足がかりとして、本格的なサイバー攻撃が開始されることはよくありますが、これを防ぐのは簡単です。Apache Tomcat インストール済み環境を、そのバージョン情報を基にした不正行為から保護するために、Server.xml および ServerInfo.properties ファイルのデフォルト・パラメーターを無効にする方法を学んでください。" }
,{ "title": "Twitter Storm でビッグ・データをリアルタイムに処理する", "category": "java", "body": "Storm は、オープンソースのビッグ・データ処理システムです。Storm はリアルタイム分散処理を対象としている点、そして言語に依存しないという点で、他のビッグ・データ処理システムとは異なります。Twitter の Storm とそのアーキテクチャー、そしてさまざまなバッチ処理ソリューションおよびストリーム・プロセッシング・ソリューションについて学んでください。" }
,{ "title": "サーバー・クラスター対応の Java アプリケーションを構築する", "category": "java", "body": "極めてスケーラブルな Javaエンタープライズ・アプリケーションを開発する場合、サーバーをクラスタリングするのが当たり前のことになってきています。けれども今のところ、Java EEではアプリケーション・レベルでサーバー・クラスターに対応できるようにはなっていません。この記事では、分散型エンタープライズ Javaアプリケーションにおいて、サーバー・グループのコーディネーションをするために、Apache ZooKeeper と LinkedIn の Norbert という 2つのオープンソース・プロジェクトを利用する方法を Mukul Gupta と Paresh Paladiya が紹介します。" }
,{ "title": "Java.next: 関数型のコーディング・スタイル", "category": "java", "body": "すべての Java.next 言語には、開発者がより上位の抽象化レベルで考えることを可能にする、関数型プログラミングの構成体があります。しかし言語によって用語が異なるため、同様の構成体であることに、なかなか気付かないことがあります。今回の記事では、Java.next 言語のそれぞれで、共通の関数型プログラミングの構成体がどのような形で現れるのかを明らかにし、それらの機能の実装詳細における微妙な違いを指摘します。" }
,{ "title": "Node.js と MongoDB を使用してモバイル・アプリを開発する: 第 1 回 チームが採用した手法とその結果", "category": "java", "body": "Node.js (サーバー・サイドの JavaScript) を使用して Systems of Engagement (人と関わりあうシステム) を開発する利点を探ってください。この記事では、IBM Extreme Blue チームが Node.js と MongoDB を使用して、Systems of Engagement (人と関わりあうシステム) の概念を実証するアプリケーションである IBM Passes で挙げた成果を紹介します。このチームが Node.js と MongoDB を使用した経験は、企業でも使われ始めているこれらのソリューションを使用することで、いかに迅速なアプリケーション開発が実現できるかについて、興味深い洞察をもたらしてくれます。" }
,{ "title": "Java.next: カリー化と部分適用", "category": "java", "body": "カリー化と部分適用は、すべての Java.next 言語に組み込まれている手法ですが、その実装方法は言語によって異なります。今回の記事では、カリー化と部分適用について説明し、この 2 つの手法の違いを明らかにします。そして、Scala、Groovy、Clojure のそれぞれでの実装の詳細 (そして実際の使用例) を紹介します。" }
,{ "title": "External Data Service の概説", "category": "java", "body": "IBM Content Navigator における External Data Service の概要と構成方法を解説し、ユース・ケースに基づいてその機能について詳しく紹介します。" }
,{ "title": "Apache Lucene および Solr 4 による次世代の検索とアナリティクス", "category": "java", "body": "Apache Lucene と Solr は、組織が簡単かつ劇的にデータ・アクセス能力を高めることを可能にする、極めて能力の高いオープンソースの検索テクノロジーです。Lucene および Solr のバージョン 4.x では、データ駆動型アプリケーションに、今まで以上に簡単にスケーラブルな検索機能を追加できるようになっています。この記事では、Lucene と Solr のコミッターである Grant Ingersoll が、関連度、分散検索、ファセット処理に関係する、最新の Lucene と Solr の機能を紹介します。高速かつ効率的でスケーラブルな次世代のデータ駆動型アプリケーションを構築するために、これらの機能を利用する方法を学んでください。" }
,{ "title": "VoltDB 入門", "category": "java", "body": "NoSQL データベースが持つスケーラビリティーを実現するとともに、従来のリレーショナル・データベース・システムが持つ ACID 特性を備えたインメモリー・データベース、VoltDB について学んでください。この記事では、データベース・テーブルを設計してパーティショニングし、Java コードで作成されたストアード・プロシージャーを使用してデータの格納と取得を行う方法を説明します。さらに、VoltDB をベースに作成されたキー・バリュー型ストアである VoltCache についても探ります。" }
,{ "title": "Java アプリから動的に PDF ファイルを生成する", "category": "java", "body": "アプリケーションで PDF 文書を動的に作成する必要がある場合、iText ライブラリーが必要です。オープンソースの iText ライブラリーを使用すると、PDF を簡単に作成することができます。この記事では iText を紹介するとともに、iText を使用して Java アプリケーションから PDF 文書を生成する方法について順を追って説明します。また、iText についての理解を深めるために、サンプル・アプリケーションを作成します。" }
,{ "title": "関数型の考え方: 遅延処理、第 2 回", "category": "java", "body": "クロージャーをサポートする言語では、遅延評価を簡単に実装することができます。連載「関数型の考え方」の今回の記事では、Groovy のクロージャーをビルディング・ブロックとして使用して遅延リストを作成する方法を説明します。その後、言語によってはフィールドの初期化を遅延できるという点を含め、遅延評価のパフォーマンス上および概念上のメリットを探ります。" }
,{ "title": "IBM Power Systems 上の Hortonworks で利用できる ISV ソリューション・エコシステム", "category": "linux", "body": "この記事では、IBM Power System 上の Linux で稼働する Hortonworks Data Platform (HDP) の機能を増補するために利用できる ISV ソリューションをリストアップします。これらのソリューションのカテゴリーは、ビジネス・インテリジェンス (ツール) から先進的なアナリティクスまで、多岐にわたります。" }
,{ "title": "SAS Foundation の混合ワークロードに対応する新しいソフトウェア定義型コンバージド・インフラストラクチャーの徹底調査", "category": "linux", "body": "この記事では、SAS Foundation Mixed Analytics ワークロードをデプロイするための新しいソフトウェア定義型コンバージド・インフラストラクチャーの背景を詳しく説明します。IBM Elastic Storage Server (ESS)、IBM Spectrum Scale、IBM POWER8、および Mellanox ネットワーキング・テクノロジーを使用したこのコンバージド・インフラストラクチャーに適用されたテスト構成とテスト・シナリオ、そしてそれらのテストによるパフォーマンス結果と、結果に応じたチューニング手段を詳細に記載します。最適なパフォーマンスを達成できるよう、このインフラストラクチャーに含まれる各コンポーネントのチューニング方法ならびにソリューションのチューニング方法を学んでください。" }
,{ "title": "PowerVC の OpenStack REST API を探る", "category": "linux", "body": "IBM PowerVC (Power Virtualization Center) は、Power Systems 環境における仮想リソースの管理を単純化することを目的として OpenStack をベースに設計された、IBM Power プラットフォーム用 IaaS クラウド・ソリューションです。PowerVC では、GUI でも RESTful API でも、Power System の仮想管理タスクを行えるようになっています。この記事では、PowerVC Standard Edition と Cloud PowerVC Manager の両方の REST API にハイライトを当てます。" }
,{ "title": "シェル・スクリプトでの Watson Natural Language Classifier の使用方法", "category": "linux", "body": "Watson サービスをコマンド・ラインで使用するのは、不可能なことではなく、有益なことです。このレシピは、コマンド・ラインまたはシェル・スクリプトを介して Natural Language Classifier 用 Watson API と対話する方法を理解する上で役立ちます。" }
,{ "title": "Linux の 101 試験対策: ローカリゼーションと国際化対応", "category": "linux", "body": "ロケールとタイムゾーンの設定を使用して、Linux システム環境を適切な時刻と場所に設定する方法を学んでください。このチュートリアルの内容は、Linux のシステム管理者として認定するための LPI 102 試験に備えるためにも、自ら活用するために学ぶ上でも役立ちます。" }
,{ "title": "IBM Cloud と IBM Containers を利用して、Linux ベースのチェス・アプリをクラウド上に配置する", "category": "linux", "body": "WebSocket を使用して既存の Linux CLI チェス・エンジンをクラウド・サービスとして公開する Docker コンテナーを作成してください。このチュートリアルでは、Docker コンテナーを作成し、それを実行中のコンテナーとして IBM Containers for IBM Cloud にデプロイするプロセスをステップ・バイ・ステップで説明します。チュートリアルにはサンプル・コードの他、ブラウザー内で実行されて WebSocket ベースのサービスを使用する方法を説明する JavaScript チェス・ゲームも付属しています。ここでデモする手法を適用すれば、ほぼすべてのパイプ・ベースの Linux アプリケーションをコンテナー化し IBM Cloud 上でクラウド・サービスとして利用することができます。" }
,{ "title": "IBM POWER8 上で稼働する Hortonworks Data Platform (HDP) を使用した SAS ソフトウェア", "category": "linux", "body": "この記事では、SAS が Hortonworks Data Platform (HDP) 上に保管されているデータにアクセスし、そのデータを分析できるようにするために、SAS/ACCESS Interface to Hadoop を使用して環境をセットアップする方法を説明します。この環境は、IBM POWER8 プロセッサー・ベースのサーバー上で稼働します。" }
,{ "title": "カスタム・スクリプトを使用した、サーバー・リソース使用状況の継続的モニタリング", "category": "linux", "body": "IT インフラストラクチャーの安定性を確保するためには、モニタリングが不可欠です。要件が変わる中、効率的かつスケーラブルで、カスタマイズできる軽量のモニタリング・ソリューションを選ぶのは、常に難しい課題となります。エージェント・ベースのモニタリング手法では、使用されているモニタリング・ツールのデフォルトであるあらゆるデータを収集しますが、それとは異なり、カスタム・スクリプトを利用すればスマートなモニタリングを実現できます。この記事では、カスタム・スクリプト手法によるシステム・リソースのモニタリングについて説明します。この手法では、どのデータをプルするかを判断できるよう、データ・コレクター・ノード上で実行されるデータ・コレクター・スクリプトがターゲット・システムをポーリングします。" }
,{ "title": "Linux の 101 試験対策: ファイルシステムの整合性の維持", "category": "linux", "body": "Linux ファイルシステムの整合性をチェックする方法、空きスペースを監視する方法、そしてファイルシステムでの単純な問題を修復する方法を学んでください。Linux のシステム管理者として認定するための LPI (Linux Professional Institute) 101 試験に備えて勉強するために、そしてシステムが損傷した後や電源断が発生した後は言うまでもなく、単にファイルシステムをチェックして、良好な状態に保つために、このチュートリアルの内容を利用してください。" }
,{ "title": "Linux の 101 試験対策: ハードウェア設定の構成", "category": "linux", "body": "コンピューター・ハードウェアを Linux 用にセットアップする方法と、ハードウェアに関する情報を Linux のコマンドとツールで調べる方法を学んでください。このチュートリアルの内容は、Linux システム管理者認定用の LPIC-1 101 試験に備えて勉強するために利用することも、楽しんで学習するために利用することもできます。" }
,{ "title": "perf annotate を使用してパフォーマンスを分析する", "category": "linux", "body": "この記事では、実際のコードとそのアセンブリー命令に沿ってパフォーマンスを詳細に分析するために、perf annotate を使用する方法をデモンストレーションします。また、アーキテクチャー間でアノテーションを生成する新しい機能を使用して、あるアーキテクチャー上で記録されたプロファイルを別のアーキテクチャー上で分析する方法についても説明します。その一例として、IBM PowerPC 上でプロファイル・データを記録し、ノートブックまたは x86 システム上でアノテーションを生成する手順を紹介します。" }
,{ "title": "Open Source POWER Availability Tool", "category": "linux", "body": "IBM POWER アーキテクチャー上で動作する Linux オープンソース・パッケージを検索してください。" }
,{ "title": "EnterpriseDB Postgres Advanced Server のための IBM Power Systems ソリューション", "category": "linux", "body": "この記事では、Linux を稼働する IBM Power Systems サーバー上に EnterpriseDB Postgres Advanced Server データベースをインストールしてチューニングする際の一般的な手順について説明します。IBM Power サーバーには、同様の構成の Intel Xeon プロセッサー・ベース・システム (Broadwell) に比べ、遥かに大きな利点があります。" }
,{ "title": "ハイブリッド (IBM Power および x86) アーキテクチャーのシナリオでの Mesos と Kubernetes", "category": "linux", "body": "実際の本番環境では、私たちの顧客がハイブリッド・アーキテクチャーやハイブリッド分散システムなどで構成される複雑なアプリケーション実行環境を使用していることは珍しくありません。また、顧客は統合コンテナー・クラウド・プラットフォームを使用する傾向があり、Mesos のフレームワークとしては常に Kubernetes を使用しています。ハイブリッド・アーキテクチャーで Mesos クラスターに Kubernetes をセットアップするには、この記事を参考にしてください。" }
,{ "title": "リトルエンディアン対応の RHEL 7.1 上に Mesos/Marathon クラスターをセットアップする", "category": "linux", "body": "この記事では、OpenPOWER サーバー上に Mesos/Marathon クラスターをセットアップする手順を説明します。" }
,{ "title": "Linux を稼働する IBM Power Systems 上に MongoDB を導入する", "category": "linux", "body": "Linux を稼働する IBM Power Systems 上に MongoDB を導入すると、ビッグデータ・ワークロードを管理するのに理想的なソリューションになります。MongoDB をインストールおよび使用するにはどのようにするのかを学んで、今日からアプリケーションとデータ・セットとともに、このデータベースを使い始めてください。" }
,{ "title": "機械学習と、深層学習の基礎知識", "category": "linux", "body": "この記事では、さまざまなタイプのアナリティクスとの適合性が増してきている機械学習について解説するとともに、深層学習の概要を説明します。機械学習と深層学習を使用する場合の全体的なプロセスと、IBM<!--&lt;reg/&gt;--> Power Systems<!--&lt;trade/&gt;--> 上で機械学習を導入する際の選択肢を示します。" }
,{ "title": "Docker コンテナー・ネットワークを使用する", "category": "linux", "body": "セキュアに連動する Web アプリケーションを構築するには、Docker のネットワーク機能を使用してください。ネットワークとは、定義上、コンテナーを完全に分離するためのものです。したがって、アプリケーションの実行場所とするネットワークを制御することが重要となります。その制御を可能にするのが、Docker コンテナー・ネットワークです。以下の記事で、Docker エンジンがデフォルトで作成するネットワークのタイプについて解説し、独自のユーザー定義ネットワークを作成する方法を紹介します。" }
,{ "title": "オーケストレーションによって Docker コンテナーを管理する", "category": "linux", "body": "Docker は、コンテナーをデプロイ、実行、管理するためのツールです。この記事では、Linux on Power Systems 用 Docker バイナリーへのリンクを記載し、そのインストール手順を説明します。" }
,{ "title": "基本 HTTP 認証でサポートされた Docker プライベート・レジストリーをセットアップする", "category": "linux", "body": "Red Hat Enterprise Linux (RHEL) 7.1 LE を実行する OpenPower サーバーに、TLS および HTTP 認証を使用する Docker プライベート・レジストリーをセットアップする方法を学んでください。" }
,{ "title": "Ubuntu 14.04 が動作する IBM SoftLayer OpenPOWER 上に Apache Bigtop v1.1 を導入するためのクイック・スタート・ガイド", "category": "linux", "body": "この記事では、Ubuntu 14.04 を実行する IBM SoftLayer POWER8 ベアメタル・サーバー上に Apache Hadoop と Spark Bigtop v1.1.0 のバンドルをインストールするプロセスについて概説します。バンドルされたインストール・スクリプトには、初期ベンチマーク・スイートを実行するための Apache Zeppelin ノートブックが含まれています。" }
,{ "title": "IBM Power Virtualization Center (PowerVC) を導入する", "category": "linux", "body": "クラウド・コンピューティングでは、仮想化が重要な役割を果たします。IBM Power Virtualization Center (PowerVC) は、OpenStack をベースに新たに作成された仮想化管理ツールです。このツールは、Power Systems 環境での仮想リソースの管理を単純化して、管理者の生産性を向上させることを目的に設計されています。このチュートリアルでは、PowerVC の基本概念、インストール方法、基本的な構成方法、ならびにホスト、ストレージ、ネットワークなどの各種リソースを構成する方法を説明します。さらに、仮想マシンとイメージに目を向け、PowerVC を使用して VM を作成および管理する方法を、画面を参考にしながら紹介します。" }
,{ "title": "Linux の 101 試験対策: ランレベル、ブート・ターゲット、シャットダウン、リブート", "category": "linux", "body": "Linux システムをシャットダウンまたはリブートする方法、ユーザーにシステムが停止することを警告する方法、そしてシステムの使い方にさまざまなレベルで制限を設けるためのランレベルを切り替える方法を学んでください。このチュートリアルの内容は、2015年 4月に更新された LPI の試験項目のバージョン 4.0 に対応しており、LPIC-1: Linux Server Professional Certification に備えて勉強するために利用することも、単にシャットダウン、リブート、そしてランレベルの変更について学ぶために利用することもできます。" }
,{ "title": "Linux の 101 試験対策: RPM および YUM によるパッケージ管理", "category": "linux", "body": "Linux システム上でパッケージをインストール、アップグレード、そして管理する方法を学んでください。このチュートリアルで焦点とするパッケージ管理ツールは、Red Hat によって開発された RPM (Red Hat Package Manager) と、当初はデューク大学物理学部で Red Hat Linux システムを管理するために開発された YUM (Yellowdog Updater Modified) です。このチュートリアルの内容は、Linux のシステム管理者として認定するための LPI 101 試験に備えて勉強するために利用することも、単に新しいソフトウェアを追加してシステムを最新の状態に維持する最善の方法を探るために利用することもできます。" }
,{ "title": "Linux の 101 試験対策: LPIC-1 のロードマップ", "category": "linux", "body": "このロードマップを利用して、基本的な Linux タスクの習得および復習に役立つ IBM developerWorks のチュートリアルを見つけてください。プロフェッショナルの Linux システム管理者として認定されることを目指しているとしたら、このロードマップで紹介するチュートリアルは、Linux Professional Institute の LPIC-1: Linux Server Professional Certification 101 試験および 102 試験に備えるためにも役立ちます。このロードマップは、101 試験と 102 試験の 43 の項目に従って編成されています。LPIC-1 の認定を取得するには、この 2 つの試験に合格する必要があります。" }
,{ "title": "Linux の 101 試験対策: システム・ファイルの検索と配置", "category": "linux", "body": "Linux システムでのファイルシステム階層標準 (Filesystem Hierarchy Standard: FHS) に従った正しいファイルの配置場所について学び、重要なファイルとコマンドを検索する方法を覚えてください。このチュートリアルの内容は、Linux のシステム管理者として認定するための LPI 101 試験に備えて勉強するために利用することも、単にファイルの編成および管理について調べるために利用することもできます。" }
,{ "title": "Linux の 101 試験対策: ディスク・クォータの管理", "category": "linux", "body": "個々のユーザーが許容されている容量以上のスペースを使用することや、ファイルシステム全体が思いがけずフルになることがないように、Linux ファイルシステムにディスク・クォータを設定してチェックする方法を学んでください。このチュートリアルの内容は、Linux のシステム管理者として認定するための LPI 101 試験に備えて勉強するために利用することも、クォータについて学ぶためだけに利用することもできます。" }
,{ "title": "Linux の 101 試験対策: ファイルシステムのマウント、アンマウントの制御", "category": "linux", "body": "Linux ファイルシステムをマウントする方法、USB や IEE 1394 などのリムーバブル・デバイスを構成して使用する方法、そしてフロッピーディスク、CD、DVD に正しくアクセスする方法を学んでください。このチュートリアルの内容は、Linux のシステム管理者として認定するための LPI 101 試験に備えて勉強するために利用することも、単に Linux ファイルシステムにアクセスする方法を学ぶために利用することもできます。" }
,{ "title": "Linux の 101 試験対策: パーティションおよびファイルシステムの作成", "category": "linux", "body": "ディスク・ドライブにパーティションを作成する方法、そしてパーティションをフォーマットして、Linux システムでスワップ領域またはデータ領域として使用する方法を学んでください。Linux Professional Institute の LPIC-1: Linux Server Professional Certification 101 試験に備えて勉強するためや、単にパーティションと Linux ファイルシステムについて学んで自分で使用するために、このチュートリアルの内容を利用してください。" }
,{ "title": "Linux の 101 試験対策: ファイルのパーミッションと所有権の管理", "category": "linux", "body": "Linux ファイルシステムでのファイルの所有権とパーミッションを管理する方法を学んでください。このチュートリアルでは、suid、sgid、スティッキー・ビットなどのアクセス・モードについて解説し、これらの機能を使用してセキュリティーを強化する方法を説明します。このチュートリアルの内容は、Linux のシステム管理者として認定するための LPI 101 試験に備えて勉強するために利用することも、ファイルの所有権、パーミッション、セキュリティーについて学ぶためだけに利用することもできます。" }
,{ "title": "Linux の 101 試験対策: ハード・リンクとシンボリック・リンクの作成および変更", "category": "linux", "body": "Linux システム上でファイルのハード・リンクとシンボリック・リンクを作成し、管理する方法を学んでください。このチュートリアルの内容は、Linux のシステム管理者として認定するための LPI 101 試験に備えて勉強するために利用することも、ハード・リンクとソフト・リンク (別名、シンボリック・リンク) の違いを探り、ファイルをコピーする代わりに、ファイルへのリンクを張る最善の方法を調べるためだけに利用することもできます。" }
,{ "title": "Linux の 101 試験対策: シェル環境のカスタマイズと使用", "category": "linux", "body": "Linux シェル環境をカスタマイズして、単純な bash 関数を作成する方法を学んでください。このチュートリアルの内容は、Linux のシステム管理者として認定するための LPI 102 試験に備えて勉強するために利用することも、楽しんで学習するために利用することもできます。" }
,{ "title": "IBM POWER8 と x86 に Red Hat Enterprise Linux 7.2 をベア・メタル・モードでインストールする: 比較", "category": "linux", "body": "この記事は、IBM POWER8 プロセッサー・ベースのシステムに Red Hat Enterprise Linux をベア・メタル・モードでインストールする必要がある管理者に役立つ記事として、x86 システムへのインストール・プロセスとの比較を行います。" }
,{ "title": "Linux の 101 試験対策: システムのブート", "category": "linux", "body": "Linux システムのブート・プロセスを操作する方法を学んでください。このチュートリアルの内容は、2015年 4月に更新された LPI の試験項目のバージョン 4.0 に対応しており、Linux システム管理者認定用の LPIC-1 101 試験に備えて勉強するために利用することも、単にブート・プロセスについて学習するために利用することもできます。" }
,{ "title": "Linux の 101 試験対策: Debian によるパッケージ管理", "category": "linux", "body": "Linux システムでパッケージをインストール、アップグレード、および管理する方法を学んでください。このチュートリアルで焦点とするパッケージ管理システムは、APT (Advanced Packaging Tool) です。APT は、Debian、そして Debian から派生した Ubuntu などのディストリビューションで使用されています。このチュートリアルの内容は、Linux システム管理者認定用の LPI 101 試験に備えて勉強するために利用することも、新しいソフトウェアを追加してシステムを最新の状態に維持する最善の方法を知るために利用することもできます。" }
,{ "title": "Linux の 101 試験対策: ブート・マネージャーのインストール", "category": "linux", "body": "Linux システムのブート・マネージャーを選択する方法、そして選択したブート・マネージャーを構成する方法を学んでください。このチュートリアルの内容は、Linux システム管理者認定用の LPI 101 試験に備えて勉強するために利用することも、楽しんで学習するために利用することもできます。" }
,{ "title": "IBM AIX と Linux on Power の間でのプロセッサー使用率の違い ― 同一条件での比較", "category": "linux", "body": "この記事では、IBM AIX と Linux on Power との間でプロセッサー使用率を比較するために、ネットワーク・ワークロードを利用して行った事例研究について説明します。また、同じワークロードを実行する場合でも、AIX プラットフォーム上で実行する場合と Linux on Power プラットフォーム上で実行する場合とでは、IBM Power ハードウェア上でレポートされるシステム全体でのプロセッサー使用率が著しく異なる理由についても探ります。" }
,{ "title": "Linux の 101 試験対策: 共有ライブラリーの管理", "category": "linux", "body": "どの共有ライブラリーに Linux の実行可能プログラムが依存しているのかを判断する方法、またそれらのライブラリーをロードする方法を学びましょう。このチュートリアルの内容は、Linux システム管理者認定用の LPI 101 試験に備えて勉強するために利用することも、楽しんで学習するために利用することもできます。" }
,{ "title": "企業で利用する Node.js 用の IBM ツール: IBM SDK for Node.js のコア・ダンプ・デバッグ機能", "category": "linux", "body": "IBM SDK for Node.js と連動する Eclipse アドオンを使用して、Node.js アプリケーションの異常終了とメモリー・リークをデバッグしてください。" }
,{ "title": "LAMP アプリケーションを Bluemix にマイグレーションする", "category": "linux", "body": "昔ながらの LAMP アプリケーション (Drupal) を IBM Bluemix にマイグレーションする方法を学んでください。" }
,{ "title": "Linux on z Systems 向けインライン・アセンブリーの高度な機能", "category": "linux", "body": "この記事では、Linux on z Systems 向けの IBM XL コンパイラーでサポートされているインライン・アセンブリーの高度な機能について説明します。対象とする読者は、IBM XL コンパイラーが提供する最適化の範囲を超えて、アプリケーションの中で最もパフォーマンスに影響するコード部分を微調整したいと思っているソフトウェア技術者です。" }
,{ "title": "IBM z Systems の IBM XL C/C++ コンパイラーとインライン・アセンブリーを使用してパフォーマンスを向上させる", "category": "linux", "body": "IBM XL C/C++ for Linux on z Systems コンパイラーのバージョン 1 が 2015年にリリースされました。Linux on z Systems 向けの IBM コンパイラーでインライン・アセンブリー機能がサポートされたのは、今回が初めてです。インライン・アセンブリーを利用すると、ソフトウェア技術者はアプリケーションの中で最もパフォーマンスに影響する部分をアセンブラーでハンドコーディングすることで、アプリケーションの実行にかかる時間をさらに縮めることができます。この機能は、IBM z Systems のハードウェアの優位性とプログラマーの才能を最大限活かすことで、ハイパフォーマンス・アプリケーションの開発を実現します。この記事は、z Systems のインライン・アセンブリーで使用するアセンブラー命令について紹介することを目的としています。対象とする読者は、IBM XL C/C++ for Linux on z Systems コンパイラーが提供している最適化の範囲を超えて、z Systems 上の高速なアプリケーションの中で最もパフォーマンスに影響するコード部分を微調整したいと思っている上級ソフトウェア技術者です。" }
,{ "title": "Linux on z Systems 向けインライン・アセンブリーの基礎", "category": "linux", "body": "インライン・アセンブリーを利用すると、ソフトウェア技術者は C/C++ プログラムの中で最もパフォーマンスに影響する部分をアセンブラー・コードでハンドコーディングすることができます。この機能は、IBM z Systems のハードウェアの優位性とプログラマーの才能を最大限活かすことで、ハイパフォーマンス・アプリケーションの開発を実現します。この記事では、Linux on z Systems 向けの IBM XL コンパイラーでサポートされているインライン・アセンブリーの基礎を説明します。" }
,{ "title": "Linux の 101 試験対策: ハード・ディスクのレイアウト", "category": "linux", "body": "Linux システムにおけるディスク・パーティションの構成を設計する方法を学んでください。Linux Professional Institute LPIC-1: Linux Server Professional Certification 101 試験に備えるためや、自ら活用するために学ぶ上で、このチュートリアルの内容を活用してください。" }
,{ "title": "OpenPOWER ABI で関数コールのパフォーマンスを向上させる", "category": "linux", "body": "この記事では、関数コールのパフォーマンスを向上させるために OpenPOWER ABI (Application Binary Interface: アプリケーション・バイナリー・インターフェース) が導入している機能について説明します。64-bit IBM PowerPC ELF ABI Supplement 1.9 (ELF ABI v1) とは異なり、OpenPOWER ABI では、関数記述子を排除して、呼び出す側が環境を初期化しなくても済むようにしています。また、業界の現在のプラクティスに従って、呼び出される側が TOC ポインターを適切に設定するようにし、デュアル・エントリーを導入することで、要求に応じた設定が確実に行われるようにしています。さらに、レキシカルにネストしている関数コールも trampoline を使用してサポートしています。" }
,{ "title": "IBM PowerPC プロセッサーを使用した、ライブラリー関数の最適化手法", "category": "linux", "body": "この記事では、Power アセンブリーにおいてアプリケーションの動作を高速化するためのさまざまな最適化手法について説明します。IBM PowerPC プロセッサー専用のアプリケーションに特定の手法を適用することで、プログラム実行時のパフォーマンスが向上します。この記事で取り上げる手法の一部は、現在、Linux glibc のストリング関数とメモリー関数に適用されていて、その結果、大幅なパフォーマンス向上が実現されています。この記事は、IBM Power Architecture のパフォーマンス向上を目的にアセンブリー・コードを作成している IBM AIX および Linux プログラマーを対象としています。" }
,{ "title": "Linux on Power 向け Docker", "category": "linux", "body": "Docker は、コンテナーをデプロイ、実行、管理するためのツールです。この記事では、Linux on Power システム向け Docker バイナリーへのリンクを記載し、そのインストール手順を説明します。" }
,{ "title": "IBM XL コンパイラーにおける OpenMP サポート", "category": "linux", "body": "Fortran および C/C++ 用の Linux on Power リトルエンディアン対応 IBM XL コンパイラーは、OpenMP API V3.1 の機能に加え、V4.0 から選り抜いた一部の機能をサポートしています。これにより、コンパイラーでマルチコア・ハードウェアを利用してパフォーマンスを高めることが可能になっています。この記事では、最新の XL コンパイラーでサポートされている OpenMP の機能について説明します。さらに、これらの新しい機能を使用する利点を明らかにする例も記載します。" }
,{ "title": "IBM PowerLinux 対応 IBM Electronic Service Agent による IBM PowerKVM ホストに関する問題報告", "category": "linux", "body": "この記事では、IBM Electronic Service Agent (ESA) の使用方法と、IBM PowerKVM ホストに関するハードウェアの問題が自動的に報告されるようにするために管理者が行わなければならない構成について説明します。" }
,{ "title": "IBM Bluemix アプリを対象とした、リモート制御の Raspberry Pi 2 モニターを作成する", "category": "linux", "body": "IBM Internet of Things Foundation を利用してデバイスとアプリケーションを相互接続する実践プロジェクトを通して、モノのインターネットについて理解してください。このチュートリアルでは、実行中の IBM Bluemix アプリケーションのアップタイムと、このアプリケーションへのアクセス時間をモニタリングするように Raspberry Pi 2 をセットアップして、Bluemix にデプロイできるグラフ作成アプリケーションにそのモニタリング結果を取り込みます。さらに、この Raspberry Pi 2 モニターをリモートで制御するデスクトップ・アプリケーションのコーディングを行います。" }
,{ "title": "ハイパフォーマンスの AES (Advanced Encryption Standard) アプリケーションを実現する", "category": "linux", "body": "IBM XL コンパイラーが提供する新しい AES (Advanced Encryption Standard) 組み込み関数について詳細に分析するこの記事では、IBM XL コンパイラーが生成するコードを詳しく調べ、この組み込み関数を使用することでパフォーマンスが向上することを、例を用いて説明します。AES アプリケーションの多くは、連鎖モード (例えば、CBC (Cipher Block Chaining)、PCBC (Propagating Cipher Block Chaining)) またはフィードバック・モード (CFB (Cipher Feedback)、OFB (Output Feedback)) などの動作モードが持つ性質のため、並列化することができません。したがって、ハイパフォーマンスの AES アプリケーションを実現するには、組み込み関数によってパフォーマンスを向上させることが不可欠です。この記事は、IBM POWER8 プロセッサー上でハイパフォーマンスのアプリケーションを実現したいと考えているソフトウェア・エンジニアのためのものです。" }
,{ "title": "Linux on Power システム用に C/C++ でクロスコンパイルされたアプリケーションを開発する", "category": "linux", "body": "この記事では、IBM SDK for Linux on Power によって提供される統合環境で、IBM Advance Toolchain と QEMU ユーザー・モードを使用して、IBM Power サーバー用にクロスコンパイルされたアプリケーションを開発する方法を説明します。IBM SDK for Linux on Power は、無料で利用できる Eclipse ベースの統合開発環境 (IDE) です。この SDK によって、Advance Toolchain、ポストリンク最適化ツール、従来の Linux パフォーマンス分析ツール (OProfile、Perf、Valgrind など) が、C/C++ ソース開発環境に統合されます。" }
,{ "title": "IBM POWER8 システム上で Weather Research and Forecasting をコンパイルして実行する", "category": "linux", "body": "並列コンピューティング機能を提供する IBM POWER8 システム上で WRF (Weather Research and Forecasting) モデルとその依存パッケージをコンパイルしてインストールし、データを生成してこのアプリケーションを実行してください。" }
,{ "title": "FUSE を使用して独自のファイルシステムを開発する", "category": "linux", "body": "FUSE (Filesystem in Userspace) を使用すると、ファイルシステムの内部について理解したり、カーネル・モジュールのプログラミングを学習したりしなくても、ユーザー空間のファイルシステム・フレームワークを開発することができます。この簡単なステップ・バイ・ステップのガイドに従い、FUSE と AFS のインストール、カスタマイズ、および有効化を行うことによって、完全に機能するユーザー独自のファイルシステムを Linux のユーザー空間に作成することができます。" }
,{ "title": "Linux および Windows のシステム管理に最適な 3 つの Android ツール", "category": "linux", "body": "スマートフォンやタブレットから Android アプリを使用して、自分が使用しているマシンの Windows システムや Linux システム、UNIX システムにリモート接続することにより、システム管理を短い応答時間で行うことができ、どこにいても問題を解決することができます。" }
,{ "title": "ブート可能な IBM Power サーバーの ISO イメージの検出", "category": "linux", "body": "大半の ISO イメージは ISO 9660 の何らかの拡張規格を採用しており、BIOS (Basic Input/Output System) によってイメージをブートできるようになっています。その一方、IBM Power Systems ファームウェアではそのような拡張規格を採用していません。これが何を意味するかと言うと、イメージがブート可能であるかどうかを検出する方法は、コンピューター・アーキテクチャーによって異なるということです。ハイパーバイザー、さらには仮想マシン (VM) マネージャーなどのソフトウェアでは、そのソフトウェアで操作しなければならないイメージの数が多いことから、ブート可能であるかどうかの検出に大量のリソースや時間を費やすことはできません。したがって、試行錯誤でイメージをブートしようとする方法や、ファイル・システムにイメージをマウントしてみるという方法でさえも、選択肢から除外されます。この記事では、ISO データ・ストリームを直接読み込んで IBM Power サーバー・イメージがブート可能かどうかを検出するという方法を、この概念を説明する実際の Python コードと併せて紹介します。" }
,{ "title": "Intel x86 サーバー上で IBM PowerLinux アプリケーションをビルドする方法", "category": "linux", "body": "IBM Advanced Toolchain for PowerLinux クロスコンパイラーの真の価値は、開発者が使い慣れた開発プラットフォーム (ほとんどの場合、x86) で IBM Power Architecture 用のアプリケーションをコンパイルしてビルドできることにあります。この記事では、開発者がこの Toolchain クロスコンパイラーを使用して、Power Architecture で実行するためのソース・コードを簡単にビルドする方法を説明します。また、クロスコンパイルされたアプリケーションのパフォーマンスと機能に関する質問と、クロスコンパイルされたアプリケーションを IBM PowerLinux サーバーでネイティブにデバッグできるかどうかという質問にも答えます。" }
,{ "title": "Linux on x86 から Linux on Power へのアプリケーション移植ガイド", "category": "linux", "body": "この記事では、わかりやすいステップ・バイ・ステップのプロセスに沿って、Linux C/C++ アプリケーションを x86 プラットフォーム (Intel または AMD) から IBM PowerLinux に移植する方法を説明します。まず、この移植を行うための準備として何が必要かを説明してから、32 ビットまたは 64 ビットの x86 コードを PowerLinux 上で実行する場合の実装のヒントを紹介します。" }
,{ "title": "Software Defined Networking を使用して IaaS を最適化する", "category": "linux", "body": "この記事では IaaS (Infrastructure as a Service) を、相互運用性、ユーザーとプロバイダーの期待値マネジメント、開発者と管理者の要件、効果的なリスク軽減といった点で強化および最適化する手法としての SDN (Software Defined Networking) <mdash></mdash> ソフトウェア抽象化層を介したネットワーク管理手法 <mdash></mdash> について探ります。" }
,{ "title": "なぜ Linux on Power なのか？", "category": "linux", "body": "Linux ベースのアプリケーションを IBM Power ハードウェア上で実行すると、パフォーマンス、信頼性、セキュリティーが同時に強力な形で実現されます。この記事では、IBM Power Systems によってもたらされる戦略的優位の数々を明らかにします。読者の皆さんは、IBM Power Systems には数々の優位性がありながらも、さまざまなデプロイメントを低コストで実現できることに驚くかもしれません。この記事を読むことで、IBM が Linux でのエクスペリエンスを向上させるために使用しているツールについて学び、Linux on Power に対する IBM の将来的なコミットメントを十分に理解してください。" }
,{ "title": "Zypper を使用して SUSE Linux Enterprise Server をアップグレードする", "category": "linux", "body": "この記事では、Zypper を使用して SLES (SUSE Linux Enterprise Server) をアップグレードする方法に加え、リポジトリー構成ファイルを作成して変更するプロセスを説明します。" }
,{ "title": "4 KB セクター・ディスクで Linux を使用する: 実用的なアドバイス", "category": "linux", "body": "Advanced Format ディスクでは、より一般的な 512 バイトのセクターではなく、4,096 バイトのセクターが使用されます。この違いは、オペレーティング・システムのために 4,096 バイトの物理セクターを 512 バイト単位の論理セクターに分割するファームウェアによって表面的にはわからなくなっていますが、より大きなサイズの物理セクターを使用するということは、ディスクのレイアウトやシステムのパフォーマンスにも影響があるということです。この記事ではその影響について、いくつかの一般的な Linux ファイルシステムに実際に及ぶ可能性のある影響を示すベンチマーク・テストを交えて検討します。Advanced Format ディスクが標準的になっているなか、最適ではない構成による深刻なパフォーマンスの低下を回避したければ、これらのディスクに対処する方法を理解していることが不可欠のスキルとなります。" }
,{ "title": "Linux システムの起動プロセスをカスタマイズしてモニターする", "category": "linux", "body": "コンピューター・システムのブートにかかる時間を最小限に短縮することは重要です。それは、自宅のコンピューターを立ち上げる場合でも、数千人のユーザーに対してサービスを提供しているサーバーを再起動する場合でも変わりはありません。この記事では、さまざまな Linux ディストリビューションで使用されている、システムの起動およびシャットダウンの各種メカニズムを話題に取り上げ、新しいサービスを統合する方法、既存の起動構成をカスタマイズする方法を説明するとともに、システム起動構成の動作とパフォーマンスを詳しく調べていきます。" }
,{ "title": "OpenStack プライベート・クラウド用の Linux イメージと Windows イメージを作成する", "category": "linux", "body": "この記事では、OpenStack クラウド・オペレーティング・システムを使用して構築されたプライベート・クラウド用に、Linux イメージと Windows イメージを作成する新しい方法を提案します。OpenStack 環境用のイメージを作成するために現在採られている方法は、面倒で時間がかかります。そこで著者たちは、プライベート・クラウドのオペレーターとエンド・ユーザーが今までよりも迅速かつ容易にイメージを作成するためのオンラインのセルフサービス方式を提案します。" }
,{ "title": "IBM InfoSphere Streams3.2ハンズオン・ラボ: 入門編【ラボ3】", "category": "linux", "body": "このラボでは、オペレーターを追加することで、これまで構築してきたアプリケーションを強化します。これにより、追跡している各車両別に、5つの観測ごとの平均速度を計算します。その後、Streams Console を使用し、結果を視覚化します。" }
,{ "title": "IBM InfoSphere Streams3.2ハンズオン・ラボ: 入門編【ラボ4】", "category": "linux", "body": "このラボでは、オペレーターを追加することで、これまで構築してきたアプリケーションを強化します。これにより、追跡している各車両別に、5つの観測ごとの平均速度を計算します。その後、Streams Console を使用し、結果を視覚化します。" }
,{ "title": "IBM InfoSphere Streams3.2ハンズオン・ラボ: 入門編【ラボ2】", "category": "linux", "body": "このラボでは、車両データのフィルタリング・アプリケーションの開発をさらに進めていきます。また、データ・フローに対する理解を深め、実行中のアプリケーションをモニタリング・確認するStudio 機能について詳しく学びます。分かりやすくするため、データがなくなる前に何が起こっているのかを見られるようにする 2 つの拡張機能を作成していきます。1 つ目は流れを遅くする機能(そのままでは、Streams は速過ぎます)、2 つ目は複数のファイルを読めるようにする機能です。これは、開発とデバッグの一般的な設計パターンです。" }
,{ "title": "IBM InfoSphere Streams3.2ハンズオン・ラボ: 入門編【ラボ1】", "category": "linux", "body": "このラボでは、シンプルなシナリオに合わせ、アプリケーションを開発します。ここでのシナリオは、車両のロケーション、速度、およびその他のセンサーに関するデータをファイルから読み取り、特定の車両の観測値を探し、選んだ観測値を別のファイルに書き込むというものです。これは厳密に言うとデータのストリームではありませんが、ファイルI/O が Streamsアプリケーションの開発において、なぜ、どのように重要となるのかを考察し、後ほどデータ・ストリームのシミュレーションに、どのように活用できるのかをお見せします。" }
,{ "title": "IBM InfoSphere Streams3.2ハンズオン・ラボ: 入門編【概要】", "category": "linux", "body": "IBM InfoSphere Streams (「Streams」)により、大容量の変動する情報を継続的かつ非常に迅速に分析できるようになり、ビジネス上の洞察と意思決定を改善できるようになります。また、InfoSphere Streamsは、データ・ストリーム内に存在する情報の取り込み、フィルタリング、分析、相関を行う、ユーザーが開発したアプリケーションの実行プラットフォームやサービスともなります。" }
,{ "title": "KVM 仮想化を使用する", "category": "linux", "body": "ほとんどの Linux システムでは、仮想マシン (VM) を作成およびサポートするためのデフォルトのオープンソース・メカニズムを、これまで使用していた Xen からカーネルベースの仮想マシン (KVM: Kernel-based Virtual Machine) へと大々的に置き換えています。こうした変化の背景にあるのは、技術に関する問題ではなく、主にビルドやサポートに関する問題ですが、仮想化に関心を持つ多くの企業の IT グループは現実問題として、KVM に使用される管理コマンドや制御ツールについて学ぶ必要があります。同様に、既に Xen 仮想化に投資をしていて KVM に移行しようとする IT 企業は、VM を作り直すのではなく、可能な限り既存の VM を KVM でサポートされるフォーマットに変換する必要があります。" }
,{ "title": "Twitter Storm でビッグ・データをリアルタイムに処理する", "category": "linux", "body": "Storm は、オープンソースのビッグ・データ処理システムです。Storm はリアルタイム分散処理を対象としている点、そして言語に依存しないという点で、他のビッグ・データ処理システムとは異なります。Twitter の Storm とそのアーキテクチャー、そしてさまざまなバッチ処理ソリューションおよびストリーム・プロセッシング・ソリューションについて学んでください。" }
,{ "title": "SoftLayer への移行: Racemi Cloud Path サービスを使用して、Red Hat Enterprise Linux VM インスタンスを SCE から SoftLayer にマイグレーションする", "category": "linux", "body": "IBM SmarterCloud Enterprise から IBM SoftLayer に Red Hat Enterprise Linux 5.x または 6.x のインスタンスを安全にマイグレーションする方法を学びましょう。" }
,{ "title": "SoftLayer への移行: Linux インスタンスを SCE から SoftLayer へマニュアルでマイグレーションする", "category": "linux", "body": "IBM SmarterCloud Enterprise から IBM SoftLayer へ Red Hat Enterprise Linux (RHEL) VM インスタンスをマニュアルでマイグレーションする方法を学びましょう。" }
,{ "title": "PHP の学習: 第 3 回 認証、オブジェクト、例外、ストリーム処理", "category": "linux", "body": "このチュートリアルは、単純なワークフロー・アプリケーションの構築プロセスを通して PHP の使用方法を説明する 3 部構成のシリーズ「PHP の学習」の第 3 回です。今回のチュートリアルでは、HTTP 認証の使用方法、ファイルをストリーム処理する方法、そしてオブジェクトと例外の作成方法を学びます。" }
,{ "title": "Linux ブートの失敗からのリカバリー", "category": "linux", "body": "カーネルのアップグレードやディスク・スワップ、あるいはその他のシステム変更が行われた後に Linux コンピューターがブートしなくなったとしても、手の施しようがないわけではありません。GRUB (Grand Unified Bootloader) には、ブート・プロセスを制御してリカバリーするための手段がいくつかあります。あるいは、外部ツールを使って緊急ブート・ディスクを作成しておけば、必要に応じてそのディスクに救いの手を求めることができます。この記事では、問題がある状況下でもブートできるようにするための手順および GRUB コマンドについて説明するとともに、BIOS ベースのシステムの「命を救う」外部ツールを紹介します。" }
,{ "title": "PHP の学習: 第 2 回 ファイルをアップロードし、ファイルの情報を XML または JSON 形式で保管し、表示する", "category": "linux", "body": "このチュートリアルは、単純なワークフロー・アプリケーションの構築プロセスを通して PHP の使用方法を説明する 3 部構成のシリーズ「PHP の学習」の第 2 回です。PHP の基礎知識を基に、ブラウザーからファイルをアップロードする方法や、セッションについて、あるいは PHP で XML または JSON を処理する方法について学ぶには、このチュートリアルに従ってください。" }
,{ "title": "共通テーマ: 実例でわかる awk: 第 1 回", "category": "linux", "body": "awk は、なんとも不思議な名前を持つすばらしい言語です。3 回の連載記事の第 1 回目で、Daniel Robbins 氏は、読者の awkプログラミング・スキルを急速に向上させてくれます。連載を進めるにつれ、より高度なトピックに触れ、最後には高度で実用的な awkアプリケーションのデモをご覧に入れます。" }
,{ "title": "LyX を使用してグラフィカルな方法で LaTeX 文書を作成する", "category": "linux", "body": "LyX は、お馴染みのドロップダウンによるコンテンツ駆動のメニュー・システムを使用して、LaTeX 文書を作成、編集するためのグラフィカルなツールです。TeX とその上位のマクロ言語である LaTeX は、強力な文書マークアップ言語であり、Linux ユーザーの間ではデファクト・スタンダードとなっています。しかし、これらの言語を初めて使用するとなると、使用可能なマークアップ・タグや、それらのマークアップ・タグを使用できるコンテキスト、さらにはテキスト・エディターとプレビュー用のツールの使い方などを知らなければならないため、扱いにくい言語かもしれません。LyX は、この LaTeX 文書を処理するプロセス全体を単純化します。それは、Linux 上での作業に限ったことではありません。Linux、UNIX、Windows、および Mac OS X システムに LyX をインストールして使用する方法、さらにはカスタマイズする方法を学んでください。" }
,{ "title": "bash 例解: 第 2 回 bash による初歩のプログラミングの続編", "category": "linux", "body": "bash に関する第 1 回の記事では、Daniel Robbins が、このスクリプト言語の基本要素を取り上げて、bash を使用するべき理由を示しました。この第 2 回の記事では、前回の続きから始めて、条件 (if-then) 文やループをはじめとする、bash の基本的な構成体について説明していきます。" }
,{ "title": "Cobbler によるシステム・インストールの自動化と管理", "category": "linux", "body": "Cobbler はインストール・サーバーのセットアップと管理に必要なタスクを一元化することで、システムのプロビジョニングを容易に行えるようにします。この記事では、Cobbler に備わっている機能の一部を取り上げて紹介するとともに、Cobbler をインストールする方法、複数のクライアント・マシンを自動的にインストールするのに適した構成を作成する方法を説明します。" }
,{ "title": "Scribus によるオープンソースのデスクトップ・パブリッシング", "category": "linux", "body": "Scribus は、レイアウト、フレーム、スタイル、色管理、ドキュメント内の列間のフローに重点が置かれたオープンソースのグラフィカル DTP (Desktop Publishing) ツールです。Scribus は Linux、Windows、Mac OS X プラットフォーム上で実行されるフリー・ソフトウェアであり、従来の DTP ツールの機能の大部分を無料で提供しています。" }
,{ "title": "Windows の世界で Linux を使用する", "category": "linux", "body": "インターネット上のほとんどのサーバーにとって最適なオペレーティング・システムである Linux は、デスクトップ・オペレーティグ・システムとして人気上昇中です。けれども、デスクトップ PC 上で Linux に移行しただけでは、仕事や趣味などで作業をするのに必要なリソースのすべてを引き続き操作できることが保証されるわけではありません。この記事では、デスクトップ Linux システムから、これまで使用していた Microsoft Windows のファイルとファイル・サーバーを操作できるようにし、さらに新しいネットワーク・ハードウェアを使用できるようにするために取り組む必要がある追加の構成タスクについて説明します。" }
,{ "title": "Linux の101 試験対策: ハード・ディスクのレイアウト", "category": "linux", "body": "Linux システムにおけるディスク・パーティションの構成を設計する方法を学んでください。この記事の内容は、Linux のシステム管理者として認定するための LPI 101 試験に備えるためにも、自ら活用するために学ぶ上でも役立ちます。" }
,{ "title": "Python で GObject をラップする", "category": "linux", "body": "GTK+ の C モジュールを Python で使用できるようにラップする方法がわかれば、いつでも好きなときに、特段 C 言語に長けていなくても、C 言語でコーディングされた GObject を Python で利用できるようになります。" }
,{ "title": "vi 入門 ― チート・シート手法", "category": "linux", "body": "このチュートリアルでは、強力なビジュアル・エディターである vi の使い方を説明します。このチュートリアルで目指しているのは、習得を早めるチート・シート手法を使うことで、長い時間をかけずに vi を使いこなせるようになることです。ファイル内での移動、テキストの編集、挿入モード、テキストのコピー・アンド・ペーストなどの操作方法、そしてビジュアル・モードやマルチウィンドウ編集などの重要な Vim 拡張機能を使用する方法を短時間で学んでください。" }
,{ "title": "OpenSSL API によるセキュア・プログラミング: 第 1 回 API の概要", "category": "linux", "body": "OpenSSL はセキュアな通信のための最もよく知られたオープン・ライブラリーですが、その API の使い方を学ぶのは一筋縄では行きません。それは、マニュアルの記述が不十分なためです。その欠落している部分をこの記事の情報で補って、API を使いこなせるようになってください。この記事では、基本的な接続をセットアップした後、OpenSSL の BIO ライブラリーを使用して、セキュアな接続をセットアップする方法、非セキュアな接続をセットアップする方法の両方を解説します。さらに、エラーの検出方法についても簡単に説明します。" }
,{ "title": "OpenSSL API によるセキュア・プログラミング: 第 2 回 セキュアなハンドシェーク", "category": "linux", "body": "SSL (Secure Sockets Layer) セッション期間中のハンドシェークをセキュアにすることは、極めて重要です。それは、接続に関するセキュリティーのほぼすべてがハンドシェーク内でセットアップされるためです。侵入者が信頼できる発信元になりすます中間者 (Man In The Middle: MITM) 攻撃からSSL ハンドシェークを守る方法を学んでください。この記事では、デジタル証明書の概念、そして OpenSSL API によるデジタル証明書の処理方法についても説明します。" }
,{ "title": "PHP の学習: 第 1 回 アカウントを登録し、承認を求めるファイルをアップロードし、承認されたファイルを表示してダウンロードする", "category": "linux", "body": "このチュートリアルは、単純なワークフロー・アプリケーションの構築プロセスを通して PHP の使用方法を説明する 3 部構成のシリーズ「PHP の学習」の第 1回です。今回のチュートリアルでは、HTML フォームを使用する基本的な PHP ページの作成手順と、データベースへのアクセス方法を説明します。" }
,{ "title": "Virtual Machine Manager で VM を管理する", "category": "linux", "body": "この記事では、virt-manager の使用方法、このツールが平均的なハードウェアで発揮する能力、そして実行中の VM のパフォーマンスを管理および監視する方法を詳しく探ります。" }
,{ "title": "アクセス不可能になったインスタンスを QEMU を使用してリカバリーする", "category": "linux", "body": "何らかの問題が発生して、IBM SmarterCloud Enterprise 上の Linux インスタンスにアクセスできないものが見つかったとしたら、どうしますか？この記事では、アクセス不可能になった Linux インスタンスをリカバリーする手順を説明します。その手順とは、プライベート・イメージを取り込み、そのイメージを永続ストレージにコピーし、QEMU を使用してイメージをブートするか kpartx でイメージをマウントして問題を修正した後、クラウドに再びインポートするというものです。" }
,{ "title": "System V のセマフォー API を使用して POSIX のセマフォー API を実装する", "category": "linux", "body": "「POSIX API を使用する必要があるものの、開発プラットフォーム (z/OS など) が POSIX APIをサポートしていない」ということはないでしょうか？あきらめることはありません。System V のセマフォー API を使用して POSIX のセマフォー APIを実装することで、皆さんが作成したコードをより多くのプラットフォームで使用できるようにし、そのコードを保守できる状態に保つ方法を学びましょう。" }
,{ "title": "Python、機械学習、そして NLTK ライブラリーについて探る", "category": "linux", "body": "機械学習は IT、数学、自然言語が組み合わされたものであり、通常はビッグデータ・アプリケーションに使用されます。この記事では Python プログラミング言語と Python の NLTK ライブラリーについて説明し、続いてそれらを機械学習プロジェクトに適用する方法について説明します。" }
,{ "title": "レジリエントな仮想サーバーを確実に準備する", "category": "linux", "body": "IBM PureFlex System は便利なことに、ハードウェアが事前に統合されて、管理スタックがプリロードされた状態で提供されます。けれども、PureFlex System でレジリエントな仮想サーバーをホストできるようにするには、あらかじめ、いくつかのステップを手作業で行わなければなりません。この記事では、著者たちがレジリエントな仮想サーバー (この記事では Red Hat の KVM ハイパーバイザーを使用します) をセットアップしてデプロイする方法を説明し、実演します。説明する手順は、IBM PureFlex System のファースト・リリースにフィックスパックを適用したバージョンで有効です。" }
,{ "title": "Spring Roo 入門: 第 7 回 Spring Roo を使って Spring MongoDB アプリケーションを開発する", "category": "linux", "body": "MongoDB は、非常によく使われている、水平スケーリング可能なドキュメント指向の NoSQL データストアです。Spring Roo バージョン 1.2 では、MongoDB をデータ・ストレージ・ソリューションとして使用した Spring アプリケーションを構築することができます。この記事では MongoDB について紹介した後、Spring Roo を使ってエンタープライズ Spring MongoDB アプリケーションを構築します。" }
,{ "title": "Yocto Project を使用して組み込み用のカスタム Linux ディストリビューションを作成する", "category": "linux", "body": "組み込み Linux 開発を容易に行い、さまざまなアーキテクチャー間で移植できるようにすることを目標に発足したオープンソース・プロジェクトが Yocto Project です。この記事では Yocto Project について紹介し、このプロジェクトを利用する方法について順を追って説明します。" }
,{ "title": "Ruby での REST (REpresentational State Transfer) を理解する", "category": "linux", "body": "REST (REpresentational State Transfer) は、クラウドで急速に共通語となりつつある、分散通信用のアーキテクチャーです。REST は単純ながらも、多数のクラウド・リソースと全体的な構成および管理を表すのに十分な表現力を備えています。Ruby を使用して単純な REST エージェントを一から開発する方法を学んで、その実装と使い方を理解してください。" }
,{ "title": "科学計算プラットフォームとしての Linux を探る", "category": "linux", "body": "Linux は科学計算に適した非常に優れたプラットフォームであり、学術界でさまざまなタスクを実行するために極めてよく使用されています。特定のアプリケーションに対応した Linux オープンソース・プロジェクトは数多くありますが、そのなかで Sage 数学プロジェクトではより包括的な問題解決機能を提供しています。この Sage をはじめとする、ひときわ高い注目を集めている科学アプリケーションの多くでは Python が主要言語として使用されており、この記事ではそれら Python を使用した科学アプリケーションを取り上げます。" }
,{ "title": "Linux ビギナーのための基本タスク", "category": "linux", "body": "Windows を使い慣れているユーザーにとって、初めての Linux システムは、今までとは少し勝手が違うと思うことでしょう。Linux システムでおそらく最初に行うことになるであろうタスクの 1 つが、IBM の Linux 向け拡張ソフトウェアを始めとする追加のソフトウェアをインストールすることです。多くの場合、Linux システムにソフトウェアをインストールするには、まずログインし、タスクによってはスーパー・ユーザー (または root) に切り替えてからターミナル・ウィンドウまたはシェル・ウィンドウを開き、CD-ROM ドライブ、DVD ドライブ、または USB ドライブをマウントしなければなりません。この記事では、このような Linux ユーザーとしての初めてのタスクを含め、Linux の基本的なタスクについて説明します。" }
,{ "title": "グリーン IT を促進する ― アプリケーションのマイグレーションおよびリホストの実用ガイド", "category": "linux", "body": "このガイドは、分散環境からアプリケーションのワークロードを移行した実際の経験を基に作成されています。具体的には、Power、pSeries、または RS/6000 ハードウェア上の AIX ワークロード、Sun ハードウェア上の Solaris ワークロード、あるいは x86 ハードウェア (つまり、IBM eServer から IBM System z までの主に IBM System z9 または z10 モデル) 上の Linux ワークロードなどです。" }
,{ "title": "LPI 試験対策: ネットワーク・クライアントの管理", "category": "linux", "body": "このチュートリアルは、Linux での中級レベルのネットワーク管理について取り上げる全 7 回からなるシリーズの第 5 回目です。今回も引き続き、David Mertz が LPI (Linux Professional Institute) の LPIC-2 (中級レベルの管理) 202 試験に備えるためのお手伝いをします。今回のチュートリアルではいくつかのプロトコルを取り上げ、ネットワーク内のクライアントのネットワーク設定を集中化して構成する方法をプロトコル別に検討します。DHCP は、IP アドレスの割り当てをはじめ、クライアント・マシンとの基本ハンドシェークを確立するために広く使われているプロトコルです。上位レベルでは、ネットワーク上のマシンの間で任意の情報を共有するために、NIS と (NIS よりも一般的な) LDAP が使用されています。このチュートリアルでは、柔軟でネットワーク化されたユーザー認証システム、PAM についても説明します。" }
,{ "title": "スマートフォンをセンサー兼アクチュエーターに変身させる", "category": "mobile", "body": "このチュートリアルでは、Watson IoT Platform を利用して単純な IoT ソリューションを作成するために、スマートフォンをセンサーに変身させてデータの読み取りと送信を行わせる方法、さらにデータを読み取ってアクションを実行するアクチュエーターとしても機能させる方法を説明します。" }
,{ "title": "PHP、jQuery Mobile、Google ToDo リストを活用してモバイル・フレンドリーな ToDo リスト・アプリを作成する", "category": "mobile", "body": "ToDo リストを作成および管理するためのシンプルなモバイル・アプリを作成したければ、Slim PHP マイクロフレームワーク、jQuery Mobile、Google ToDo リスト API を使用すると簡単です。この記事では、私がそれを行った方法を紹介します。" }
,{ "title": "Docker コンテナーを使用して迅速にモノのインターネット・アプリケーションを開発する", "category": "mobile", "body": "無線モジュール、センサー、マイクロコントローラーがコモディティー化されて入手しやすくなったこともあって、モノのインターネット (IoT) の急速な成長が進んでいます。しかし、IoT は機器の製造業者にとってだけのビッグ・ニュースではありません。相互に接続された機器の数が増えるにつれ、これらの機器とインターフェースを取って、機器から生成される膨大な量のデータを処理するアプリケーションの需要も高くなってきています。この高まる需要に対応するには、Web およびモバイル・アプリケーションの開発者は、IoT を対象とした開発をスタートさせて、現在の開発プラクティスをこの新しいアプリケーション領域の課題に対処するように適応させていかなければなりません。そのような開発プラクティスの 1 つが、コンテナーを使用する方法です。コンテナーは、仮想化を実現するための軽量の手法であり、開発者はコンテナーを広範に適用することで、IoT アプリケーションの開発、テスト、デプロイ、更新を迅速に行えるようになります。" }
,{ "title": "Geospatial Analytics サービスを利用してモバイル端末をモニターする", "category": "mobile", "body": "IBM Cloud の Geospatial Analytics サービスを利用する Node.js スターター・アプリケーションを取得して実行し、拡張してください。Geospatial Analytics サービスを利用すると、モノのインターネットに接続された移動中の端末をモニターすることができます。Geospatial Analytics サービスは、MQTT からの端末メッセージ・ストリームを分析し、1 つ以上の地域に関して端末の位置情報をリアルタイムで追跡します。" }
,{ "title": "位置認識機能を備えた IoT アプリを作成する、第 2 回: ジオターゲティング広告を IoT デバイスに配信する PHP アプリを作成する", "category": "mobile", "body": "この記事は、全 2 回からなるシリーズ「位置認識機能を備えた IoT アプリを作成する」の第 2 回です。位置認識機能を備えたアプリを作成する場合、IoT デバイスからリアルタイムのデータを受信するようになってもまだ五合目にすぎません。このようなアプリを完成させるためには、受信したデータに対して何らかのアクションが実行されるようにする必要があります。この記事では、PHP、MySQL、そして IBM Watson IoT Platform のルールを使用して、IoT デバイスからの着信データ・ストリームを処理し、その計算結果またはコマンドをリアルタイムでクラウドに送信する方法を説明します。有用な IoT ベースのアプリケーションを構築するには、このような双方向通信が鍵となります。" }
,{ "title": "位置認識機能を備えた IoT アプリを作成する、第 1 回: IoT デバイスから GPS データを取得して使用する PHP アプリを作成する", "category": "mobile", "body": "この記事は、全 2 回からなるシリーズ「位置認識機能を備えた IoT アプリを作成する」の第 1 回です。IoT アプリを作成しようとする PHP 開発者にとって、作業に取り掛かるのは困難な場合があります。そのような PHP 開発者のために、このチュートリアルではPHP で駆動する IBM Cloud IoT アプリケーションを構築するプロセスをステップ・バイ・ステップで解説します。このアプリケーションは、接続されたデバイスから IBM Watson IoT Platform に送信される位置情報データにサブスクライブし、Google Maps API を使用して、その位置情報データを地図の画像に反映させます。" }
,{ "title": "Watson および IoT Platform サービスを利用してホーム・アシスタント・モバイル・アプリケーションを構築する", "category": "mobile", "body": "このチュートリアルでは、モバイル・アプリケーションで Watson Conversation、Text to Speech、および Speech to Text サービスを利用してユーザーの命令を理解し、IBM IoT Platform サービスを介してデバイスを制御する方法を説明します。さらに、このモバイル・アプリからコマンドを受信し、イベントをモバイル・アプリに送信する Raspberry Pi を、ホーム・ゲートウェイとして統合する方法、そして Object Storage サービスを利用して画像を保管する方法を説明します。" }
,{ "title": "Bluemix、Watson Discovery、Cloudant を利用して、他のアプリを分析するモバイル・アプリを作成する", "category": "mobile", "body": "このチュートリアルで作成するアプリは、App Store から無料で入手できるアプリのうち、最も人気の高い上位 10 個のアプリに関するレビューを分析してから、それらのアプリの詳細を Cloudant を利用して保管します。" }
,{ "title": "WebSocket と SSE による HTTP サーバー Push", "category": "mobile", "body": "Web アプリケーションとモバイル・アプリケーションの中でリアルタイムのストリーミング配信を行うには、WebSocket と SSE という代表的なサーバー Push ソリューションがありますが、この 2 つはどのように異なるのでしょうか？このチュートリアルでは、Python Web アプリケーションを用いて、それぞれのプロトコルの長所と短所を明らかにします。さらに、WebSocket フロントエンド内での接続問題をトラブルシューティングで乗り越える方法を説明します。" }
,{ "title": "モバイル・ユーザー・インターフェースのスタイルとテーマを更新する", "category": "mobile", "body": "IBM Business Process Manager (BPM) V8.5.7 以降のリリースでは、プロセス参加者がモバイル端末から Process Portal を使用してプロセスのタスクを処理したり、モバイル端末を使用して自撮りした写真を追加してユーザー・プロファイルを更新したりできるようになっています。全 2 回からなるシリーズの第 1 回では、プロセス参加者が保存済み検索をどのようにして作成、使用、共有するのかと、タスク・リストをどのようにしてフィルタリング、ソート、カスタマイズするのかを説明しました。この第 2 回では、Coach レベルでユーザー・インターフェースのスタイルを設定するにはどのようにするのか、そしてプロセス・アプリケーション UI のテーマをどのようにして作成するのかを説明します。" }
,{ "title": "プロセス参加者向けのモバイル対応 Process Portal の詳細を探る", "category": "mobile", "body": "プロセス参加者は IBM Business Process Manager (BPM) のレスポンシブ対応 Process Portal を使って、プロセスのタスクを処理したり、モバイル端末からダッシュボードにアクセスしたり、スマートフォンを使用して自撮りした写真を追加してユーザー・プロファイルを更新したりできます。このチュートリアルで、これらのモバイル・ユーザー・インターフェースをどのようにしてテストするのかだけでなく、保存済み検索をどのようにして作成、使用、共有するのか、そしてタスク・リストをどのようにしてフィルタリング、ソート、カスタマイズするのかを学んでください。" }
,{ "title": "Bluemix を使用してクラウド内にモバイル・ジオフェンシング・アプリを作成する", "category": "mobile", "body": "モバイル・オペレーティング・システムでは、特定の地理的領域にデバイスが入ったというイベントや、そこから出たというイベントを検出できます。これらの円形の領域は、ジオフェンスと呼ばれています。この記事では、モバイル OS のジオロケーション機能と IBM Bluemix のサービスを利用して無数のジオフェンシングをモニタリングできる、IBM Bluemix モバイル・アプリケーションを作成するにはどのようにするのかを説明します。記事で説明するサンプル実装は、ジオロケーション検出に対応する iOS 用と Android 用のクライアント・サイドのコードと、複数の IBM Bluemix サービスを利用してジオフェンスを定義および保管するサーバー・サイドのコードで構成されています。" }
,{ "title": "Bluemix、Watson、および Apache Cordova を利用してハイブリッド・モバイル・アプリを構築する", "category": "mobile", "body": "この記事では、既存の Web アプリを簡単にハイブリッド・モバイル・アプリに変換する方法を説明します。ハイブリッド・モバイル・アプリを作成するために使用するツールは、皆さんがすでに愛用している JavaScript、HTML5、および CSS です。これらのツールで作成したコードをネイティブ・コードのシン・レイヤー内にラップして、位置情報、加速度計、カメラ、連絡先などの端末の機能にアクセスできるようにします。ハイブリッド・モバイル・アプリは、iOS、Android、Windows Phone などのプラットフォーム上でネイティブに実行されます。アプリ・ストアでも、ハイブリッド・モバイル・アプリが販売されています。" }
,{ "title": "何が見えますか？視覚面でのアクセシビリティーに対応したコグニティブ・アプリ", "category": "mobile", "body": "Bluemix、Apache Cordova、IBM Watson の Visual Recognition サービスおよび Text to Speech サービスを利用して、視力に問題があるユーザーを対象にアクセシビリティーを実現するモバイル・アプリを迅速に作成し、実行する方法を学んでください。" }
,{ "title": "クラウド内で気象情報追跡アプリケーションを構築する: 第 1 回", "category": "mobile", "body": "モバイル・アプリや Web アプリケーションに気象情報を組み込む必要がある方は、このチュートリアルを参考にすれば、すべて事足ります。この全 2 回からなるチュートリアルの第 1 回では、オンライン・サービスから世界の都市の緯度と経度の座標を取得して保管するための、ベースとなるアプリケーションを作成する方法を紹介します。このアプリケーションを構築するために、本チュートリアルでは Silex PHP マイクロフレームワークを使用し、データを保管するためには MongoDB を使用し、ユーザー・インターフェースには jQuery Mobile を使用します。" }
,{ "title": "クラウド内で気象情報追跡アプリケーションを構築する: 第 2 回", "category": "mobile", "body": "モバイル・アプリや Web アプリケーションに気象データを組み込もうとしている方のために、この全 2 回からなるチュートリアルの第 2 回では、IBM の新しい Insights for Weather サービスを紹介します。さらに最大 5 つまで世界の都市の気象情報を追跡するよう、第 1 回で作成した、ベースとなる PHP アプリケーションを更新する方法、そして完成したアプリケーションを IBM Bluemix 上でホストする方法を取り上げます。" }
,{ "title": "Bluemix 上で Cloudant NoSQL DB サービスと IBM Push Notifications サービスを利用して Android アプリを作成する", "category": "mobile", "body": "IBM Bluemix 上で Cloudant NoSQL DB サービスを利用して Android アプリを作成してください。このシリーズでは、それぞれの回で新しいサービスを紹介しながら少しずつアプリを作成していきます。今回のチュートリアルには、デモ、サンプル・コード、そして BlueList Android アプリを作成するための完全な手順が含まれています。これまでに学んだことを活かして、Cloudant NoSQL DB サービス、IBM Push Notifications サービス、Node.js によるサービスを皆さん独自のアプリに統合することができます。" }
,{ "title": "Bluemix 上で IBM Push Notifications サービスを利用して Android アプリを拡張する", "category": "mobile", "body": "IBM Bluemix 上で利用可能な IBM Push Notifications サービス、Node.js によるサービスを利用して Android アプリを作成してください。今回のチュートリアルには、サンプル・コードと、BlueList Android アプリを作成するための完全な手順が含まれています。" }
,{ "title": "PHP、MongoDB、IBM Bluemix を使ってメモ帳アプリケーションを作成する", "category": "mobile", "body": "この記事では、PHP、MongoDB、Bootstrap を使用して Web ベースのメモ帳アプリケーションを作成し、IBM Bluemix を利用してビルド、デプロイする方法を紹介します。このメモ帳アプリケーションでは、高速かつスケーラブルなドキュメント・ストレージとして MongoDB を使用し、アプリケーションのビジネス・ロジック用に Slim PHP マイクロフレームワークを使用し、応答性に優れたモバイル・フレンドリーなユーザー・インターフェースには Bootstrap を使用します。" }
,{ "title": "IBM Bluemix を利用して、クラウド内で投資追跡アプリケーションを作成してデプロイする: 第 1 回", "category": "mobile", "body": "この全 2 回からなる連載の第 1 回では、オープン API を使用して金融データに接続し、必要なデータを取得する方法を紹介します。モバイル対応のインターフェース・フレームワークを使用することで、アプリケーションはデスクトップ・コンピューター上でもモバイル端末上でも同じように有効に機能するようになります。さらにアプリケーションを IBM Bluemix 上にホストすることで、信頼性とスケーラビリティーが確保されます。" }
,{ "title": "IBM Bluemix を利用して、クラウド内で投資追跡アプリケーションを作成してデプロイする: 第 2 回", "category": "mobile", "body": "この全 2 回からなる連載の第 2 回では、第 1 回で開発した PHP アプリケーションの中で金融データを使用して、投資ポートフォリオを正確かつ即座に評価する方法を紹介します。" }
,{ "title": "多忙な Java 開発者のための Sails.js ガイド: Sails を使用して基本的な Web アプリを作成してデプロイする", "category": "mobile", "body": "数あるサーバー・サイド JavaScript フレームワークと同じく、Sails.js を使用すれば、従来型の Web アプリケーションを容易に開発できるようになります。Sails は、Rails を画期的なフレームワークにした考え方を一部採用しており、Node.js を利用した Web 開発とモバイル開発に新たなレベルの生産性をもたらします。このシリーズの第 1 回では、Sails を他のフレームワークとは差別化しているものは何であるか、その概要を、Salis の MVC アーキテクチャーに対する革新的アプローチも含めて説明します。また、Salis を使用した開発環境を構築し、基本的な Sails アプリケーションを作成して、そのアプリケーションを IBM Bluemix にデプロイします。" }
,{ "title": "モバイル開発プロジェクトを成功させるための秘訣、トップ 4", "category": "mobile", "body": "モバイル開発チームは、プロジェクトを成功させるという難題を前にとてつもなく大きなプレッシャーにさらされていますが、この難題は増え始めています。IBM Center for Applied Insights による新たな調査では、モバイル・アプリ開発プロジェクトに関して、予算とスケジュールを守り、プロジェクトの目標を達成できるようにする、4 つの主要な差別化要因 (成功したプロジェクトと、それほど成功しなかったプロジェクトを比較した場合の差別化要因) を明らかにしています。これら 4 つの秘訣を学んで、次のモバイル・プロジェクトに適用してください。" }
,{ "title": "1 週間足らずで Bluemix アプリを作成する", "category": "mobile", "body": "ロンドンに住む上で理想的な地区を見つけられるようにするアプリを、IBM Bluemix で作成したときの体験談を IBM エマージング・テクノロジー・スペシャリストの Ben Miller 氏が紹介します ― なんと彼はこのアプリを 4 日間で完成させました！彼は、このアプリを例に、Bluemix を利用するメリットを解説し、Bluemix ではアプリケーション開発者の日々の課題にどのように対応しているかを説明します。" }
,{ "title": "IoT 開発のベスト・プラクティス", "category": "mobile", "body": "IoT (モノのインターネット) の分野で開発する際には、接続、セキュリティー、プライバシーを考慮しなければなりません。さらに、デバイスが常時接続された状態にあるという性質上、消費電力、チップの処理速度、メモリー、そしてファームウェアの更新についても考慮しなければなりません。これらの重要な要素のすべてが、IoT 製品の成否を左右します。この記事では、皆さんが IoT の「モノ」を成功させる可能性をより高められるよう支援するために、優れたモバイル開発パターンについて詳しく調べるとともに、これらのパターンを IoT 開発にどのように適用できるかについても詳しく取り上げます。" }
,{ "title": "モバイル DevOps: 第 2 回 UrbanCode Deploy を使用してエンタープライズ規模の iOS 継続的デプロイメントを実装する", "category": "mobile", "body": "iOS を対象にエンタープライズ規模の継続的デプロイメントを実装してください。IBM Apple Solutions Team が IBM UrbanCode Deploy を使用して、その継続的デプロイメント機能をどのようにカスタマイズしているかを調べてください。" }
,{ "title": "React Native: 迅速な iOS 開発の新しい世界へ", "category": "mobile", "body": "iOS 開発用プラットフォームとツール・セットとして最も急成長している React Native を使用して、モバイル開発を迅速に行ってください。React Native を使用すれば、Objective-C や Swift のチュートリアルは脇に置いて、JavaScript で iOS アプリのコーディングを始めることができます。この記事では React Native の概要を紹介し、そのアーキテクチャーと内部動作を説明した後、React Native のプログラミング手法に焦点を当てたサンプル・アプリに取り組みます。" }
,{ "title": "IBM MobileFirst Object Store Adapter とバックエンドの IBM Spectrum Scale Object を使用したモバイル・アプリを開発する", "category": "mobile", "body": "オブジェクト・ストアに保管されたデータをモバイル・アプリに簡単に統合できるようにするニーズを探ってください。クラウド・ストレージを使用すると、ユーザーやアプリケーションがリモートからデータを保管して、そのデータにいつでも、どこからでも、どの端末からでもアクセスすることができます。この記事では、最先端のオブジェクト・ストア・オファリングである IBM Spectrum Scale Object、そしてマルチプラットフォーム対応のモバイル・アプリ開発用プラットフォームとして人気の高い IBM MobileFirst についての概要を説明します。その後、カスタムで作成した MobileFirst 用アダプターを紹介します。このアダプターを使用すれば、IBM Spectrum Scale Object Store に保管されたデータにアクセスし、そのデータを統合するという処理を簡単に行えるモバイル・アプリを開発することができます。" }
,{ "title": "サッカーのスコアを通知するモバイル・アプリを IBM Bluemix 上で作成する", "category": "mobile", "body": "Joe Lennon が、Occer アプリをどのように作成して IBM の Bluemix プラットフォームにデプロイしたかを説明しているので、それを理解してください。バックエンドの API 層は、Ruby、Sinatra、MongoDB を使って作成されています。サッカーの試合の最新のスコアは、無料で入手できる football-data.co.uk のデータ・フィードから取得します。アプリそのものは Swift で作成した iOS アプリですが、IBM Bluemix のMobile SDK を利用してプッシュ通知に対処します。" }
,{ "title": "優れた Apple Watch アプリを作成するための 6 つの設計原則", "category": "mobile", "body": "Apple Watch アプリを設計して素晴らしい結果を得る上では、いくつかの設計原則に従うのが効果的です。この記事では、「Apple Watch Human Interface Guidelines」の概要を紹介します。このガイドラインでは、一目で情報を把握できるアプリと、ユーザー・セントリックな素早い操作に重点を置いています。小さな画面用に設計すること、最小限の消費電力となるように最適化すること、そしてアプリのアクセシビリティーを保証することには、独特の課題を伴います。" }
,{ "title": "IBM MobileFirst Platform を使用して Apple Watch アプリを作成する: パート 1", "category": "mobile", "body": "IBM MobileFirst ネイティブ iOS SDK を使用して Apple Watch アプリを開発する方法を説明したこの動画を視聴することで、その方法を理解してください。" }
,{ "title": "IBM Bluemix アプリを対象とした、リモート制御の Raspberry Pi 2 モニターを作成する", "category": "mobile", "body": "IBM Internet of Things Foundation を利用してデバイスとアプリケーションを相互接続する実践プロジェクトを通して、モノのインターネットについて理解してください。このチュートリアルでは、実行中の IBM Bluemix アプリケーションのアップタイムと、このアプリケーションへのアクセス時間をモニタリングするように Raspberry Pi 2 をセットアップして、Bluemix にデプロイできるグラフ作成アプリケーションにそのモニタリング結果を取り込みます。さらに、この Raspberry Pi 2 モニターをリモートで制御するデスクトップ・アプリケーションのコーディングを行います。" }
,{ "title": "IBM MobileFirst Platform を使用して Apple Watch アプリを作成する: パート 2", "category": "mobile", "body": "IBM MobileFirst ネイティブ iOS SDK を使用して Apple Watch アプリを開発する方法を説明したこの動画を視聴することで、その方法を理解してください。" }
,{ "title": "Dojo Mobile でグラフィカル KPI ダッシュボード・アプリを作成する", "category": "mobile", "body": "Dojo Mobile を使用すると、モバイル開発に要する時間が大幅に削減されると同時に、よく利用されているモバイル端末で適切に拡大縮小される、直感的かつリッチな画面を作り出すことができます。このチュートリアルでは、Dojo Mobile のチャート作成ライブラリーとゲージ・ライブラリーを使用することで、モバイル KPI アプリを介してビジネス・ユーザーや経営者に組織の主要業績指標を提供する方法を説明します。" }
,{ "title": "モバイル DevOps: 第 1 回 UrbanCode Deploy を使用してエンタープライズ規模の iOS 継続的ビルドを実装する", "category": "mobile", "body": "iOS アプリ用にエンタープライズ規模の継続的ビルド・システムを実装してください。IBM Apple Solutions Team が、このシステムの継続的ビルド機能をカスタマイズするために IBM UrbanCode Deploy をどのように使用したかを理解してください。" }
,{ "title": "IBM IoT Foundation と IBM Bluemix を使用して独自のウェアラブル端末を作成する", "category": "mobile", "body": "ウェアラブル端末に接続し、その端末からクラウドに対してセンサー・データの送信を行う、ハイブリッド・モバイル・アプリを作成してください。このチュートリアルの自分で作成する粋なプロジェクトでは、IBM Bluemix、IBM Internet of Things (IoT) Foundation、Apache Cordova、および WICED Sense Development Kit を使用します。" }
,{ "title": "Geospatial Analytics を利用して、ネットワーク接続された車両の IoT アプリを作成する", "category": "mobile", "body": "Bluemix 上にモノのインターネット (IoT) による Connected Vehicle スターター・キットをデプロイし、「モノのインターネット」サービスと Geospatial Analytics サービスを利用して拡張してください。このスターター・キットを使用すると、街中を走っている車両のシミュレーション、表示、管理が可能になり、通知用のジオフェンスを設定することも可能になります。" }
,{ "title": "IBM MobileFirst を Cast Iron と統合してモバイル・アプリをエンタープライズに接続する", "category": "mobile", "body": "IBM MobileFirst Platform Foundation モバイル・アプリケーション・フレームワークは、アダプター・メカニズムによる統合機能を提供します。MobileFirst のアダプターは、エンタープライズ・サービスにアクセスするために MobileFirst プラットフォーム上のサーバーにデプロイされるコンポーネントです。これらのアダプターは、モバイル・アプリケーションとエンタープライズ・システムとの間のメディエーターまたはゲートウェイとしての役割を果たし、モバイル・アプリケーションからのリクエストを受け取って、リクエストに応じてエンタープライズから取得したデータをモバイル・アプリケーションに返します。IBM WebSphere Cast Iron Cloud インテグレーション製品は、クラウドとオンプレミス・アプリケーションとの迅速な統合や、統合コストの削減、SaaS (Software as a Service) およびクラウド・モデルにおけるリソースと生産性の最適化を可能にする製品です。この記事では、IBM MobileFirst と Cast Iron の統合について説明します。" }
,{ "title": "IBM MobileFirst Platform Foundation Developer Edition のインストールに関する FAQ", "category": "mobile", "body": "ここで取り上げる 6 つの質問は、サポート・スタッフがよく尋ねられる質問です。これらに対する回答が、IBM MobileFirst Platform Foundation Developer Edition をインストールして使い始める皆さんの質問に対する答えとなることを願っています。" }
,{ "title": "Worklight による本番アプリの開発に Mobile Quality Assurance を使用する", "category": "mobile", "body": "この記事では、Ei! Treinador (「こんにちは、コーチ！」という意味のポルトガル語) モバイル・アプリの開発に IBM Mobile Quality Assurance をどのように使用したのかを説明します。2014年ワールドカップ・ブラジル大会で VIP ファンのために作成されたこのアプリにより、ファンはソーシャル・メディアから集約されたセンチメント分析を見ることができました。このアプリに IBM Mobile Quality Assurance をどのようにインストールして構成したのか、そしてアプリをテスターや利害関係者に配布するためにどのように Mobile Quality Assurance を使用したのかを学んでください。Mobile Quality Assurance は内部テストから本番での使用に至るまで、開発サイクルの全フェーズで使用しました。この記事では IBM Mobile Quality Assuranceの本番前のステップと本番でのステップの両方を取り上げます。" }
,{ "title": "Web ユーザーと Pebble ユーザーのための Where? アプリを作成する", "category": "mobile", "body": "「どこ?」の質問に答えるアプリケーションを作成します。クライアント・アプリケーションをサポートするための REST API を提供するバックエンド Node.js   アプリケーションを、Bluemix 上でビルドしてデプロイします。 次に 2 つのクライアント・アプリケーション (1 つは Web 用、1 つは Pebble スマートウォッチ用)   をビルドします。" }
,{ "title": "オンプレミス・データベースのテーブル値をモニターする Android アプリと Web アプリケーションを作成する", "category": "mobile", "body": "プログラムの状況を手動でモニターしているとしたら、オンプレミス・データベースのテーブル列値 (例えば、コンポーネントが稼働中であるかどうかを示す値など) が変更されているかどうかをチェックし、変更されている場合にはプッシュ通知を受け取るアプリを作成することで、手動でモニターする時間を削減してください。最新のテーブル値は、Android アプリや Web アプリケーションで表示することができます。このチュートリアルに従うことにより、Bluemix の Cloud Integration サービスでサポートしているオンプレミス・データベース内のテーブル列値をモニターしてください。" }
,{ "title": "会議施設を予約するための Android アプリを作成する", "category": "mobile", "body": "このチュートリアルでは、職場の会議施設を予約するための単純な承認アプリケーションを作成する方法を紹介します。このアプリケーションを作成するには、Bluemix 開発プラットフォーム内でクラウド・サービス (Cloudant DB、MQ Light、Twilio) を利用します。このアプリケーションを Bluemix にデプロイすると、ユーザーは自分の携帯端末で簡単にリクエストを送信してレスポンスを受け取ることができます。" }
,{ "title": "IBM Bluemix モバイル入門", "category": "mobile", "body": "この記事では、1 章でモバイル開発に利用できる Bluemix のサービスの概要について解説します。その後、IBM Bluemix の MBaaS の中核である、Mobile Cloud Platform に焦点をあて、2 章でその概要を、3 章で具体的な実装方法について説明します。" }
,{ "title": "Swift および Objective-C を使用した iOS メモリー管理で絶対に失敗しないための 7 つのヒント", "category": "mobile", "body": "私はネイティブ iOS アプリで発生したメモリーの問題を皆さんと共有して解決しました。このチュートリアルでは、私が直面したメモリーの問題のほかに、誰もが犯しがちなよくある間違い、そして何よりも Swift アプリと Objective-C アプリの両方でメモリー・リークを回避およびデバッグするためのベスト・プラクティスおよびテクニックを紹介します。" }
,{ "title": "Linux および Windows のシステム管理に最適な 3 つの Android ツール", "category": "mobile", "body": "スマートフォンやタブレットから Android アプリを使用して、自分が使用しているマシンの Windows システムや Linux システム、UNIX システムにリモート接続することにより、システム管理を短い応答時間で行うことができ、どこにいても問題を解決することができます。" }
,{ "title": "クラウドをポケットに入れて持ち歩く: 第 1 回 サーバー・リストを管理する", "category": "mobile", "body": "SoftLayer の REST API を使用して SoftLayer インフラストラクチャー・サービスを作成、表示、管理するためのモバイル・アプリケーションを作成してください。この全 2 回からなる連載の第 1 回では、モバイル端末に SoftLayer クラウド・サーバーに関する情報を表示する上で必要となるデータを調整する方法を学びます。" }
,{ "title": "クラウドをポケットに入れて持ち歩く: 第 2 回 仮想マシンをオーダーして構成する", "category": "mobile", "body": "SoftLayer の REST API を使用して SoftLayer インフラストラクチャー・サービスを作成、表示、管理するためのモバイル・アプリケーションを作成してください。この全 2 回からなる連載の第 2 回では、モバイル端末でサーバーをオーダーして構成する方法を学びます。" }
,{ "title": "モバイル・アプリをテストするために OTA で配布する", "category": "mobile", "body": "IBM Bluemix から IBM Mobile Quality Assurance (MQA) を使用して、モバイル・アプリケーションの OTA 配布を実施する方法を学んでください。" }
,{ "title": "ビジュアル検索エンジンを使用するモバイル・アプリに対して、クラウド上に格納されたデータを提供する", "category": "mobile", "body": "ビジュアル検索エンジンは、モバイル・アプリケーションの新しいパラダイムを創出しましたが、この技術を効果的に利用するには、大規模な公開データ・セットを用意して維持管理する必要があります。クラウド・ベースのストレージは、ビジュアル検索エンジンを使用するアプリケーションを導入する場合に、そのアプリケーションで利用できる優れたソリューションです。この記事では、組織がビジュアル検索エンジンとクラウド・ベースのストレージを使用してビジネス・プロセスを自動化する方法について説明します。" }
,{ "title": "Polymer を導入して Web Components による革命に参加する", "category": "mobile", "body": "Polymer ライブラリーでは、iOS や Android 上のモバイル・ブラウザーをはじめとする最近のあらゆるブラウザーでサポートしている Web Components テクノロジーを使用しています。皆さんが作成する Web アプリケーションやハイブリッド・モバイル・アプリケーションに、(UI インタラクションの処理、トランジション・アニメーション、柔軟な CSS スタイル設定を含む) 完全なユーザー・インターフェースをカプセル化するカスタム Web 要素を追加してください。" }
,{ "title": "SoftLayer クラウドでマッピング機能と地理空間解析機能を使えるようにする", "category": "mobile", "body": "GIS と地理空間解析についての概要、Esri の製品である ArcGIS と Esri のマップ・アプリケーション、そしてこのアプリケーションを SoftLayer クラウド上にデプロイする方法を理解してください。" }
,{ "title": "Famo.us を使用してハイパフォーマンスのモバイル UI を作成する", "category": "mobile", "body": "Famo.us プラットフォームを使用すると、JavaScript で作成したモバイル Web UI をネイティブ・コードで作成した実装に匹敵させることができます。この記事で紹介するいくつかのサンプル・アプリケーションを通して、モバイル・アプリでハイパフォーマンスのユーザー・エクスペリエンスを容易に作成する上で、Famo.us がどのように役立つかを理解してください。" }
,{ "title": "モバイル・アプリケーションでの DevOps の課題とベスト・プラクティス", "category": "mobile", "body": "モバイル・アプリケーションに DevOps を適用すると、これまでの DevOps にはない複雑さが新たに生じますが、それに対する見返りは無視できないほど大きなものです。モバイル・エンタープライズによる継続的ソフトウェア・デリバリーの能力を高めるための 10 のベスト・プラクティスを理解してください。" }
,{ "title": "正常に動作するモバイル・アプリケーションを構築する", "category": "mobile", "body": "IBM MobileFirst のスペシャリストで構成される専門家パネリストが、高品質のモバイル・アプリケーションの構築とテストを行うための助言を要約します。" }
,{ "title": "Node.js、Express、sentiment、ntwitter を使用して感情分析アプリケーションを作成する", "category": "mobile", "body": "Twitter 上の任意のトピックに対する人々の反応を分析するために Node.js アプリケーションを作成してください。デモ、サンプル・コード、そして基本的な PaaS アプリを作成するための完全なインストラクションが含まれたこの記事では、この PaaS アプリに感情分析機能を追加して Twitter に接続します。皆さんが作成するアプリでは、よく使われている Node.js のモジュールを使用します。このアプリは、時間の経過に伴う大量のデータの変化を分析およびモニターするためにすぐに使えるモバイル・アプリが必要なときには、いつでも再利用することができます。" }
,{ "title": "IBM Worklight を使用してネイティブ・モバイル・アプリを開発する", "category": "mobile", "body": "企業が顧客やパートナー、従業員とやりとりする上で、モバイル・アプリケーションが急速に主要な手段となりつつあります。モバイル・アプリケーションに対するニーズが高まると共に、企業はこの比較的新しい要求に対処するための、より適切かつ効率的な方法を求めています。IBM Worklight は、こうした点で独特な位置を占める有用なモバイル・アプリケーション・プラットフォームです。Worklight の柔軟性を示す 1 つの例は、このプラットフォーム上でユーザーは、モバイル Web アプリ、ハイブリッド・アプリ、ネイティブ・アプリを作成することができます。この記事では、IBM Worklight を使用してネイティブ・モバイル・アプリケーションを作成する方法について説明します。" }
,{ "title": "Linux システムの起動プロセスをカスタマイズしてモニターする", "category": "mobile", "body": "コンピューター・システムのブートにかかる時間を最小限に短縮することは重要です。それは、自宅のコンピューターを立ち上げる場合でも、数千人のユーザーに対してサービスを提供しているサーバーを再起動する場合でも変わりはありません。この記事では、さまざまな Linux ディストリビューションで使用されている、システムの起動およびシャットダウンの各種メカニズムを話題に取り上げ、新しいサービスを統合する方法、既存の起動構成をカスタマイズする方法を説明するとともに、システム起動構成の動作とパフォーマンスを詳しく調べていきます。" }
,{ "title": "WebGL による 3D 開発: 第 1 回 WebGL の紹介", "category": "mobile", "body": "JavaScript 開発者は WebGL API を使用することで、最近の PC やモバイル端末のハードウェアに組み込まれている強力な 3D グラフィックス・アクセラレーション機能を直接利用することができます。WebGL は最近のブラウザーではほとんどサポートされており、これを使用することで、一般 Web ユーザー向けにハイパフォーマンスの 3D ゲーム、アプリケーション、そして 3D で拡張した UI を作成することができます。この記事は、WebGL に初めて取り組む JavaScript 開発者を対象とした全 3 回からなる連載の第 1 回です。今回は、WebGL の基礎および関連する 3D グラフィックスの概念を具体的に示す、基本的なサンプル・アプリケーションに取り組みます。" }
,{ "title": "モバイル開発のための DevOps", "category": "mobile", "body": "開発チームや運用チームにとって、モバイル・コンピューティングは現在おそらく最もホットなトピックです。大企業の従業員も中小企業の従業員も、さまざまなモバイル機器を持ち、それらの多くは個人の所有物ですが、彼らはそれらの機器を業務に使用しています。モバイル・コンピューティングを容易にするアプリケーションを顧客やユーザーに提供することにより、モバイル市場でのシェアを高めたいと考えている企業は世界中に存在します。そのため企業にとって重要なのは、モバイル機能の開発について十分に検討する一方で、それらの機能のデプロイ方法、そして (それらの機能が時間の経過と共に変わることを考慮し) それらの機能の継続性を保証する方法についても十分に検討することです。この記事では、アプリケーションのさまざまなバージョンを多様な機器にデプロイするという問題に取り組む上で、DevOps (Development &amp; Operations) がどのように役立つかを説明します。" }
,{ "title": "Node.js と MongoDB を使用してモバイル・アプリを開発する: 第 1 回 チームが採用した手法とその結果", "category": "mobile", "body": "Node.js (サーバー・サイドの JavaScript) を使用して Systems of Engagement (人と関わりあうシステム) を開発する利点を探ってください。この記事では、IBM Extreme Blue チームが Node.js と MongoDB を使用して、Systems of Engagement (人と関わりあうシステム) の概念を実証するアプリケーションである IBM Passes で挙げた成果を紹介します。このチームが Node.js と MongoDB を使用した経験は、企業でも使われ始めているこれらのソリューションを使用することで、いかに迅速なアプリケーション開発が実現できるかについて、興味深い洞察をもたらしてくれます。" }
,{ "title": "IBM Worklight で開発するモバイル・アプリで FIPS 140-2 準拠の HTTPS 暗号化を使用可能にする", "category": "mobile", "body": "IBM の研究所では、アプリケーション・レベルの HTTP/HTTPS クライアント・ライブラリーを作成しました。このライブラリーを使用すれば、モバイル・アプリケーション内で直接、FIPS 140-2 に従って暗号化した HTTP/HTTPS リクエストを実行できるようになります。この記事では、ステップバイステップの手順に従って、IBM Worklight Studio で開発するハイブリッドおよびネイティブ iOS/Android アプリに HTTP/HTTPS クライアント・ライブラリーを統合します。統合した後は、ライブラリーの API を呼び出して FIPS 140-2 に従って暗号化したネットワーク・リクエストを作成し、そのリクエストをプライベート・エンタープライズ・ネットワークのファイアウォールの内側にある FIPS 140-2 認定 SSL 終端点に (リバース・プロキシー・アーキテクチャーを介して) 送信することも、ファイアウォールの外側にある終端点に送信することもできます。" }
,{ "title": "Salesforce.com オブジェクトを公開するための Web API を作成する", "category": "mobile", "body": "この記事では API 開発者を対象に、IBM WebSphere Cast Iron の Web API サービスを使用して、Salesforce.com の CRM (顧客関係管理) システム内に連絡先を作成するために呼び出すことができる Web API を作成する方法を説明します。IBM WebSphere Cast Iron の Web API サービスを使用すれば、わずか数回のクリックで API をアセンブルして公開することができます。さらに、提供されている分析機能を使用して Web API の使用状況を分析することも、ブランドの開発者ポータルでコミュニティー・フックを使用して Web API コミュニティーをソーシャル化することもできます。" }
,{ "title": "万人のためのモバイル: 自作の Android アプリに署名を付け、封印し、配布する", "category": "mobile", "body": "Web ロジックではコンテンツが何よりも重要ですが、モバイル・ユーザーにとってはアプリとの対話がすべてを支配します。モバイル・アプリでは、静的な情報によるデザインが行われなくなり、代わりにゲーミフィケーションが採用されるようになっています。今回の記事では、Andrew Glover が Android モバイル開発の紹介を完結するために、前回の記事で紹介したサンプル・アプリケーションの Overheard Word に多岐選択式クイズの機能を追加します。その後、デジタル署名を生成する方法、そして署名付きのアプリを Android 向けの Google Play または Amazon Appstore で公開して宣伝する方法を説明します。" }
,{ "title": "Node.js と MongoDB を使用してモバイル・アプリを開発する: 第 2 回 ヒントと秘訣", "category": "mobile", "body": "Systems of Engagement (人と関わりあうシステム) を開発するために、Java テクノロジーではなく Node.js (サーバー・サイドの JavaScript) を使用した場合の実装に関する詳細を学んでください。この記事では、Node.js と MongoDB を使用して RESTful なバックエンド・アプリケーションを開発した IBM Extreme Blue チームが、チームの思考プロセスと推奨事項を紹介します。" }
,{ "title": "法令遵守を意識したアジャイル", "category": "mobile", "body": "IBMとDiagnostic Grifols社の専門家が、厳格に規制を受ける医療機器の領域においてDiagnostic Grifols社がいかにアジャイル・ソフトウェア開発アプローチを活用しているかを説明します。彼らは、「多くの開発組織は、規制を受ける環境においてはウォーターフォール型アプローチを取る必要があると信じているが、なぜそうではないかを示したい」と語っています。" }
,{ "title": "IBM Worklight を使用して構築する IBM Watson 用モバイル・アプリケーションのプロトタイプの作成", "category": "mobile", "body": "この記事では、一般的なコンテキストであるか IBM Watson でのコンテキストであるかに関わらず、先進的なモバイル・アプリケーションの構築に関心があるアーキテクトと開発者を対象に、IBM Watson および病院のバックエンド・システムとのインターフェースを取る、癌専門医用の高度なモバイル・アプリケーションのプロトタイプの設計と実装について説明します。このプロトタイプを構築した IBM チームのメンバーが、チームが IBM Worklight を Dojo Mobile および Apache Cordova とともに使用して、プロジェクトの技術的課題にどのように対処したかを説明します。" }
,{ "title": "DB2のNoSQLによるJSONサポート機能（第1部）: DB2のNoSQLによるJSONサポート機能の概要", "category": "mobile", "body": "DB2のNoSQLによるJSONサポート機能を活用すると、開発者はMongoDBに基づいて作成したポピュラーなJSONベースのクエリー言語を使用することによって、IBM DB2 for Linux, UNIX, and Windowsに保存されたデータを処理するアプリケーションを作成することができます。ドライバー・ベースの本ソリューションは実績のあるエンタープライズ機能と高い質のサービスを提供するRDBMSと連携し、JSONによるデータの柔軟な表示を実現します。DB2のNoSQLによるJSONサポート機能は、JSON文書を処理するにあたってコマンドライン・プロセッサー、Java API、および通信リスナーをサポートします。本記事ではDB2のNoSQLによるJSONサポート機能を提供するテクノロジー・レビューの概要について説明します。" }
,{ "title": "IBM WebSphere Cast Iron の Web API サービスへの Facebook の統合", "category": "mobile", "body": "この記事では、API 開発者を対象に、IBM WebSphere Cast Iron Live の Web API サービスに Facebook を統合する方法を説明します。これにより、Facebook 用の魅力的な Web API を迅速かつ容易に作成、ソーシャル化、管理できるようにします。この記事を読んで、API の定義方法、定義した API に合わせて開発者ページをカスタマイズする方法、アプリケーションを登録する方法、そして API をテストする方法を学んでください。" }
,{ "title": "万人のためのモバイル: Overheard Word アプリでの単語とジェスチャー", "category": "mobile", "body": "大喜びで、GitHub や他のリポジトリーからサード・パーティーのコードを手に入れたとしても、そのコードを Android UI に統合するには、いくつかのコツがあります。今回の記事では、Andrew Glover が JSON ベースの単語エンジンと既製のスワイプ・ジェスチャー機能を使用して、Overheard Word デモ・アプリを機能強化する方法を説明します。この記事を読むとわかるように、Android にサード・パーティーのコードを取り込むのは簡単ですが、アプリの UI にサード・パーティーのコードをスムーズに実行させようと思ったら、ロジックを慎重に作成する必要があります。" }
,{ "title": "モックアップという意味を持つ Maqetta: 第 3 回 Maqetta でデザインした UI プロトタイプを PhoneGap でデプロイする", "category": "mobile", "body": "Maqetta について紹介するこの連載では、これまで、Dojo と Dojo Mobile ツールキットの機能を使用してインタラクティブなモバイル UI プロトタイプを作成し、その機能を強化する方法を説明してきました。ブラウザー内で Maqetta を使用して作業をすることで、一切コーディングせずにリアルなプロトタイプを作成した後、そのプロトタイプの機能とフローをカスタム JavaScript コードで拡張しました。今回は Maqetta に PhoneGap を組み合わせて、新しいモバイル UI プロトタイプを作成し、実際の端末にデプロイします。" }
,{ "title": "万人のためのモバイル: Android アプリのライフサイクルにおけるアクティビティーとアイコン", "category": "mobile", "body": "Activity クラスは、Android モバイル・アプリの中心的なクラスであるとともに、アプリとユーザーとの対話部分や、アプリとモバイル端末とのインターフェースを微調整できる場所でもあります。作成したアプリがそのライフサイクルにおいて望み通りの動作をするように微調整してから、アイコンとアクション・バーを使用して、ユーザーを UI ナビゲーションやアプリのさまざまな機能に誘導してください。" }
,{ "title": "万人のためのモバイル: スワイプしてみよう！Android でのジェスチャーのプログラミング", "category": "mobile", "body": "たいていのモバイル・ユーザーは、他のことに気を取られていて、いろいろと忙しい上に、人間工学的に制約されています。そんなモバイル・ユーザーに合わせてモバイル・アプリの UI を作成してください。著者の Andrew Glover はこの記事で、モバイル・アプリが Web アプリケーションとは異なる主な点を取り上げた後、ボタンをクリックする代わりに、スワイプ・ジェスチャーでナビゲートするモバイル・アプリの UI を作成する方法を説明します。" }
,{ "title": "WebSphere Portal を使用してレスポンシブ Web デザインを実装する: 第 2 回 デバイス・クラスを使用して特定の機器をターゲットに開発する", "category": "mobile", "body": "単一の Web サイトでコンテンツとレイアウトを機器に合わせて自動的に最適化する手法として、CSS メディア・クエリーを使用するレスポンシブ Web デザインが広く使われるようになっています。この記事では、WebSphere Portal のデバイス・クラス・メカニズムを利用して、特定の機器に合わせてリソースをフィルタリングし、テーマ内でのリソースの集約を最適化する方法を説明します。これらの手法によって、レスポンシブなテーマのパフォーマンスが向上するともに、より一貫したユーザー・エクスペリエンスがもたらされます。" }
,{ "title": "モックアップという意味を持つ Maqetta: 第 2 回 Maqetta でデザインしたモバイル UI 用に JavaScript でカスタム・コードを作成する", "category": "mobile", "body": "Maqetta でデザインしたモバイル・アプリのプロトタイプを、Dojo と Dojo Mobile ライブラリーを使用して JavaScript でカスタム・コードを作成することによって強化してください。" }
,{ "title": "万人のためのモバイル: Android の手ほどき", "category": "mobile", "body": "モバイルの世界は明るい見通しに溢れているなか、この世界への道を模索している開発者にとって、Android は有望でエキサイティングなプラットフォームとなります。今回から始まるこの新しい連載では、まず、モバイルに手をつけ始めたばかりの Java 開発者を対象にわかりやすく Android を紹介します。Android の 3 種類のバージョニング・システムについて学び (それが重要なことを理解した上で)、独自の開発環境を構築して初めての Android アプリを構築してください。" }
,{ "title": "モックアップという意味を持つ Maqetta: 第 1 回 HTML5 を使用したモバイル UI をデザインする", "category": "mobile", "body": "HTML5 対応アプリのプロトタイプを作成するのに、コーディングはもう必要ありません。Maqetta を使えば、手と目の動きを合わせた操作だけでプロトタイプを作成することができます。Maqetta は、デスクトップ・アプリケーションとモバイル・アプリ向けのブラウザー・ベースの WYSIWYG ツールです。全 3 回からなる連載の第 1 回目となるこの記事では、無料のオープンソース・プロジェクト Maqetta を紹介します。Maqetta はブラウザー内で動作し、デザイナーがさまざまなウィジェットをドラッグ・アンド・ドロップすることで、ライブ UI モックアップを組み立てられるようになっています。この第 1 回の記事で、実際のモバイル・アプリのプロトタイプを作成しながら、Maqetta の主な機能について学んでください。" }
,{ "title": "モックアップという意味を持つ Maqetta: 第 1 回 HTML5 を使用したモバイル UI をデザインする", "category": "mobile", "body": "" }
,{ "title": "モックアップという意味を持つ Maqetta: 第 1 回 HTML5 を使用したモバイル UI をデザインする", "category": "mobile", "body": "" }
,{ "title": "モックアップという意味を持つ Maqetta: 第 1 回 HTML5 を使用したモバイル UI をデザインする", "category": "mobile", "body": "" }
,{ "title": "モックアップという意味を持つ Maqetta: 第 1 回 HTML5 を使用したモバイル UI をデザインする", "category": "mobile", "body": "" }
,{ "title": "モックアップという意味を持つ Maqetta: 第 1 回 HTML5 を使用したモバイル UI をデザインする", "category": "mobile", "body": "" }
,{ "title": "モックアップという意味を持つ Maqetta: 第 1 回 HTML5 を使用したモバイル UI をデザインする", "category": "mobile", "body": "" }
,{ "title": "IBM PureApplication System のセキュリティーと信頼", "category": "mobile", "body": "IBM PureApplication System は、クラウド・コンピューティング・ソフトウェア、コンピューター・サーバー、ネットワーク機器、ディスク・ストレージ・コントローラー、そしてハード・ディスクおよびソリッド・ステート・ディスクによるストレージが 1 つに統合された、エキスパート・インテグレーテッド・システムです。この記事では PureApplication System のセキュリティーおよびトラスト・インフラストラクチャーの設計原則を概説します。その設計原則とは、デフォルト・セキュア、セキュリティー制御の層を重ねた多層防御、職務の分離によるアクセス制御、そしてユーザーの説明責任です。この記事の目標は、既存の IT インフラストラクチャーに PureApplication System のセキュリティーおよびトラスト・インフラストラクチャーを統合する企業を支援し、企業がセキュリティー・コンプライアンスの要件とリスク・マネジメントに対処できるようお手伝いすることです。" }
,{ "title": "Android アプリケーション向けのクラウド・ベースのサービス Parse", "category": "mobile", "body": "モバイル開発者である C. Enrique Ortiz が Parse API について紹介し、Parse クラウドに Android アプリケーションのデータおよびファイルを保存する方法を説明します。" }
,{ "title": "「引き下げて更新」する機能を Dojo Mobile を使用して実装する", "category": "mobile", "body": "モバイル Web アプリケーションでよく使用される「引き下げて更新」する機能を、Dojo Mobile 1.8 を使用して実装する方法を学びましょう。この記事では、2 つのサンプル・アプリケーションを作成する方法について説明します。1 つは引き下げて更新するアプリケーション、もう 1 つはそれを変形した、引き下げて戻るアプリケーションです。記事で取り上げるすべてのソース・コードはダウンロード可能な形で提供してあります。これらのサンプル・アプリケーションの作成方法を学べば、この UI パターンのさまざまなバリエーションを実装できるようになります。" }
,{ "title": "WebSphere Portal を使用してレスポンシブ Web デザインを実装する: 第 1 回 デフォルトのテーマを出発点にする", "category": "mobile", "body": "複数の機器に対応したエクスペリエンスを作成することは不可欠ですが、ターゲットにする機器を適切な機器のセットにするのが難しい場合もあります。特定のユーザー機器に合わせて設計する必要性を取り除くために、1 つの Web サイトのコンテンツとレイアウトを画面サイズ、機器の種類、機器の向きなどに応じて自動的に最適化する手法として、レスポンシブ Web デザイン (Responsive Web Design: RWD) がよく使われるようになっています。この記事では、WebSphere Portal のテーマをその根本からレスポンシブ Web エクスペリエンスに変換する方法を説明します。高度な CSS 手法により、柔軟なレイアウトと伸縮性のある要素を使用して様々な画面解像度にリアルタイムで対応するテーマを実装することができます。" }
,{ "title": "Dojo Dijit を拡張してカスタム・ウィジェットを作成する", "category": "mobile", "body": "この記事では、Dojo Toolkit の特定の dijit では完全には要件に対応することができず、独自のカスタム・ウィジェットを作成しなければならない場合、どのようにすればよいかについて説明します。この記事を最後まで読むと、一連の要件とそれらを満たす方法についての取り組みの例を通じて、dijit や Dojo のその他のコア機能の使い方、そして独自のウィジェットを宣言する方法を理解できるようになります。" }
,{ "title": "さまざまな機器とプラットフォームの組み合わせに対応したモバイル・アプリケーションをクラウドに統合する際の難題を解決する", "category": "mobile", "body": "最近、もはや切っても切れない関係になっているものとして、互いに密接に関係し合うクラウド･コンピューティングとモバイル・アプリケーションがあります。しかし、モバイル・アプリケーションをクラウドに統合しようとすると、その最初のステップに難題が待ち受けている場合があります。この記事では、MEAP (Mobile Enterprise Application Platform: モバイル・エンタープライズ・アプリケーション・プラットフォーム) の概要と、MEAP を選択することが皆さんの環境にとって最善のモバイル開発モデルとなる理由を説明します。また、クラウド指向の MEAP の実例として、著者が作成に関与した Convertigo Mobilizer を紹介します。" }
,{ "title": "HTML5 の動画をクロスプラットフォームで再生するハイブリッド・アプリケーションを IBM Worklight を使用して開発する", "category": "mobile", "body": "PC のみならずモバイル・デバイスからもアプリケーションにアクセスできるようにしようと企業が急ぐ中で、HTML5 のクロスプラットフォーム機能を活用したモバイル・ハイブリッド・アプリケーションが使用されています。残念なことに、クロスプラットフォームで動画を再生しようとする場合、特に Android オペレーティング・システム上で実行されるハイブリッド・アプリケーションの場合には、HTML5 をサポートするだけでは十分ではありません。この記事では、この問題に対して IBM Worklight のモバイル・ハイブリッド機能を利用して対処し、動画を再生できるようにする方法について説明します。この記事の内容は IBM WebSphere 開発者向け技術ジャーナルから引用したものです。" }
,{ "title": "モバイル･アプリケーションの開発を迅速化する IBM Worklight の主要な機能と能力", "category": "mobile", "body": "IBM Worklight はモバイル・エンタープライズ・アプリケーションの開発、デプロイメント、ホスティング、管理のための完全なプラットフォームです。Worklight はモバイル･アプリケーションを開発する上でのあらゆる要件に対応し、開発プロセスやデプロイメント・プロセスのすべてのフェーズで、そのプロセスを支援するためのツールを提供し、効率性をもたらします。この記事では IBM Worklight V5 の概要について説明するとともに、その新しい機能や主要な機能を紹介します。これらの機能は、皆さんがモバイル･アプリケーションの開発に着手して、その開発の目的を実現する上で役に立ちます。この記事の内容は IBM WebSphere 開発者向け技術ジャーナルから引用したものです。" }
,{ "title": "モバイル・ソリューションを迅速に開発するための手法", "category": "mobile", "body": "企業のモバイル・ユーザーたちのデータ・アクセスおよびデータ共有に対するニーズは、従来のコンテンツ管理システムとファイルシステムでは満たされていません。幸いなことに、社内の小規模な設計・開発チームでも、再利用可能な技術を活用した効率的な開発プロセスによって、マルチデバイス対応のコンテンツ・アクセス・ソリューションを迅速に実装することは十分可能です。この記事では、IBM CIO Lab Mobile Innovation チームが社内ソリューションのパイロットを迅速に導入した例を紹介します。このソリューションは、社内で認可されたすべてのプラットフォーム間で簡単かつ柔軟にファイルを共有できるようにして、ユーザーの生産性を向上させます。" }
,{ "title": "Worklight を使用する: 第 2 回 構造化モジュールを開発して IBM Worklight の暗号化オフライン・キャッシュ機能を使用する", "category": "mobile", "body": "IBM Worklight プラットフォームを紹介するこの連載では、多種多様な IBM ソフトウェア製品を利用してモバイル・アプリケーションを作成する方法を説明します。第 2 回では、引き続き Worklight アプリケーションの開発プロセスを説明します。そのなかで、ハイブリッド・アプリケーションを作成する際のベスト・プラクティスを明らかにするとともに、Worklight の暗号化オフライン・キャッシュ機能について説明します。" }
,{ "title": "Worklight を使用する: 第 1 回 初めての Worklight アプリケーションに着手する", "category": "mobile", "body": "IBM では優れたモバイル・エンタープライズ・アプリケーション・プラットフォーム (MEAP) である IBM Worklight V5 によって、製品ポートフォリオ全体にわたってモバイル機能を拡充しています。Worklight プラットフォームを紹介するこの連載では、多種多様な IBM 製品を利用してモバイル・アプリケーションを作成する方法を説明します。第 1 回で説明するのは、Worklight 開発環境をセットアップして、単純なアプリケーションを作成するプロセスです。このサンプル・アプリケーションは、今後の記事で反復型開発の基礎として使用します。" }
,{ "title": "jQuery Mobile 入門", "category": "mobile", "body": "jQuery Mobile フレームワークを紹介するこの記事を読んで、このフレームワークの基礎と、機能的なモバイル Web アプリケーション・ユーザー・インターフェースを作成する方法を学んでください。この記事ではサンプルを用いて、基本的なページ、ナビゲーション、ツールバー、リスト・ビュー、フォームのコントロール、そして切替効果について説明します。" }
,{ "title": "jQuery Mobile と CSS3 を使用して、ユーザー機器に応じて調整されるデザインを実装する", "category": "mobile", "body": "jQuery Mobile フレームワークは、それ単独でも HTML5 マークアップ対応の利用しやすいモバイル Web サイトを素早く作成するための優れたソリューションですが、CSS3 と組み合わせると、非常に興味深いことになります。jQuery Mobile フレームワークと CSS3 とを組み合わせることで、ユーザー機器の画面解像度に応じて調整される Web ページ・レイアウトを作成できるようになるからです。この記事では jQuery Mobile フレームワークと CSS3 のメディア・クエリーを使用して、ユーザー機器に応じて調整されるデザインの Web ページを実装する方法について説明します。" }
,{ "title": "Java EE 8 の新機能", "category": "opensource", "body": "クラウドとリアクティブ・プログラミング向けに作成された次期 Java Platform Enterprise Edition は、今後数年のうちに、エンタープライズ・アプリケーション開発を方向付けることになるでしょう。この記事では、Java エンタープライズ・セキュリティー、JSON バインディング、HTTP/2 サーバー・プッシュなどに対応するための新しい API とアップグレードについて紹介します。" }
,{ "title": "Spring Framework 5 の新機能", "category": "opensource", "body": "Spring Framework 5.0 は今後数年のうちに、開発者が Spring ベースのアプリケーションを理解して作成する方法を変えていくでしょう。Spring 5 では、そのコア構造に関数型プログラミング・モデルとリアクティブ・プログラミング・モデルを統合しています。さらに、主要な依存関係を更新し、レガシーの重荷から解放されてパフォーマンス・ブーストを達成しながらも、お馴染みの Spring Framework のルック・アンド・フィールを維持している仕組みを学んでください。" }
,{ "title": "基本的な Apache Cassandra アーキテクチャーをセットアップする", "category": "opensource", "body": "分散型 Apache Cassandra データベースを構成してインストールする方法を学んでください。分散型 Apache Cassandra データベースは、高可用性を備え、ペタバイト規模のデータを処理することができます。また、単一障害点がなく、読み取り/書き込み処理のレイテンシーもわずかです。このような特徴を備えたデータベースは、優れたサービス・レベルのデータベース・ソリューションを目指す多くの大企業および機関で使用されています。" }
,{ "title": "今まで知らなかった 5 つの事項: Apache Maven のプラグイン", "category": "opensource", "body": "Maven を最大限に利用しきれていませんか？それは誰にとっても同じことです！プラグインのゴールが Maven のライフサイクルにどのように対応するのかを学んで、GitHub の Maven Site、Codehaus の Maven Cargo を含め、作成するプロジェクトを次のレベルに引き上げる 4 つのプラグインを導入してください。" }
,{ "title": "InformixのデータをSparkにオフロードする, 第 1 回: データの収集", "category": "opensource", "body": "Informix データベースからデータを取得して Spark にダンプする方法を学び、Informix のデータを他のデータ・ソースに対して利用して、高度なアナリティクスをコンパイルできるようになってください。このチュートリアルで説明する方法では一貫して Java を使用します。このチュートリアルの対象読者は、RDBMS データを Spark に取り込もうと目指している開発者です。Informix のユーザーであるかどうかは問いません。" }
,{ "title": "InformixのデータをSparkにオフロードする, 第 3 回: 複合分析", "category": "opensource", "body": "このチュートリアル・シリーズの第 3 回では、結合と、より複雑なクエリーについて詳しく探ります。Informix データベースからデータを取得して Spark にダンプする方法を学び、Informix のデータを他のデータ・ソースに対して利用して高度なアナリティクスをコンパイルできるようになってください。このチュートリアルで説明する方法では一貫して Java を使用します。このチュートリアルの対象読者は、Informix のユーザーであるかどうかを問わず、RDBMS データを Spark に取り込もうと目指している開発者です。" }
,{ "title": "InformixのデータをSparkにオフロードする, 第 2 回: 基本的なデータ分析", "category": "opensource", "body": "第 1 回で学んだ知識を基に、Spark dataframe API を使ってデータの調査を開始し、データフレームとは何かを理解してください。" }
,{ "title": "PowerVC の OpenStack REST API を探る", "category": "opensource", "body": "IBM PowerVC (Power Virtualization Center) は、Power Systems 環境における仮想リソースの管理を単純化することを目的として OpenStack をベースに設計された、IBM Power プラットフォーム用 IaaS クラウド・ソリューションです。PowerVC では、GUI でも RESTful API でも、Power System の仮想管理タスクを行えるようになっています。この記事では、PowerVC Standard Edition と Cloud PowerVC Manager の両方の REST API にハイライトを当てます。" }
,{ "title": "Eclipse Orion の紹介: クラウドの中でクラウドに対応", "category": "opensource", "body": "Eclipse Orion プロジェクトの目標は、Web の中で Web を対象に開発することのみに焦点を合わせた、ブラウザー・ベースでオープンソースのツール統合プラットフォームを作成することです。Orion のツールは JavaScript で作成されており、ブラウザー内で実行されます。また、Orion のコンポーネントは個別に利用することもできます。この記事では Orion の概要を紹介するとともに、Orion のツールを理解する上で役立つリソースと解説を提供します。" }
,{ "title": "NBAにおけるソーシャル・メディアの力、影響、実績, 第 2 回: 個々の NBA プレイヤーを調査する", "category": "opensource", "body": "このチュートリアル・シリーズで、Python、pandas、Jupyter Notebook と少々の R を使用して、ソーシャル・メディアが NBA に与える影響を分析する方法を学んでください。第 2 回では、個々の NBA プレイヤーのスポンサー収入データ、実際の試合出場中の成績、そして Twitter と Wikipedia によるソーシャル・メディアの力との間にある関係を詳しく探ります。" }
,{ "title": "ビヘイビア駆動開発者向け Infrastructure as Code 入門", "category": "opensource", "body": "この記事では、ビヘイビア駆動開発とは何か、そして Ansible による Infrastructure as Code プロジェクトに対してビヘイビア駆動開発をどのように適用できるかを説明します。常に最新の状態に維持された、実行可能なサーバー・ドキュメントを作成する方法を学んでください。" }
,{ "title": "位置認識機能を備えた IoT アプリを作成する、第 2 回: ジオターゲティング広告を IoT デバイスに配信する PHP アプリを作成する", "category": "opensource", "body": "この記事は、全 2 回からなるシリーズ「位置認識機能を備えた IoT アプリを作成する」の第 2 回です。位置認識機能を備えたアプリを作成する場合、IoT デバイスからリアルタイムのデータを受信するようになってもまだ五合目にすぎません。このようなアプリを完成させるためには、受信したデータに対して何らかのアクションが実行されるようにする必要があります。この記事では、PHP、MySQL、そして IBM Watson IoT Platform のルールを使用して、IoT デバイスからの着信データ・ストリームを処理し、その計算結果またはコマンドをリアルタイムでクラウドに送信する方法を説明します。有用な IoT ベースのアプリケーションを構築するには、このような双方向通信が鍵となります。" }
,{ "title": "位置認識機能を備えた IoT アプリを作成する、第 1 回: IoT デバイスから GPS データを取得して使用する PHP アプリを作成する", "category": "opensource", "body": "この記事は、全 2 回からなるシリーズ「位置認識機能を備えた IoT アプリを作成する」の第 1 回です。IoT アプリを作成しようとする PHP 開発者にとって、作業に取り掛かるのは困難な場合があります。そのような PHP 開発者のために、このチュートリアルではPHP で駆動する IBM Cloud IoT アプリケーションを構築するプロセスをステップ・バイ・ステップで解説します。このアプリケーションは、接続されたデバイスから IBM Watson IoT Platform に送信される位置情報データにサブスクライブし、Google Maps API を使用して、その位置情報データを地図の画像に反映させます。" }
,{ "title": "実行可能かつデプロイ可能な OpenWhisk 対応のコードを作成する", "category": "opensource", "body": "developerWorks サンドボックスの最大の利点としては、ブラウザー内でコードを実行することも、コードを IBM Cloud (Bluemix) にデプロイすることもできるという点が挙げられます。コードをデプロイする場合、コードは OpenWhisk アクションになります。ただし、OpenWhisk では JavaScript コードまたは Java コードが特定のインターフェースをサポートすることが要件となるため、そうなっていなければコードをデプロイすることができません。このチュートリアルでは、すべてを正常に機能させるためのルールと要件を説明します。" }
,{ "title": "Spring Boot の基礎", "category": "opensource", "body": "Spring Boot のスターター、見解、実行可能 JAR ファイル構造を使用して、「そのまま実行」できる Spring ベースのアプリケーションを迅速に作成する方法を学んでください。" }
,{ "title": "今まで知らなかった 5 つの事項: Java Database Connectivity", "category": "opensource", "body": "JDBC、つまり Java Database Connectivity は、JDK 全体の中で最も頻繁に使われるパッケージの 1 つでありながら、JDBC の機能をフルに利用している Java 開発者や JDBC の最新機能を利用している Java 開発者はごく稀です。この記事では Ted Neward が JDBC の新機能を紹介します。具体的には、自動的にスクロールし、オンザフライで更新できる ResultSet、データベース接続が開いているか否かによらず動作する Rowset、ネットワークを 1 度素早く往復するだけで複数の SQL 文を実行できるバッチ更新、などについて説明します。" }
,{ "title": "今まで知らなかった 5 つの事項: Apache Maven", "category": "opensource", "body": "皆さんはプロファイルについて十分理解しているかもしれませんが、Maven でプロファイルを使用すると、さまざまな環境で特定の動作を実行できることをご存じでしょうか。今回の「今まで知らなかった 5 つの事項」では Maven のビルド機能以外の機能について説明します。そのなかには、プロジェクトのライフサイクルを管理するための基本ツールについての説明も含まれています。この記事で紹介する 5 つのヒントを参考にすれば、生産性を高めることや、Maven で容易にアプリケーションを管理することが可能になります。" }
,{ "title": "Bluemix と Node.js を使用してユーザー向け OpenWhisk アプリケーションを作成する", "category": "opensource", "body": "OpenWhisk を使ってユーザー向けアプリケーションを作成するにはどのようにするのかを学んでください。このチュートリアルでは OpenWhisk の基礎をおさえる方法として、スタブ index.html から OpenWhisk を呼び出して実際のコンテンツを取得する、ユーザー向けサンプル・アプリケーションを作成します。" }
,{ "title": "多忙な Java 開発者のための LoopBack ガイド, 第 2 回: モデル", "category": "opensource", "body": "LoopBack フレームワークを紹介するシリーズの第 2 回では、基本的な Web API を開発するプロセスを通して、モデルとデータ・ソースを定義し、使用する方法を説明します。" }
,{ "title": "グラフ・データベース入門: 第 1 回 グラフ・データベースと CRUD 処理", "category": "opensource", "body": "グラフ・データベースに馴染みがないとしたら、グラフ・データベースを使うのは難しすぎると思うかもしれません。グラフ理論の授業を受けたことのある誰もが、この科目はかなり複雑であると断言するでしょう。けれども、グラフ理論の経験 (または、その経験がないこと) を基に、グラフ・データベースを近寄りがたい存在だと思い込まないでください。実際、完全に管理されたサービスとしてのグラフ・データベースを利用すれば、複雑さを抜きにして、グラフ・データベースのあらゆるメリットを手に入れることができます。このチュートリアルは、全 2 回からなるシリーズ「グラフ・データベース入門」の第 1 回です。" }
,{ "title": "グラフ・データベース入門: 第 2 回 グラフ・データベースを使用してレコメンデーション・エンジンを作成する", "category": "opensource", "body": "チュートリアル・シリーズ「グラフ・データベース入門」の第 2 回では、既存のレコメンデーション・エンジンの背後にあるコードを詳しく調べた後、商品のページにお勧めのアイテムを表示する機能を実装します。" }
,{ "title": "多忙な Java 開発者のための LoopBack ガイド, 第 1 回: Hello, World!", "category": "opensource", "body": "近頃、多くのオープンソース Node.js フレームワークがサーバー・サイド JavaScript 開発のさまざまな可能性を再び膨らませていますが、LoopBack もその 1 つです。LoopBack を開発環境にセットアップし、コマンド・ラインや API ライフサイクル管理プラットフォーム IBM API Connect を使用して初めての LoopBack API を作成してください。" }
,{ "title": "RESTful API の文書化と定義に Swagger を使用する", "category": "opensource", "body": "Swagger は RESTful API のドキュメントを生成するために役立ちますが、出力されたドキュメントに、必要な詳細やフィーチャーのすべてが含まれるとは限りません。カスタマイズした拡張機能、ツール、およびテンプレートを使用して、Swagger のネイティブ機能を拡張する方法を学んでください。" }
,{ "title": "D3 および Angular を使用したカスタム・データ視覚化", "category": "opensource", "body": "D3.js ライブラリーを使用してカスタム・データ視覚化を作成し、作成した視覚化を AngularJS アプリに統合します。" }
,{ "title": "Elasticsearch を Java アプリケーションの中で使用する", "category": "opensource", "body": "使いやすい REST API と、クラスターの自動スケーリングを組み合わせた Elasticsearch は、全文検索の分野を席巻しています。Elasticsearch をコマンド・シェルから、そして Java アプリケーション内から使用する方法について、この実践的な入門チュートリアルで学んでください。" }
,{ "title": "多忙な Java 開発者のための Sails.js ガイド: モデルとブループリント", "category": "opensource", "body": "Sails.js でのモデルは JavaScript オブジェクトによって表現されます。これらのオブジェクトは、リレーショナル・データベースやドキュメント指向データベースを含め、あらゆるタイプのデータ・ストアに保管することができます。このチュートリアルでは、Sails.js で初めてのモデルを開発し、データ駆動型アプリケーションにおなじみの機能である、作成、読み取り、更新、削除といった機能の組み込みサポートを提供する Sails のブループリントを導入します。" }
,{ "title": "次世代の JavaScript モジュールを利用するために jspm を使用する", "category": "opensource", "body": "jspm は、JavaScript によるクライアント・サイドの依存関係管理において、新しい境地を切り開くフレームワークです。このチュートリアルでは、jspm を使用することで、どのようにして次世代の JavaScript (ECMAScript 6) 言語の機能を今から利用することができるか、さらには jspm が npm や GitHub などのレジストリーを利用することで、どのようにしてモジュールを自動的に解決するかを説明し、jspm に組み込まれていて付加価値をもたらすツールについても見て行きます。" }
,{ "title": "Docker: 今どきの開発者への朗報", "category": "opensource", "body": "Docker を使用することで、より生産的にコーディングを行い、より効率的にスキルを高めてください。コンテナー化されたアプリケーションを扱うことで、開発環境を整えて、依存関係の競合を取り除き、開発および学習にかかる時間を削減してください。" }
,{ "title": "Linux の 101 試験対策: パーティションおよびファイルシステムの作成", "category": "opensource", "body": "ディスク・ドライブにパーティションを作成する方法、そしてパーティションをフォーマットして、Linux システムでスワップ領域またはデータ領域として使用する方法を学んでください。Linux Professional Institute の LPIC-1: Linux Server Professional Certification 101 試験に備えて勉強するためや、単にパーティションと Linux ファイルシステムについて学んで自分で使用するために、このチュートリアルの内容を利用してください。" }
,{ "title": "Play を使った Web アプリケーション開発: 第 1 回: Play Framework と Scala でユーザー認証を管理する", "category": "opensource", "body": "Play Framework アプリケーション用のユーザー管理を実装するために Scala のスキルを活用してください。このチュートリアルでは、認証と承認を扱う基本的な Play アプリケーションを作成する方法を Pablo Pedemonte が説明します。このアプリケーションのコードは、皆さん独自の Play プロジェクトのスターター・コードとして、ユーザー管理機能の開発時間を短縮するために利用することもできます。" }
,{ "title": "多忙な Java 開発者のための Sails.js ガイド: Sails を使用して基本的な Web アプリを作成してデプロイする", "category": "opensource", "body": "数あるサーバー・サイド JavaScript フレームワークと同じく、Sails.js を使用すれば、従来型の Web アプリケーションを容易に開発できるようになります。Sails は、Rails を画期的なフレームワークにした考え方を一部採用しており、Node.js を利用した Web 開発とモバイル開発に新たなレベルの生産性をもたらします。このシリーズの第 1 回では、Sails を他のフレームワークとは差別化しているものは何であるか、その概要を、Salis の MVC アーキテクチャーに対する革新的アプローチも含めて説明します。また、Salis を使用した開発環境を構築し、基本的な Sails アプリケーションを作成して、そのアプリケーションを IBM Bluemix にデプロイします。" }
,{ "title": "Linux の 101 試験対策: ブート・マネージャーのインストール", "category": "opensource", "body": "Linux システムのブート・マネージャーを選択する方法、そして選択したブート・マネージャーを構成する方法を学んでください。このチュートリアルの内容は、Linux システム管理者認定用の LPI 101 試験に備えて勉強するために利用することも、楽しんで学習するために利用することもできます。" }
,{ "title": "Intro.js を使用して JavaScript アプリにインタラクティブなマニュアルを追加する", "category": "opensource", "body": "Intro.js を使用して、すぐに理解できるインタラクティブなユーザー・マニュアルを JavaScript アプリに追加しましょう。アプリのフィーチャーをアプリの UI の中からいまどきの手法でデモする方法をサンプル・ツアーの実装から学んでください。" }
,{ "title": "LAMP アプリケーションを Bluemix にマイグレーションする", "category": "opensource", "body": "昔ながらの LAMP アプリケーション (Drupal) を IBM Bluemix にマイグレーションする方法を学んでください。" }
,{ "title": "JVM の並行性: Akka を使って非同期に振舞う", "category": "opensource", "body": "並行プログラミングに対する手法として長きにわたって確立されているアクター・モデルを使用すると、並行性とスケーラビリティーに優れたアプリケーションを簡単に構築できるようになります。この記事でアクター・モデルについて学び、Akka で実装したモデルを Scala または Java で扱うようになってください。" }
,{ "title": "JVM の並行性: Akka を使ってアクター・アプリケーションを作成する", "category": "opensource", "body": "アクター・アプリケーションには、シングルスレッド・アプリケーションで用いられる線形アプローチとは異なるスタイルのプログラミングが必要です。ツールキットおよびランタイムとして Akka を使用してシステムを構築する方法について、Scala コードのアクターとメッセージという観点でさらに深く探ってください。" }
,{ "title": "Linux の 101 試験対策: ハード・ディスクのレイアウト", "category": "opensource", "body": "Linux システムにおけるディスク・パーティションの構成を設計する方法を学んでください。Linux Professional Institute LPIC-1: Linux Server Professional Certification 101 試験に備えるためや、自ら活用するために学ぶ上で、このチュートリアルの内容を活用してください。" }
,{ "title": "大規模なデータ統合: OSLC と Linked Data Platform", "category": "opensource", "body": "今回の記事では、この連載で紹介している概念を、OSLC (Open Services for Lifecycle Collaboration) コミュニティーがコラボレーションによるソフトウェア開発にどのように適用しているかを学んでください。OSLC は、ソフトウェア・ライフサイクル全体を通して、要件追跡ツールと、開発ツール、テスティング・ツールを連動させやすくする目的で、Linked Data とその他のセマンティック Web 標準を使用しています。" }
,{ "title": "MEAN をマスターする: MEAN スタックのテスト", "category": "opensource", "body": "MEAN スタックのテスティング・インフラストラクチャーを構成する、疎結合の小さなピースについて見て行きましょう。MEAN でも MEAN でなくても、アプリケーションを本番環境へ移行するには、その前に厳格かつ総合的なテスト・スイートに合格しなければなりません。この記事では、(PhantomJS の助けを借りて) Karma、Mocha、Jasmine、istanbul を使用して UGLI アプリケーションをテストする方法を説明します。" }
,{ "title": "React Native: 迅速な iOS 開発の新しい世界へ", "category": "opensource", "body": "iOS 開発用プラットフォームとツール・セットとして最も急成長している React Native を使用して、モバイル開発を迅速に行ってください。React Native を使用すれば、Objective-C や Swift のチュートリアルは脇に置いて、JavaScript で iOS アプリのコーディングを始めることができます。この記事では React Native の概要を紹介し、そのアーキテクチャーと内部動作を説明した後、React Native のプログラミング手法に焦点を当てたサンプル・アプリに取り組みます。" }
,{ "title": "一新された PHP: Vagrant と PuPHPet を使用して環境を構築する", "category": "opensource", "body": "Vagrant と PuPHPet のおかげで、PHP による開発とデプロイを行うための複数の同一環境を、仮想マシン・テクノロジーを利用して簡単に構築することができます。この 2 つのオープンソース・ツールは、VirtualBox などのデスクトップ仮想化ソフトウェアと連動するので、システム間の違いが原因で生じる明らかなバグを排除しやすくなります。この記事では、PHP エキスパートの Eli White が、Vagrant と PuPHPet をチームに役立てる方法を説明します。" }
,{ "title": "Meteor を使用したインスタント Web アプリケーション", "category": "opensource", "body": "Web アプリケーション開発プラットフォームとして Meteor を使用すれば、JavaScript 開発者は極めてインタラクティブで応答性に優れたリッチ・クライアント Web アプリケーションを迅速かつ簡単に設計して構築することができます。この記事で、業界標準の JavaScript ライブラリーを利用して、Meteor によるアプリケーションを構築する実践的な経験をしてください。Sing Li が Meteor の真実に迫り、ありきたりではない機能的なサンプル・アプリケーションを通して Meteor の有望さを探ります。編集者注: このチュートリアルは、2013年の初期ベータ版から現在のバージョンである 1.1.x に Meteor フレームワークがバージョンアップされたことによる変更内容を反映するように更新されました。" }
,{ "title": "Bluemix DevOps Services デリバリー・パイプラインで Maven を使用する", "category": "opensource", "body": "既存の Apache Maven プロジェクトを Bluemix DevOps Services のデリバリー・パイプラインに統合する方法と、Maven プロジェクトを Bluemix DevOps Services プロジェクトとして使用できるようにセットアップする方法を学んでください。" }
,{ "title": "一新された PHP: Composer による PHP 依存関係の処理", "category": "opensource", "body": "最近の複雑な PHP プロジェクトでは、複数のサード・パーティー・ライブラリーを使用することがよくありますが、これらのライブラリー自体にも依存関係があります。PHP コミュニティーのために PHP で作成された、Composer というオープンソース・プロジェクトが、最新の PHP アプリケーションから依存関係処理の大変な部分をどのように取り除くかを学んでください。" }
,{ "title": "PHP の新しい側面: 一新された PHP: 最新の PHP でのパスワード・セキュリティー", "category": "opensource", "body": "PHP による Web アプリケーションのパスワードをハッカーから守ってください。PHP が Web とともに進化し続ける中、パスワードを安全に保管しなければならない Web アプリケーションが増えてきています。この全 4 回からなる連載「一新された PHP」の第 2 回では、PHP 5.5 で新たに追加されたパスワード処理機能について学んでください。" }
,{ "title": "Dojo Mobile でグラフィカル KPI ダッシュボード・アプリを作成する", "category": "opensource", "body": "Dojo Mobile を使用すると、モバイル開発に要する時間が大幅に削減されると同時に、よく利用されているモバイル端末で適切に拡大縮小される、直感的かつリッチな画面を作り出すことができます。このチュートリアルでは、Dojo Mobile のチャート作成ライブラリーとゲージ・ライブラリーを使用することで、モバイル KPI アプリを介してビジネス・ユーザーや経営者に組織の主要業績指標を提供する方法を説明します。" }
,{ "title": "大規模なデータ統合: RDF を使用してデータの Web を作成する", "category": "opensource", "body": "データ統合の標準とテクノロジーに関する、全 5 回からなる連載記事の第 1 回では、Brian Sletten が OSLC (Open Services for Lifecycle Collaboration) と呼ばれる新しい標準一式の基礎となっている RDF (Resource Description Framework) について紹介します。RDF は、World Wide Web Consortium (W3C) のセマンティック Web テクノロジー・スタックの一部として、複数の参加者の間で大々的な事前調整を行うことなく情報の統合を容易に行えるように設計されたものです。" }
,{ "title": "React: 保守しやすいハイパフォーマンスの UI コンポーネントを作成する", "category": "opensource", "body": "UI ビュー・コンポーネントを作成して組み合わせ、今風の Web UI を構成するという作業を容易にするために、オープンソースの JavaScript ライブラリー React を使い始めてください。このチュートリアルの例に従い、保守しやすく再利用可能な React コンポーネントを作成するために定められたベスト・プラクティスについて学んでください。" }
,{ "title": "ドメインに特化した企業ディレクトリーに対する OpenStack Keystone によるサポートを構成する", "category": "opensource", "body": "OpenStack は、IaaS (Infrastructure as a Service) プラットフォームを提供するパブリック・クラウドやプライベート・クラウドを構築するためのオープンソース・ソフトウェアです。Keystone は、OpenStack ファミリーのプロジェクトに対し、ユーザーの認証や承認をはじめとする、アイデンティティー・サービスを提供する OpenStack のサブプロジェクトです。この記事では、Keystone で最近リリースされた、ドメインに特化した LDAP および Active Directory のサポートを構成する方法を紹介します。" }
,{ "title": "PHP のニュー・フェイス: 一新された PHP", "category": "opensource", "body": "PHP はテンプレート言語として使用されていた初期の頃から、目覚ましい進化を遂げています。最近の PHP プログラミングについて取り上げる全 4 回からなる連載の第 1 回では、PHP のエキスパートである Eli White が、PHP 5.3 以降での進化をいくつか取り上げて詳しく説明します。名前空間、トレイト、クロージャー、ジェネレーターなどについて理解してください。" }
,{ "title": "MEAN をマスターする: OAuth と Passport による認証の管理", "category": "opensource", "body": "連載「MEAN をマスターする」の前回の記事では、Meetup.com の RESTful API を使用して、ミーティング情報が格納された JSON を取り込みました。今回はサンプル・アプリケーションにログイン機能を追加するために、Meetup.com の OAuth サービスを利用します。" }
,{ "title": "「モノのインターネット」を使用して節水する: パート 1", "category": "opensource", "body": "3 部構成シリーズのこの最初のチュートリアルでは、Raspberry Pi をベースにした室内用鉢植え植物をモニターするソリューションを低コストで作成する方法を説明します。このソリューションでは、センサー・データの収集とビジュアライゼーション、およびソーシャル・ネットワークへの更新情報の投稿に IBM Bluemix を使用します。" }
,{ "title": "「モノのインターネット」を使用して節水する: パート 3", "category": "opensource", "body": "3 部構成シリーズのこの 3 番目のチュートリアルでは、Raspberry Pi をベースにした低コストの植物モニター・ソリューションの作成方法を説明します。この最後のチュートリアルでは、デスクトップ・デバイスおよびモバイル・デバイス用にセンサー・データをビジュアライズする HTML5 アプリケーションを作成します。データを Cloudant データ・ストアから利用可能にするためにオープン・データ API を作成します。" }
,{ "title": "「モノのインターネット」を使用して節水する: パート 2", "category": "opensource", "body": "3 部構成シリーズのこの 2 番目のチュートリアルでは、Raspberry Pi をベースにした低コストの植物モニター・ソリューションを作成する方法を説明します。Node-RED アプリケーションを保護し、コードの変更に応じた Bluemix への自動デプロイメントをセットアップします。" }
,{ "title": "MEAN をマスターする: MEAN と Meetup.com、Microdata との融合", "category": "opensource", "body": "連載「MEAN をマスターする」の第 4 回では、MEAN アプリケーションに Meetup.com の RESTful API を統合します。そのための作業の過程では、HTML に若干の Microdata を追加してセマンティクスの観点でマークアップすることにより、Web ページを検索エンジンで今より扱いやすくなるようにします。" }
,{ "title": "developerWorks の最前線から: 2014 年のオープン・テクノロジー関連のベスト・コンテンツ", "category": "opensource", "body": "developerWorks では、サイトの開設 15 周年をお祝いしていますが、技術に関する全体的な様相が、今年ほど刺激的または複雑だったことはありません。数え切れないほどの製品、プロジェクト、テクニックがあるなかで、余計な情報は省いて、現在ホットなものを概観します。" }
,{ "title": "MEAN をマスターする: MEAN とレスポンシブ Web デザインを適用した UGLI CRUD", "category": "opensource", "body": "連載の著者である Scott Davis が UGLI (User Group List and Integration) アプリケーションという、ユーザー・グループ管理支援ソフトウェアを紹介します。MEAN スタックの基本的な CRUD (Create、Read、Update、Delete) 機能を探るとともに、Bootstrap フレームワークのレスポンシブ Web デザイン機能の概要を学んでください。" }
,{ "title": "Arduino Uno と IBM IoT Foundation を利用してクラウド対応の温度センサーを作成する: 第 1 回 回路を組み立てて環境を構築する", "category": "opensource", "body": "このチュートリアル (全 4 回からなるシリーズの第 1 回) では、Arduino マイクロコントローラーを紹介するとともに、自宅の機器が正常に動作するよう管理するという問題を解決するために、著者がこの Arduino をどのように利用したかを説明します。また、Arduino のハードウェア・アドオンを紹介し、これらのアドオンを接続する方法、ハードウェアをテストするためのプログラムをロードする方法を説明します。" }
,{ "title": "Arduino Uno と IBM IoT Foundation を利用してクラウド対応の温度センサーを作成する: 第 2 回 スケッチを作成して IBM IoT Foundation Quickstart に接続する", "category": "opensource", "body": "このチュートリアル (全 4 回からなるシリーズの第 2 回) では、IoT (Internet of Things) 用に設計された MQTT (旧称 Message Queueing Telemetry Transport) というプロトコルを紹介し、MQTT を Arduino に実装する方法を説明します。ローカルで MQTT をテストして問題をデバッグするためのツールと手法を学ぶとともに、カスタム・データのグラフ化に対応する IBM Internet of Things Foundation Quickstart に接続する Arduino スケッチを作成してください。" }
,{ "title": "JVM の並行性: Scala での非同期イベント処理", "category": "opensource", "body": "Scala の Future クラスと Promise クラスは、イベントを編成して順序付けるノンブロッキング手法を含め、非同期処理を扱う強力な手段を提供します。しかも Scala では、マクロとして実装された async / await 構成体によって、ノンブロッキング型のイベント処理をより簡単に作成することができます。このチュートリアルでは、Future と Promise を使用する基本手法の実際を紹介した後、async / await を利用して、単純なブロッキング型のように見えるコードをノンブロッキング方式で実行されるように変換する方法をデモンストレーションします。" }
,{ "title": "MEAN をマスターする: MEAN アプリケーションについて探る", "category": "opensource", "body": "連載「MEAN をマスターする」の最初のチュートリアルでは、Yeoman ジェネレーターを使用して、MEAN アプリケーションを立ち上げました。今回は、このアプリケーションについて探るツアーとして、アプリケーションで受信される初の HTTP リクエストをサーバー・サイド (Node.js および Express) からクライアント・サイド (AngularJS) まで追跡します。" }
,{ "title": "MEAN をマスターする: MEAN スタックの紹介", "category": "opensource", "body": "Web 開発のエキスパートである Scott Davis による、この全 6 回からなる連載では、MongoDB、Express、AngularJS、および Node.js を使用した前衛的な方法で Web アプリケーションを作成します。連載第 1 回目となる今回のチュートリアルでは、基本的な MEAN アプリケーションを作成する方法に関するデモ、サンプル・コード、そしてその完全な手順を紹介します。また、新しい MEAN アプリケーションを迅速かつ簡単に立ち上げるために使用できる Yeoman ジェネレーターについても説明します。" }
,{ "title": "SoftLayer 上で Open edX によるオンライン・ラーニング・プラットフォームを構築する", "category": "opensource", "body": "この記事では、SoftLayer 環境において、Open edX プラットフォームを迅速かつ容易にインストールしてセットアップする方法を紹介します。また、環境の構成を開始して、Open edX を使用するための準備をする方法も紹介します。" }
,{ "title": "Software Defined Networking を使用して IaaS を最適化する", "category": "opensource", "body": "この記事では IaaS (Infrastructure as a Service) を、相互運用性、ユーザーとプロバイダーの期待値マネジメント、開発者と管理者の要件、効果的なリスク軽減といった点で強化および最適化する手法としての SDN (Software Defined Networking) <mdash></mdash> ソフトウェア抽象化層を介したネットワーク管理手法 <mdash></mdash> について探ります。" }
,{ "title": "Node.js および MongoDB を使用して単純な通知サービスを作成する", "category": "opensource", "body": "開発グループ間で異種のツールを数多く使用する必要があるならば、イベントの作成、イベントに対するシグナリング、イベントへの登録をするための通知サービスを試しに使ってみてください。このサービスについては、この記事で順を追って説明します。" }
,{ "title": "Node.js、Express、AngularJS、および MongoDB を使用してリアルタイム・アンケート・アプリケーションを作成する", "category": "opensource", "body": "アンケートの回答が送られてくるとリアルタイムで結果が更新されるアンケート・アプリケーションを作成してください。私が作成したアプリは、すべてにJavaScript を使用した単純なアーキテクチャーをしています。バックエンドには Node.js と Express が使用され、アプリのデータは MongoDBに格納されます。フロントエンドのユーザー・インターフェースには AngularJS と Bootstrapが使用され、アンケートに回答するとリアルタイムでクライアントが更新されるように WebSocket も使用されています。" }
,{ "title": "Python、SciKit、およびテキスト分類を利用して行動プロファイルを作成する", "category": "opensource", "body": "顧客がこれまで購入した商品に関する説明のテキスト属性に基づいて、顧客の行動プロファイル・モデルを作成する方法を学んでください。SciKit は、モデルの作成と評価をするための強力な Python ベースの機械学習パッケージです。この SciKit を利用して、モデルを作成し、シミュレートした顧客の商品購入履歴にそのモデルを適用する方法を学んでください。この記事のサンプル・シナリオでは、各顧客が購入する特定の商品とそれに対応するテキストの商品説明を基に、個々の顧客に音楽リスナーのプロファイルを割り当てるモデルを作成します。" }
,{ "title": "Java.next: Clojure での並行処理", "category": "opensource", "body": "すべての Java.next 言語のなかで、Clojure は並行処理に関して最も急進的な手法を採用しています。この記事では、Epochal Time Model、ソフトウェア・トランザクション・メモリーをはじめとする、Clojure の並行処理に関するさまざまな側面のうちのいくつかを取り上げて、詳細を探ります。" }
,{ "title": "OpenStack プライベート・クラウド用の Linux イメージと Windows イメージを作成する", "category": "opensource", "body": "この記事では、OpenStack クラウド・オペレーティング・システムを使用して構築されたプライベート・クラウド用に、Linux イメージと Windows イメージを作成する新しい方法を提案します。OpenStack 環境用のイメージを作成するために現在採られている方法は、面倒で時間がかかります。そこで著者たちは、プライベート・クラウドのオペレーターとエンド・ユーザーが今までよりも迅速かつ容易にイメージを作成するためのオンラインのセルフサービス方式を提案します。" }
,{ "title": "Zend Framework 2 を使って Web アプリケーションのセキュリティーを強化する", "category": "opensource", "body": "Web アプリケーションは、SQL インジェクション、XSS、CSRF、スパム、総当たりパスワードによるハッキングを含め、各方面からの攻撃を受けやすいものですが、Zend Framework 2 に用意されているセキュリティー関連のコンポーネントを使用すれば、PHP Web アプリケーションを一般的な攻撃の大多数から簡単に守ることができます。この記事では、これらのコンポーネントを使用して、フォーム入力の検証、ボットによるフォーム送信の除外、コメント・スパムの拒否、そして通常とは異なるイベントのロギングなどを行うことで、アプリケーションをよりセキュアにする方法を説明します。" }
,{ "title": "WebGL による 3D 開発: 第 2 回 WebGL ライブラリーを利用して、簡潔なコードに機能を凝縮する", "category": "opensource", "body": "JavaScript 開発者は WebGL API を使用することで、最近の PC やモバイル端末のハードウェアに組み込まれている強力な 3D グラフィックス・アクセラレーション機能を直接利用することができます。WebGL は最近のブラウザーではほとんどサポートされており、これを使用することで、一般 Web ユーザー向けにハイパフォーマンスの 3D ゲーム、アプリケーション、そして 3D で拡張した UI を作成することができます。この記事は、WebGL に初めて取り組む JavaScript 開発者を対象とした全 3 回からなる連載の第 2 回です。今回は、著者の Sing Li が、WebGL API に直接コーディングするよりも遥かに効率的な 3D 開発を可能にする 2 つのライブラリーを紹介します。" }
,{ "title": "Zend Framework とともに Doctrine を使用する", "category": "opensource", "body": "Doctrine は PHP アプリケーションを開発するための ORM (オブジェクト・リレーショナル・マッピング) ツールです。若干の構成作業を行うことで、Zend Framework に Doctrine を組み合わせることができ、Doctrine のエンティティーを使用して簡単にアプリケーションのデータを操作できるようになります。この記事では、Doctrine 2.3 を Zend Framework 1.x または 2.x によるアプリケーションと統合するプロセスについて説明します。" }
,{ "title": "Twitter Storm でビッグ・データをリアルタイムに処理する", "category": "opensource", "body": "Storm は、オープンソースのビッグ・データ処理システムです。Storm はリアルタイム分散処理を対象としている点、そして言語に依存しないという点で、他のビッグ・データ処理システムとは異なります。Twitter の Storm とそのアーキテクチャー、そしてさまざまなバッチ処理ソリューションおよびストリーム・プロセッシング・ソリューションについて学んでください。" }
,{ "title": "独自のブラウザー拡張機能を作成する: 第 1 回、Chrome を拡張する", "category": "opensource", "body": "どのブラウザーにも、それぞれに固有の長所と短所があり、支持する人もいれば、批判する人もいます。そのなかで、すべてのブラウザーに共通して言えることは、人々がブラウザーで費やす時間がますます増えているということです。この連載では、Chrome、Firefox、および Safari を対象に、共通のベーシックな拡張機能を作成する方法を検討します。それによって、それぞれのブラウザーを拡張する作業とはどのようなものなのか、また共通する作業の難易度はどの程度なのか、さらには拡張機能を配布する方法とはどのようなものなのかを説明します。今回の記事では、Chrome の拡張機能を作成します。" }
,{ "title": "サーバー・クラスター対応の Java アプリケーションを構築する", "category": "opensource", "body": "極めてスケーラブルな Javaエンタープライズ・アプリケーションを開発する場合、サーバーをクラスタリングするのが当たり前のことになってきています。けれども今のところ、Java EEではアプリケーション・レベルでサーバー・クラスターに対応できるようにはなっていません。この記事では、分散型エンタープライズ Javaアプリケーションにおいて、サーバー・グループのコーディネーションをするために、Apache ZooKeeper と LinkedIn の Norbert という 2つのオープンソース・プロジェクトを利用する方法を Mukul Gupta と Paresh Paladiya が紹介します。" }
,{ "title": "Hadoop のための Oozie ワークフロー・スケジューラー", "category": "opensource", "body": "ビッグ・データがそのままの形式で、Hadoop を使用してデータ処理タスクを実行する開発者のデータ要件を満たすことは、ほぼありません。実際にデータ処理を行うジョブを開始する前に、さまざまな ETL (Extract/Transform/Load: 抽出/加工/書き込み) や前処理が必要になるのが一般的です。このプロセスを自動化したり、これらの作業を時間が経過した後でも新しいコードやステップを作成せずに再利用できる、繰り返し実行可能な単位およびワークフローへと体系化したりするのに役立つのが、Oozie フレームワークです。この記事では、Oozie を使用してさまざまなタイプのワークフローを作成する方法について説明します。" }
,{ "title": "OpenStack について学ぶ: アーキテクチャー、機能、相互作用", "category": "opensource", "body": "OpenStack は、IBM をはじめ、業界をリードする企業が推進している人気の高いオープンソース・クラウド・コンピューティング・プロジェクトです。OpenStack について概説するこの記事では、OpenStack の全体的なアーキテクチャー、個々のモジュールの機能、そしてモジュール間の相互作用を紹介します。OpenStack の各種コンポーネントについては、連載の他の記事で詳しく説明します。" }
,{ "title": "OpenStack について学ぶ: ストレージ関連コンポーネントの Swift と Cinder", "category": "opensource", "body": "この記事では、OpenStack のブロック・ストレージ (Swift) プロジェクトとオブジェクト・ストレージ (Glance) プロジェクトを紹介し、OpenStack のアーキテクチャー全体の中でこの 2つのプロジェクトがどのような位置を占めており、どのような機能を実現するのかを説明します。また、これらのコンポーネントをインストール、構成、使用する上での要件についても説明します。" }
,{ "title": "Selenium と Cucumber を使用した自動テスト", "category": "opensource", "body": "シンプルなフィーチャー (feature) ファイルにテストを記述し、ブラウザーでスイッチを切り替えてこのテストを実行する方法を習得することにより、Selenium と Cucumber を使用したテストを自動化する作業を楽なものにしてください。この記事は、Selenium と Cucumber を使用したテスト自動化フレームワークのセットアップ、シングル・ページ Web アプリケーション用のテスト・スイートの作成、そして Selenium Grid による複数の Web/モバイル・ブラウザーでのテストを行うための実践的な入門ガイドです。" }
,{ "title": "Ruby を使用して Web から情報を抽出する", "category": "opensource", "body": "この記事では、構造化された情報を Web から抽出するための最新の方法について探っていきます。著者である M. Tim Jones が Ruby スクリプトの例を使用して、スクレイピング技術について説明するとともに、目的のデータを取得するために Web API を使用する方法について説明します。" }
,{ "title": "レコメンダー・システム: 第 2 回 オープンソース・エンジンの紹介", "category": "opensource", "body": "この連載の第 1 回では、レコメンデーション・エンジンを構築するための基本的な手法とアルゴリズムについて紹介しました。連載を締めくくる今回は、レコメンダー・システムを構築するためのオープンソースのソリューションをいくつか紹介するとともに、2 つのオープンソース・ソリューションを実際に使用する方法を説明します。また、単純なクラスタリング・アプリケーションを Ruby で作成し、そのアプリケーションをサンプル・データに適用する方法についても説明します。" }
,{ "title": "レコメンダー・システム: 第 1 回 手法とアルゴリズムの紹介", "category": "opensource", "body": "大規模な商用 Web サイトやソーシャル Web サイトでは、そのほとんどがユーザーに対して、おすすめの商品を紹介してくれたり、おすすめのユーザーを紹介してつながれるようにしてくれたりします。レコメンデーション・エンジンは膨大なデータを分類し、ユーザーの気に入りそうなものを特定します。この記事では全 2 回からなる連載の第 1 回として、レコメンダー・システムの基礎となる概念を説明し、レコメンダー・システムを駆動するアルゴリズムについて紹介します。第 2 回では、利用可能なオープンソースのレコメンデーション・エンジンについて説明します。" }
,{ "title": "PHP アプリケーションと Instagram の統合: 第 2 回", "category": "opensource", "body": "Instagram は、ユーザーがスマートフォンで写真を撮って、その写真を Web を介して他のユーザーと共有できる、人気の高い写真共有サービスです。アプリケーション開発者は Instagram REST API を使用して、これらの写真を検索し、写真とそれに関連付けられているコメントや「いいね!」の情報を取得することができます。この全 2 回からなる記事では Instagram API を紹介するとともに、Instagram のユーザーが生成した豊富なコンテンツのリポジトリーを利用して革新的な Web アプリケーションを作成するために、この API を PHP で使用する方法を説明します。" }
,{ "title": "スケーラブルなクラウド・ソフトウェアの開発を Apache Thrift で単純化する", "category": "opensource", "body": "Apache Thrift は、スケーラブルなサービスをさまざまなプログラミング言語で開発できるフレームワークであり、クラウド環境内のさまざまなコンポーネント間のやりとりを明確に規定することができます。この記事では、Thrift に関連する概念 (複数のプログラミング言語の場合のリモート・プロシージャー・コールに対するインターフェース定義) について紹介した後、複数のプログラミング言語が使用されているクライアント・サーバー・アプリケーションで Thrift を使用する例について説明します。" }
,{ "title": "PHP の学習: 第 3 回 認証、オブジェクト、例外、ストリーム処理", "category": "opensource", "body": "このチュートリアルは、単純なワークフロー・アプリケーションの構築プロセスを通して PHP の使用方法を説明する 3 部構成のシリーズ「PHP の学習」の第 3 回です。今回のチュートリアルでは、HTTP 認証の使用方法、ファイルをストリーム処理する方法、そしてオブジェクトと例外の作成方法を学びます。" }
,{ "title": "Apache Lucene および Solr 4 による次世代の検索とアナリティクス", "category": "opensource", "body": "Apache Lucene と Solr は、組織が簡単かつ劇的にデータ・アクセス能力を高めることを可能にする、極めて能力の高いオープンソースの検索テクノロジーです。Lucene および Solr のバージョン 4.x では、データ駆動型アプリケーションに、今まで以上に簡単にスケーラブルな検索機能を追加できるようになっています。この記事では、Lucene と Solr のコミッターである Grant Ingersoll が、関連度、分散検索、ファセット処理に関係する、最新の Lucene と Solr の機能を紹介します。高速かつ効率的でスケーラブルな次世代のデータ駆動型アプリケーションを構築するために、これらの機能を利用する方法を学んでください。" }
,{ "title": "Linux ブートの失敗からのリカバリー", "category": "opensource", "body": "カーネルのアップグレードやディスク・スワップ、あるいはその他のシステム変更が行われた後に Linux コンピューターがブートしなくなったとしても、手の施しようがないわけではありません。GRUB (Grand Unified Bootloader) には、ブート・プロセスを制御してリカバリーするための手段がいくつかあります。あるいは、外部ツールを使って緊急ブート・ディスクを作成しておけば、必要に応じてそのディスクに救いの手を求めることができます。この記事では、問題がある状況下でもブートできるようにするための手順および GRUB コマンドについて説明するとともに、BIOS ベースのシステムの「命を救う」外部ツールを紹介します。" }
,{ "title": "PHP の学習: 第 2 回 ファイルをアップロードし、ファイルの情報を XML または JSON 形式で保管し、表示する", "category": "opensource", "body": "このチュートリアルは、単純なワークフロー・アプリケーションの構築プロセスを通して PHP の使用方法を説明する 3 部構成のシリーズ「PHP の学習」の第 2 回です。PHP の基礎知識を基に、ブラウザーからファイルをアップロードする方法や、セッションについて、あるいは PHP で XML または JSON を処理する方法について学ぶには、このチュートリアルに従ってください。" }
,{ "title": "VoltDB 入門", "category": "opensource", "body": "NoSQL データベースが持つスケーラビリティーを実現するとともに、従来のリレーショナル・データベース・システムが持つ ACID 特性を備えたインメモリー・データベース、VoltDB について学んでください。この記事では、データベース・テーブルを設計してパーティショニングし、Java コードで作成されたストアード・プロシージャーを使用してデータの格納と取得を行う方法を説明します。さらに、VoltDB をベースに作成されたキー・バリュー型ストアである VoltCache についても探ります。" }
,{ "title": "Java アプリから動的に PDF ファイルを生成する", "category": "opensource", "body": "アプリケーションで PDF 文書を動的に作成する必要がある場合、iText ライブラリーが必要です。オープンソースの iText ライブラリーを使用すると、PDF を簡単に作成することができます。この記事では iText を紹介するとともに、iText を使用して Java アプリケーションから PDF 文書を生成する方法について順を追って説明します。また、iText についての理解を深めるために、サンプル・アプリケーションを作成します。" }
,{ "title": "Slim マイクロフレームワークで REST アプリケーションを作成する", "category": "opensource", "body": "Slim は、PHP アプリケーションを開発するための機能を完備したオープンソースのマイクロフレームワークです。Slim はその高度な URL ルーターおよびミドルウェア・アーキテクチャーから、静的 Web サイトや API プロトタイピングにとって最適なフレームワークとなっています。この記事では、Slim について詳しく探り、Slim を使用して認証および各種のリクエスト/レスポンス・フォーマットに対応する REST API を迅速に作成してデプロイする方法を説明します。" }
,{ "title": "DB2のNoSQLによるJSONサポート機能（第2部）: コマンドライン・プロセッサーを使用する", "category": "opensource", "body": "アプリケーション環境が急速に変化するなか、さまざまなアプリケーション・レイヤー間でデータを保存・交換するための柔軟なメカニズムが必要となっています。JSON (JavaScript Object Notation)はスキーマ設計のオーバーヘッドを削減し、データ加工を行う必要がないため、モバイル環境をサポートするインタラクティブなアプリケーションの構築のためには不可欠なテクノロジーとなっています。DB2のNoSQLによるJSONサポート機能を活用すると、開発者はMongoDBに基づいて作成したポピュラーなJSONベースのクエリー言語を使用することによって、IBM DB2 for Linux, UNIX, and Windowsに保存されたデータを処理するアプリケーションを作成することができます。ドライバー・ベースの本ソリューションは実績のあるエンタープライズ機能と高い質のサービスを提供するRDBMSと連携し、JSONによるデータの柔軟な表示を実現します。DB2のNoSQLによるJSONサポート機能は、JSON文書を処理するにあたってコマンドライン・プロセッサー、Java API、および通信リスナーをサポートします。本記事では、NoSQLアプリケーションをサポートするためにDB2データベースの設定を行い、独自のアプリケーションを開発することを目的としたNoSQLによるコマンドライン・プロセッサーの基本的な活用方法を確認します。" }
,{ "title": "DB2のNoSQLによるJSONサポート機能（第4部）: IBMによるDB2に対応するNoSQLの通信リスナーを使用する", "category": "opensource", "body": "DB2のNoSQLによるJSONサポート機能を活用すると、開発者はMongoDBに基づいて作成したポピュラーなJSONベースのクエリー言語を使用することによって、IBM DB2 for Linux, UNIX, and Windowsに保存されたデータを処理するアプリケーションを作成することができます。ドライバー・ベースの本ソリューションは実績のあるエンタープライズ機能と高い質のサービスを提供するRDBMSと連携し、JSONによるデータの柔軟な表示を実現します。DB2のNoSQLによるJSONサポート機能は、JSON文書を処理するにあたってコマンドライン・プロセッサー、Java API、および通信リスナーをサポートします。この記事では、IBMによるDB2に対応するNoSQLの通信リスナーについて紹介します。本通信リスナーはMongoDBの通信プロトコルに基づいてメッセージを解析します。そのため、MongoDBのコミュニティーに提供されるさまざまなドライバーを使用し、これらのドライバーを使用する際に身に着けたスキルを活用することによって、DB2をJSONストアとして使用したうえでJSON文書の保存・更新・検索を行うことができます。" }
,{ "title": "DB2のNoSQLによるJSONサポート機能（第3部）: Java APIを使用してアプリケーションを作成する", "category": "opensource", "body": "DB2のNoSQLによるJSONサポート機能を活用すると、開発者はMongoDBに基づいて作成したポピュラーなJSONベースのクエリー言語を使用することによって、IBM DB2 for Linux, UNIX, and Windowsに保存されたデータを処理するアプリケーションを作成することができます。ドライバー・ベースの本ソリューションは実績のあるエンタープライズ機能と高い質のサービスを提供するRDBMSと連携し、JSONによるデータの柔軟な表示を実現します。DB2のNoSQLによるJSONサポート機能は、JSON文書を処理するにあたってコマンドライン・プロセッサー、Java API、および通信リスナーをサポートします。DB2によるJSONサポート機能に基づくJava APIはコマンドライン・プロセッサーと通信リスナーの基盤となる機能を提供し、カスタム・アプリケーションの作成をサポートします。本記事ではサンプルのJavaプログラムに基づいて基本的な使用方法について紹介し、JSON文書の保存と検索を最適化するためのオプションを説明します。" }
,{ "title": "Java.next: 継承を伴わない拡張、第 3 回", "category": "opensource", "body": "Java.next 言語 ― Groovy、Scala、および Clojure ― では、Java 言語の拡張に関する制約をさまざまな方法で是正しています。連載「Java.next」の今回の記事で取り上げるのは、Groovy のメタプログラミング機構で使用できる驚異的な拡張機能です。" }
,{ "title": "万人のためのモバイル: 自作の Android アプリに署名を付け、封印し、配布する", "category": "opensource", "body": "Web ロジックではコンテンツが何よりも重要ですが、モバイル・ユーザーにとってはアプリとの対話がすべてを支配します。モバイル・アプリでは、静的な情報によるデザインが行われなくなり、代わりにゲーミフィケーションが採用されるようになっています。今回の記事では、Andrew Glover が Android モバイル開発の紹介を完結するために、前回の記事で紹介したサンプル・アプリケーションの Overheard Word に多岐選択式クイズの機能を追加します。その後、デジタル署名を生成する方法、そして署名付きのアプリを Android 向けの Google Play または Amazon Appstore で公開して宣伝する方法を説明します。" }
,{ "title": "Spring Redis アプリケーションを開発する", "category": "opensource", "body": "Redis は、キー・バリュー型の NoSQL データストア・ソリューションです。Spring Data Redis は、Java 開発者が下位レベルの Redis API を直接操作することなく、Redis を使用して Spring アプリケーションを構築できるようにするための、Spring ポートフォリオ・プロジェクトです。この記事では Redis について紹介した後、Spring Data Redis API を使用して単純な辞書アプリケーションを構築する方法を説明します。" }
,{ "title": "LyX を使用してグラフィカルな方法で LaTeX 文書を作成する", "category": "opensource", "body": "LyX は、お馴染みのドロップダウンによるコンテンツ駆動のメニュー・システムを使用して、LaTeX 文書を作成、編集するためのグラフィカルなツールです。TeX とその上位のマクロ言語である LaTeX は、強力な文書マークアップ言語であり、Linux ユーザーの間ではデファクト・スタンダードとなっています。しかし、これらの言語を初めて使用するとなると、使用可能なマークアップ・タグや、それらのマークアップ・タグを使用できるコンテキスト、さらにはテキスト・エディターとプレビュー用のツールの使い方などを知らなければならないため、扱いにくい言語かもしれません。LyX は、この LaTeX 文書を処理するプロセス全体を単純化します。それは、Linux 上での作業に限ったことではありません。Linux、UNIX、Windows、および Mac OS X システムに LyX をインストールして使用する方法、さらにはカスタマイズする方法を学んでください。" }
,{ "title": "Bootstrap を使用した迅速な Web 開発", "category": "opensource", "body": "モバイル対応のものを含め、Web サイトや Web アプリケーションの開発を順調にスタートさせるために Bootstrap を利用する方法を学んでください。LESS プロジェクトをベースにした Bootstrap は、Web アプリケーション UI の一貫したフレームワークを提供することを目的に、Twitter の内部エンジニアたちによって開発されました。" }
,{ "title": "データの視覚化: 第 2 回 D3 のコンポーネント・レイアウトを使用する", "category": "opensource", "body": "この全 2 回からなる連載記事では、SVG (Scalable Vector Graphics) とオープンソースの D3 JavaScript ライブラリーを使用してデータを視覚化する方法を学びます。ビジネスでデータの大きさを把握する上では、形状、色、レイアウトが大いに役立つ場合があります。今回の記事では、D3 による計算と独自の計算の両方を使用して、キャンバス上にグラフィック・コンポーネントを配置してデータを表現するさまざまな方法を実演します。" }
,{ "title": "グラフ・データベース入門: 第 1 回 グラフ・データベースと CRUD 処理", "category": "webservices", "body": "グラフ・データベースに馴染みがないとしたら、グラフ・データベースを使うのは難しすぎると思うかもしれません。グラフ理論の授業を受けたことのある誰もが、この科目はかなり複雑であると断言するでしょう。けれども、グラフ理論の経験 (または、その経験がないこと) を基に、グラフ・データベースを近寄りがたい存在だと思い込まないでください。実際、完全に管理されたサービスとしてのグラフ・データベースを利用すれば、複雑さを抜きにして、グラフ・データベースのあらゆるメリットを手に入れることができます。このチュートリアルは、全 2 回からなるシリーズ「グラフ・データベース入門」の第 1 回です。" }
,{ "title": "グラフ・データベース入門: 第 2 回 グラフ・データベースを使用してレコメンデーション・エンジンを作成する", "category": "webservices", "body": "チュートリアル・シリーズ「グラフ・データベース入門」の第 2 回では、既存のレコメンデーション・エンジンの背後にあるコードを詳しく調べた後、商品のページにお勧めのアイテムを表示する機能を実装します。" }
,{ "title": "RESTful Web サービスの基本", "category": "webservices", "body": "REST (Representational State Transfer) は SOAP ベースや WSDL (Web Services Description Language) ベースの Web サービスに代わる単純な手段として Web 全体で広く受け入れられるようになっています。こうした、インターフェース設計での REST へのシフトの重要な証拠として、Web 2.0 サービスを提供する主要各社 (Yahoo、Google、Facebook など) は SOAP ベースや WSDL ベースのインターフェースを非推奨あるいは不使用とし、使いやすいリソース指向のモデルを使って彼らのサービスを公開するようになっています。この記事では、Alex Rodriguez が REST の基本的な原則を紹介します。" }
,{ "title": "Java クラス・ローダーのメモリー・リークの診断", "category": "webservices", "body": "このチュートリアルでは、クラスおよびクラスのロード・メカニズムの基本概念を説明した後、クラス/クラス・ローダーのリークを生成し、IBM ClassLoader Analyzer を使用して Java ヒープ・ダンプ、Java クラス・トレース、IBM Javacore といったさまざまな成果物の問題を診断します。" }
,{ "title": "異なる形態の Common Information Model", "category": "webservices", "body": "Common Information Model (共通情報モデル: CIM) は一般的に使用されるようになってきており、このモデルが持つ既知の利点を求めて業界内で活用されています。CIM には異なる形態があり、それぞれの形態の特徴や、利点、欠点を理解することが重要です。この記事では、それらの詳細について詳しく説明することで、企業が持つツールや専門的能力に応じて設計者が適切なパターンを選択できるようにします。" }
,{ "title": "Webサービスを開発する: 第 3 回 Apache CXF を使用してファイル・アップロード Web サービスを開発する", "category": "webservices", "body": "このチュートリアルでは、ユーザーから送信されたファイルをアップロードして、特定のディレクトリーに保管する CXF Web サービスを開発する方法を実演します。サンプル・アプリケーションは、広く使用されている Eclipse IDE で開発します。" }
,{ "title": "Web サービスを開発する: 第 1 回 Axis2 を使用して、コード・ファースト手法とコントラクト・ファースト手法で Web サービスを開発する", "category": "webservices", "body": "このチュートリアルでは、Axis2 を使用してコード・ファースト (ボトムアップ) 手法で「Credit Card Validation (クレジット・カード検証)」Web サービスを開発する方法を実演し、さらに Axis2 を使用してコントラクト・ファースト (トップダウン) 手法で「Product Catalog (製品カタログ)」Web サービスを開発する方法についても実演します。Web サービスの開発ではコード・ファースト手法が最もよく使われている一方、新しく Web サービスを構築する場合は、コントラクト・ファースト手法が適切な方法となります。" }
,{ "title": "Web サービスを開発する: 第 2 回 JAX-WS を使用してファイル・ダウンロード Web サービスを開発する", "category": "webservices", "body": "このチュートリアルでは、「Hello User」Web サービスを開発する方法を実演し、さらにJAX-WS を使用して「File Download (ファイル・ダウンロード)」Web サービスを開発する方法についても実演します。そして最後に、「Product Catalog (製品カタログ)」Web サービスを処理する SAAJ (SOAP with Attachments API for Java) クライアントを開発します。" }
,{ "title": "ステートレス・セッション Bean のための Web サービスを Rational Software Architect で作成する", "category": "webservices", "body": "ステートレス EJB セッション Bean のための Web サービスを IBM Rational Software Architect で作成する方法と、Web サービスを Web サービス・テスト・エクスプローラーを使用してテストする方法について学びましょう。" }
,{ "title": "SOA ポリシー", "category": "webservices", "body": "組織はビジネスと IT の両方にとって重要な判断を下すための指針として、ポリシーを使用します。多くの場合、ポリシーは何らかのマイナスの事態が発生した結果として後から作成されます。SOA Policy Reference Architecture には、実務者が先を見越してポリシーを作成して管理する方法が、ポリシーの管理機能や自動化機能を含めて示されています。この記事およびその詳細な添付資料では、ポリシーを定義するためのフレームワークを提供します。最初にビジネスの目標と目的を定義することから始め、組織を適切に統制するために必要なビジネス・ポリシー、アーキテクチャー・ポリシー、オペレーション・ポリシーにビジネスの目標と目的を落とし込む方法について説明します。そして読者が詳細を理解できるように、SOA Policy Reference Architecture を使用してポリシーを分解する方法の例を取り上げます。" }
,{ "title": "SSL (Secure Sockets Layer) と TLS (Transport Layer Security)", "category": "webservices", "body": "この数年、インターネットに接続するコンピューティング機器が爆発的に増えていることから、通信およびコンピューター・システムのセキュリティーは今まで以上に重要になっています。この記事では、セキュア通信の歴史、SSL/TLS プロトコル、ハンドシェイク、ネットワーク層、そして SSL/TLS 接続の検証を簡易化するツールについて学びます。" }
,{ "title": "SOA ガバナンス標準に対する IBM のアドバンテージ", "category": "webservices", "body": "この記事の目的は、SOA ガバナンスを実現するには、なぜ IBM を利用するとよいのか、その理由を説明することです。IBM は、SOA と SOA ガバナンスに関して標準を確立したり、これらに取り組むための適切な方法を確立したりする作業に貢献することで、SOA 業界をリードしてきました。IBM の SOA 業界でのリーダーシップは、SOA Governance Maturity Model の導入によって、この記事を執筆している 2009年の時点でも続いています。IBM では、SOA および SOA ガバナンスを首尾よく実現する上で何が必要であるかを明らかにする作業の支援を行っており、そのための製品やサービスを提供しています。" }
,{ "title": "サービス指向アーキテクチャー (SOA) の標準", "category": "webservices", "body": "サービス指向アーキテクチャー (Service-Oriented Architecture: SOA) は大きな転換をもたらす技術であり、さまざまな企業で使用され、アジリティー、コスト削減、製品化に要する時間の短縮、競争力強化といったビジネス上のメリットを発揮しています。この記事では、サービスが顧客にもたらす成果を高め、相互運用性を実現する上で、いかに SOA ソリューションの標準が重要であるかに焦点を当てています。" }
,{ "title": "クラウドのフェイルオーバー・ポリシーを作成する", "category": "webservices", "body": "先を見越すことで信頼性を高める。多くの組織は相変わらず、障害が発生すると「反応的な」対応をします。反応的ではなく、先を見越した賢明な対策を講じるには、クラウドのフェイルオーバー・ポリシーを作成する必要があり、そのポリシーの中にクラウド固有の付帯条項を含め、ユーザーが制御できる要素とユーザーに許可されるタスクを詳述する必要があります。この記事では、そうしたポリシーを作成するためのロードマップを示し、ポリシーの付帯条項と、障害が発生したときのシナリオのなかで先を見越してどのようなアクションを取ることができるかについて説明します。" }
,{ "title": "SaaS (Software as a Service) アプリケーションのセキュリティー要件を満たす", "category": "webservices", "body": "J2EE (Java 2 Platform Enterprise Edition) ベースの効率的なマルチテナント型 SaaS アプリケーションを実現するためのさまざまなセキュリティー要件について学び、ユーザーの認証と承認をセキュアに行うための要件に対応したメカニズムを探りましょう。" }
,{ "title": "SOA リファレンス・アーキテクチャー標準に対する IBM のアドバンテージ", "category": "webservices", "body": "この記事では、お客様がビジネスならびに IT の柔軟性を向上させるのを支援するために、IBM ではどのように SOA リファレンス・アーキテクチャー (SOA Reference Architecture (SOA RA)) を開発して使用しているのかを説明します。SOA リファレンス・アーキテクチャーは、組織がそれぞれに固有の SOA ビジネスの目標に具体的に従って、高度なビジネス・アジリティーと IT の柔軟性をサービス統合という手段で実現できるようにするために使用されています。IBM では、組織が独自のクラウド・ソリューションを定義できるように、SOA リファレンス・アーキテクチャーをクラウド・リファレンス・アーキテクチャーとも組み合わせて使用しています。" }
,{ "title": "エンタープライズ・サービス・バスのための、USB に似たユニバーサル・ポート・タイプ: 第 3 回 ユニバーサル・ポートのメリット", "category": "webservices", "body": "この連載の第 1 回の記事では、始めにエンタープライズ・サービス・バス (Enterprise Service Bus: ESB) の基本機能について説明し、その後で ESB を使用する上での現在の問題をいくつか紹介しました。連載の第 2 回の記事では、ユニバーサル・ポート・タイプという、ESB のための新しい概念について、またユニバーサル・ポートを実装する方法について説明しました。ユニバーサル・ポートは現在 ESB を使用している人々が経験している多くの問題に対するソリューションとなります。ユニバーサル・ポートは、コンピューターに多様な機器を接続するための USB ポートと役割が似ています。USB ポートと同じように、ユニバーサル・ポートを使用することで任意のアプリケーションを ESB に接続することができ、また間接的に、他のアプリケーションに接続することもできます。それらのアプリケーションは、まったく異なる形式のサービスを使用して機能の一部またはすべてを公開するかもしれませんが、その場合にも 1 つのポート・タイプを使用することができます。連載の第 3 回となる今回の記事では、ユニバーサル・ポートが持つさまざまなメリットについて説明します。" }
,{ "title": "VMControl REST API を使用して仮想サーバーを作成する", "category": "webservices", "body": "IBM の HMC (Hardware Management Console) で論理パーティションを作成する場合、時間がかかる上に、当然ながら PowerVM 技術について一定レベルの技術スキルが必要です。HMC のリモート・コマンド実行機能、また VMControl という REST (Representational State Transfer) Web サービス呼び出しを使用すると、プログラムで論理パーティションを作成して仮想リソースを割り当てることができ、仮想化の管理を単純化することができます。" }
,{ "title": "WebSphere Service Registry and Repository と WebSphere DataPower を使って SOA メッセージ・セキュリティー・ポリシーを施行する", "category": "webservices", "body": "このチュートリアルでは、WebSphere Service Registry and Repository (WSRR) で中央リポジトリーを使用して、SOA メッセージ・フローを管理するためのビジネス・ポリシーを実装し、WebSphere DataPower SOA アプライアンスでそのポリシーを施行する具体的な方法を紹介します。また、WSRR と WebSphere DataPower アプライアンスの両方で必要となる構成手順を詳しく説明します。" }
,{ "title": "Web サービスを開発し、J2ME クライアントからアクセスする", "category": "webservices", "body": "このチュートリアルでは 2 つの単純な例 (「Hello World」サービスと「ログイン」サービス) を用いて、Java 2 Platform で Web サービスを開発し、WebSphere Application Server Community Edition (WASCE) サーバーおよび Tomcat サーバーにデプロイして J2ME クライアントからその Web サービスを呼び出す方法を説明します。Web サービスを開発して WASCE にデプロイする際には Eclipse IDE も使用します。さらに、このチュートリアルではもう 1 つの例として、.NET プラットフォームで開発した (ローカル･ホストではなく) リモート・ロケーションの「株価情報」サービスを J2ME クライアントを使って呼び出す方法も紹介します。" }
,{ "title": "WESB と WSRR V7 の統合方法を示すためのサンプル・アプリケーションの作成", "category": "webservices", "body": "この記事では、WESB と WSRR を導入しようとしている開発者の参考となるように、この 2 つの製品の統合方法を示す単純なソリューションを WID を使って実際に作成する手順を説明します。" }
,{ "title": "Enterprise Expertise Location システムを構築する: 第 2 回、Expertise Locator のソリューション・アーキテクチャー", "category": "webservices", "body": "この記事で話題としているのは、IBM 社内に実装された、その名も興味深い Expertise Locator という Expertise Location システムのソリューション・アーキテクチャーです。この第 2 回では、Expertise Locator システムのユース・ケース・モデル、ソリューション・アーキテクチャー、データ・モデル、そしてアーキテクチャー上の意思決定について取り上げます。" }
,{ "title": "Rational Application Developer を使用して SCA アプリケーションを開発する", "category": "webservices", "body": "この記事では、Rational Application Developer Version 8 使用して SCA アプリケーションを開発する方法と SCA アプリケーションにアクセスする方法について、サンプル・アプリケーションを使用して説明します。" }
,{ "title": "エンタープライズ・サービス・バスのための、USB に似たユニバーサル・ポート・タイプ: 第 2 回 概念、プロセス、そして実装", "category": "webservices", "body": "この連載の第 1 回の記事では、始めにエンタープライズ・サービス・バス (Enterprise Service Bus: ESB) の基本機能について説明し、その後で ESB を使用する上での現在の問題をいくつか紹介しました。この連載の第 2 回となる今回の記事では、ユニバーサル・ポート・タイプという、ESB のための新しい概念について、またユニバーサル・ポートを実装する方法について説明します。ユニバーサル・ポートは現在 ESB を使用している人々が経験している多くの問題に対するソリューションとなります。ユニバーサル・ポートは、コンピューターに多様な機器を接続するための USB ポートと役割が似ています。USB ポートと同じように、ユニバーサル・ポートを使用することで任意のアプリケーションを ESB に接続することができ、また間接的に、他のアプリケーションに接続することもできます。それらのアプリケーションは、まったく異なる形式のサービスを使用して機能の一部またはすべてを公開するかもしれませんが、その場合にも 1 つのポート・タイプを使用することができます。この連載の次回の記事となる第 3 回では、ユニバーサル・ポートが持つさまざまなメリットについて説明します。" }
,{ "title": "Apache HttpClient による Android クライアントを JAX-RS Web サービスに展開する", "category": "webservices", "body": "Apache HttpClient ライブラリーを使用して JAX-RS Web サービスにアクセスしてみましょう。RESTful な Webサービスを作成するには、JAX-RS のリファレンス実装である Jersey を使用すると、 Java 環境で簡単に作成することができます。Androidは人気のスマートフォンです。この記事では、Android による JAX-RS クライアントを作成します。具体的には、Apache HttpClientライブラリーを使用して、JAX-RS Web サービスにアクセスするためのクライアントを作成します。" }
,{ "title": "Apache HttpClient による Android クライアントを JAX-RS Web サービスに展開する", "category": "webservices", "body": "" }
,{ "title": "WebSphere Enterprise Service Bus で大規模なオブジェクトを扱う場合のベスト・プラクティスとチューニング", "category": "webservices", "body": "ミドルウェアを利用していると、大規模なオブジェクトを処理するシステムで最適なパフォーマンスを確実に実現しなければならない事態に直面することがよくあります。一般に、「大規模」とみなされる 1 M 以上のオブジェクトを扱う際には、特別な注意が必要です。この記事では、64 ビットの本番環境で大規模なオブジェクトを効率的に処理する上で、WebSphere Enterprise Service Bus (ESB) V7 製品を最大限に活用するために必要な情報と助言を提供します。" }
,{ "title": "Hibernate を使用するデータベース駆動型の Web サービスを作成し、RESTful な Web サービスをクラウドに実装して Android クライアントとJ2ME クライアントから呼び出す", "category": "webservices", "body": "このチュートリアルでは、Hibernate を使用するデータベース駆動型の Web サービスを作成し、その Web サービスを J2ME クライアントと Android クライアントから呼び出す方法について説明します。そして最後に、RESTful な Web サービスを作成して Google クラウドにデプロイし、それを Android クライアントで利用する方法について説明します。" }
,{ "title": "IBM WebSphere Application Server で Validator for WS-Policy in Eclipse を使用する", "category": "webservices", "body": "Validator for WS-Policy in Eclipse は、WS-Policy 問題のトラブルシューティングを支援するためのプラグインです。Validator for WS-Policy in Eclipse を使って、IBM WebSphere Application Server で使用する WS-Policy の問題をデバッグする方法を学んでください。記事では、独自のスキーマを作成して、このバリデーターを別の WS-Policy アサーションに適用する方法も説明します。" }
,{ "title": "Apache CXF を使用して Web サービス・メッセージのロギングを実行する", "category": "webservices", "body": "アプリケーションの監視やデバッグのツールとしてロギングを使用することができます。この記事では Apache CXF を使用して Web サービス・メッセージのロギングを実行する方法について学びます。この記事で説明するのは、メッセージ・ロギングを実装するさまざまな方法、インターセプターやフィーチャーなど、CXF の重要機能を使用してメッセージ・ロギングを実行する方法、Spring ベースの Bean 構成を使用してメッセージ・ロギングを実行する方法についても説明します。" }
,{ "title": "Web サービスのヒントと秘訣: 匿名型を避ける", "category": "webservices", "body": "匿名の XML 型は Web サービスで問題を起こす場合があります。この記事では、これらの問題について説明し、それを避ける方法を紹介します。" }
,{ "title": "エンタープライズ・サービス・バスのための、USB に似たユニバーサル・ポート・タイプ: 第 1 回 ESB が現在抱えている問題", "category": "webservices", "body": "連載の第 1 回である今回の記事では、始めにエンタープライズ・サービス・バス (Enterprise Service Bus: ESB) の基本機能について説明し、その後で ESB を使用する上での現在の問題をいくつか紹介します。連載の今後の記事では、ユニバーサル・ポート・タイプという、ESB のための新しい概念について説明します。ユニバーサル・ポートは現在 ESB を使用している人々が経験している多くの問題に対するソリューションとなります。ユニバーサル・ポートは、コンピューターに多様な機器を接続するための USB ポートと役割が似ています。USB ポートと同じように、ユニバーサル・ポートを使用することで任意のアプリケーションを ESB に接続することができ、また間接的に、他のアプリケーションに接続することもできます。それらのアプリケーションは、まったく異なる形式のサービスを使用して機能の一部またはすべてを公開するかもしれませんが、その場合にも 1 つのポート・タイプを使用することができます。" }
,{ "title": "IBM WebSphere Process Server または IBM WebSphere Enterprise Service Bus v7.0.0.x での、IBM WebSphere MQ JMS プロバイダーを使用した SOAP over JMS による Web サービス", "category": "webservices", "body": "WebSphere Process Server の V7.0 および WebSphere Enterprise Service Bus の V7.0 で、SIBus JMS プロバイダーではなく、IBM WebSphere MQ JMS プロバイダーを使用して SOAP メッセージを送受信できるように、SOAP over JMS エクスポートおよびインポートの参照先 JNDI (Java Naming and Directory Interface) リソースを変更する方法を学びましょう。" }
,{ "title": "Java ベースの構成を使用して Spring Bean を管理する", "category": "webservices", "body": "Spring Bean の構成には通常、XML による手法が用いられています。この記事では、XML を使用する代わりに Pure Java ベースの構成を使用して Spring Bean を作成および構成する方法を説明します。そのなかで、Spring Bean を構成するために使用できるさまざまなアノテーションについて紹介し、さらには従来の XML ベースの手法と比較しながら、Java をベースに Bean を構成する手法について説明します。" }
,{ "title": "EXPath HTTP Client を使用して Web サービスを扱う", "category": "webservices", "body": "さまざまな XML 技術に共通の拡張機能を定義する EXPath は、明確に定義された関数ライブラリーを使用して簡単に移植可能なアプリケーションを作成できるようにすることを目標とした、コミュニティーの主導による取り組みです。この取り組みによって定義された EXPath HTTP Client モジュールでは、HTTP および HTTPS リクエストの送信を可能にする関数一式を定義しています。この記事では、この EXPath のライブラリーを使用して XSLT と XQuery の両方から HTTP の処理を行う方法について説明します。さらに、XQuery と EXPath HTTP Client モジュールを使用して作成した基本的な HTTP テスターで HTTP リクエストをテストする方法についても説明します。" }
,{ "title": "EXPath HTTP Client を使用して Web サービスを扱う", "category": "webservices", "body": "" }
,{ "title": "Apache CXF と Aegis を使用した Web サービスの開発", "category": "webservices", "body": "Aegis は、Apache CXF Web サービス・フレームワークが標準でサポートしているデータ・バインディング・ツールの 1 つです。データ・バインディングは Java オブジェクトと XML 文書とをマッピングする機能です。この記事では、Aegis を使用して CXF ベースの Web サービスを作成する方法と、その Web サービスのデータ・バインディング要求をカスタマイズする方法について説明します。また、Aegis を使用するメリットについて、さらには Aegis の外部マッピング・ファイルを使用してバインディングをカスタマイズする方法について、特に重点的に説明します。" }
,{ "title": "SugarCRM の REST Web サービスを拡張し、XML を使用する", "category": "webservices", "body": "SugarCRM 5.5 の登場により、Web サービスのフレームワーク全体が強化されました。既存の SOAP のサポートを補完するために REST のサポートが追加されただけではなく、ビジネス・アプリケーションを容易にサポートするために、安全にアップグレードできる形で Web サービスをカスタマイズできるようになりました。SugarCRM の REST Web サービスは、その初期設定では Web サービスとやり取りをするデータ・フォーマットとして、JSON と、シリアライズされた PHP データを使用します。この記事では、SugarCRM のインスタンスでデータを送受信する際のデータ・フォーマットとして XML を追加するのがいかに容易であるかを説明します。" }
,{ "title": "document/literal の wrapped パターンを WSDL の設計に使用する", "category": "webservices", "body": "WSDL (Web Services Description Language) のバインディング・スタイルとしては、RPC スタイルまたは document スタイルのいずれかを選択することができますが、この双方のスタイルの利点を併せ持つものとして document/literal の wrapped パターンを選択することもできます。" }
,{ "title": "Java Web サービス: WS-SecurityPolicy をモデル化して検証する", "category": "webservices", "body": "WS-SecurityPolicy では、WSDL (Web Service Description Language) サービス記述の一部としてセキュリティー構成を定義できるようになっています。WS-SecurityPolicy は強力なツールですが、WS-SecurityPolicy 文書を処理するのは骨の折れる作業になりがちです。というのも WS-SecurityPolicy では、アサーションは正しく構造化されていなければ有効にならず、バージョンの名前空間は一貫していなければならないためです。この記事を読んで、WS-SecurityPolicy 文書を作成するときに犯しがちな間違いを知り、WS-Policy と WS-SecurityPolicy を検証および変換できるように Java でモデル化する方法を学んでください。" }
,{ "title": "クラウド・サービス: リスクを軽減し、可用性を維持する", "category": "webservices", "body": "企業や政府機関は、クラウド・サービスが優れたセキュリティーを講じ、継続的なサービスの運用状態を保つことを要求します。そのようなクラウド・サービスを現実のものにするためには、クラウド・サービスのリスク軽減に関するポリシーを定式化する必要があります。この記事では、まずクラウド・サービスのセキュリティーの概要を説明し、続いてクラウド・サービスが持つリスクを軽減することで、クラウド環境におけるサービスの高可用性 (高い値のアップタイム) と高度なセキュリティーを確保する方法について説明します。" }
,{ "title": "Android から JAX-WS Web サービスにアクセスする", "category": "webservices", "body": "Web サービスは、クライアントの機能に応じたサービスを提供することができるため、モバイル機器には特に適しています。KSoap2-android プロジェクトは Android プラットフォーム用の SOAP ライブラリーです。この記事では、Android クライアントから JAX-WS Web サービスにアクセスします。この Web サービスは WSDL を提供しており、名前を含むリクエストへのレスポンスとして、Hello メッセージを返します。ここでは Android 用の Web サービス・クライアントを Eclipse ADT プラグインと KSoap2-android ライブラリーを使用して作成します。そしてこのWeb サービス・クライアントを AVD (Android Virtual Device) でテストします。名前を引数として Hello Web サービスにリクエストを送信すると、そのレスポンスが Android 仮想デバイス・エミュレーター上に表示されます。" }
,{ "title": "クラウド課金サービス", "category": "webservices", "body": "クラウド課金というのは、あらかじめ規定された一連の課金ポリシーに従って、リソース使用量データを基に請求書を生成するプロセスです。この記事では、サービス指向アーキテクチャーに対応したクラウド課金サービス・モジュールについて説明します。具体的には、機能要件 (見積サービス、変換機能とポリシー、支払方法、ユーザー識別) と、機能要件以外の不可欠な要件 (セキュリティー、スケーラビリティー、標準、フォルト・トレランス) について説明します。" }
,{ "title": "モデル駆動型クラウド・セキュリティー", "category": "webservices", "body": "この記事では、効果的なアプリケーション・セキュリティー・ポリシー・オートメーションを実現する上での課題を詳しく説明し、モデル駆動型セキュリティーがセキュリティー・ポリシー・オートメーションにもたらすメリットを解説した後、クラウド・アプリケーション・セキュリティー・ポリシー・オートメーションを実現する方法を紹介します。" }
,{ "title": "Java Web サービス: WSDL 1.1 を理解してモデル化する", "category": "webservices", "body": "WSDL (Web Services Description Language) 2.0 が W3C (World Wide Web Consortium) 標準として承認されてから数年経った今でも、Web サービスの記述形式として最も広く使用されているのは、WSDL 1.1 です。けれどもその人気の反面、WSDL 1.1 はいくつかの問題を抱えています。例えば、多種多様なスキーマが使用されていること、Web サービス・スタックによって WSDL 文書の処理方法が異なることなどです。この記事では、WSDL 1.1 のサービス記述がどのように構造化されているかを説明し、WSDL 文書を検証して「ベスト・プラクティス」に沿った形に変換する Java ツールの基本構造を紹介します。" }
,{ "title": "Perl、jQuery、Ajax、JSON、MySQL を使用した非常に単純なログイン", "category": "webservices", "body": "この記事では、いくつかの最新技術を使用して実装された非常に単純なログイン手法について説明します。この手法では、スクリプト言語 (Perl)、無料のデータベース (MySQL)、軽量でテキスト・ベースのオープン・スタンダード (JSON)、クロスブラウザーの JavaScript ライブラリー (jQuery)、そして非同期で対話型の Web アプリケーション手法 (Ajax) を組み合わせて使用します。" }
,{ "title": "クラウド環境内のワークロードを分散させる", "category": "webservices", "body": "多くの企業、政府機関は、クラウド・サービスが常時運用状態を保ち、利用可能であると同時にセキュリティーも維持されていることを要求します。そのようなクラウド・サービスを現実のものにするためには、アプリケーションのテストおよび本番アプリケーションに必要なリソースの管理に関するしきい値ポリシーが必要です。この記事では、しきい値ポリシーとは何であるか、そしてしきい値ポリシーを使ってクラウド環境でのワークロードへの要求を動的に分散させる方法を説明します。" }
,{ "title": "Java Web サービス: Web サービス・セキュリティーの現状", "category": "webservices", "body": "WS-Security およびそれに関連する標準では、Web サービス・セキュリティーに対してさまざまなオプションを規定しています。この広範なオプションのうち、Web サービス・スタックでテストするのは限られた数のセキュリティー構成だけです。相互運用性のテストに至っては、さらに少ない構成を独自にテストしているに過ぎません。この記事では、Web サービス・スタック間の相互運用性を促進するために業界がこれまで行ってきた取り組みを説明し、3 つの主要なオープンソースの Java スタックがセキュリティーの問題にどの程度まで取り組んでいるのかを比較して要約します。" }
,{ "title": "Enterprise Expertise Location システムを構築する: 第 1 回、Expertise Location パラダイム、そしてリファレンス・アーキテクチャーの導出", "category": "webservices", "body": "企業はその規模を問わず、ビジネス問題の解決や、販売機会の支援、単純な質問に対する回答などのために、社内の専門家をうまく活用しなければなりません。この記事では、企業全体で専門性の所在を明らかにする Enterprise Expertise Location に SOA パターンを適用して、そのリファレンス・アーキテクチャーを導き出す方法を説明します。記事の第 2 回では、ソリューション・アーキテクチャー、データ・モデル、そしてアーキテクチャー上の重要な意思決定について取り上げます。" }
,{ "title": "Java Web サービス: WS-Policy について理解する", "category": "webservices", "body": "WS-Policy は、Web サービスに適用する機能とオプションを構成するための汎用構造を提供します。皆さんは、この連載の WS-Security 構成で使用されている例の他、WS-ReliableMessaging などの他の拡張技術でも WS-Policy を目にしたことがあるでしょう。今回の記事では、WS-Policy 文書の構造、そして WSDL (Web Service Description Language) でポリシーをサービスに関連付ける方法を説明し、サンプルのセキュリティー構成を Apache Axis2、Metro、Apache CXF のそれぞれで試します。" }
,{ "title": "高度なワークフロー・パターンを WebSphere Integration Developer と WebSphere Process Server で実装する: 第 4 回 状態に基づくパターン、完了パターン、トリガー・パターン", "category": "webservices", "body": "Workflow Patterns Initiative は、企業がワークフローをモデル化するときに広く使用、あるいは参照されていますが、その最新の 43 のワークフロー・パターンは、あらゆる種類の BPEL エンジンに大きな課題を投げかけています。WebSphere Process Server (WPS) は、パフォーマンスに優れた強力なビジネス・プロセス自動化エンジンです。WPS と WebSphere Integrated Developer (WID) を使うことで、ユーザーはそのワークフロー・パターンを簡単に実装することができます。この記事では、最新の WebSphere Integrated Developer V7.0 と WebSphere Process Server V7.0 は Workflow Patterns Initiative の43 のパターンをすべて実装できるだけでなく、簡単に実装できることに焦点を当てます。" }
,{ "title": "高度なワークフロー・パターンを WebSphere Integration Developer と WebSphere Process Server で実装する: 第 3 回 高度な分岐および同期合成パターン", "category": "webservices", "body": "Workflow Patterns Initiative は、企業がワークフローをモデル化するときに広く使用、あるいは参照されていますが、その最新の 43 のワークフロー・パターンは、あらゆる種類の BPEL エンジンに大きな課題を投げかけています。WebSphere Process Server (WPS) は、パフォーマンスに優れた強力なビジネス・プロセス自動化エンジンです。WPS と WebSphere Integrated Developer (WID) を使うことで、ユーザーはそのワークフロー・パターンを簡単に実装することができます。この記事では、最新の WebSphere Integrated Developer V7.0 と WebSphere Process Server V7.0 は Workflow Patterns Initiative の43 のパターンをすべて実装できるだけでなく、簡単に実装できることに焦点を当てます。" }
,{ "title": "高度なワークフロー・パターンを WebSphere Integration Developer と WebSphere Process Server で実装する: 第 2 回 複数インスタンス・パターンと繰り返しパターン", "category": "webservices", "body": "Workflow Patterns Initiative は、企業がワークフローをモデル化するときに広く使用、あるいは参照されていますが、その最新の 43 のワークフロー・パターンは、あらゆる種類の BPEL エンジンに大きな課題を投げかけています。WebSphere Process Server (WPS) は、パフォーマンスに優れた強力なビジネス・プロセス自動化エンジンです。WPS と WebSphere Integrated Developer (WID) を使うことで、ユーザーはそのワークフロー・パターンを簡単に実装することができます。この記事では、最新の WID V7.0 と WPS V7.0 では 43 すべてのパターンを実装できるというだけでなく、いかに簡単にワークフロー・パターンを実装できるようにしているかを明らかにします。" }
,{ "title": "高度なワークフロー・パターンを WebSphere Integration Developer と WebSphere Process Server で実装する: 第 1 回 基本的な制御フロー・パターンと、キャンセルおよび強制終了パターン", "category": "webservices", "body": "Workflow Patterns Initiative は、企業がワークフローをモデル化するときに広く使用、あるいは参照されています。この 4 回からなる連載記事では、高度なワークフロー・パターンを WebSphere Integration Developer と WebSphere Process Server で実装する方法を説明します。" }
,{ "title": "サービス指向アーキテクチャー環境でパッケージ・アプリケーションを選択するための基準", "category": "webservices", "body": "パッケージ・アプリケーションを選択する場合、単に機能を満たせるかどうかを検証するだけでは十分ではありません。ビジネスの高い目標を達成するためには、機能以外にも満たさなければならない重要な要件があります (例えば、ビジネス・アジリティーや、ソリューションの市場投入までの時間など)。しかし、機能以外の領域での要件を明確に定義しようとすると困難なことが多いものです。この記事では、機能以外のビジネス要件も考慮した上でパッケージを選択する基準を作るための、基本的な考え方について説明します。" }
,{ "title": "SOA の実践: BPEL および SCA でのケース･スタディー", "category": "webservices", "body": "サービス指向アーキテクチャー (SOA) と SOA プログラミング・モデルは、真のアジリティー、そして IT とビジネスとの緊密な連携を実現する可能性を秘めています。しかし、本当の意味でのサービス指向ソフトウェアを開発するためには、実際にはどのようにすればよいのでしょうか？この記事では、少人数のアーキテクトと開発者からなるチームが、WebSphere Business Modeler でモデル化したビジネス・プロセスをベースに、一から SOA アプリケーションを構築していく過程を詳しく追っていきます。記事ではまず、設計・開発プロセスについてサービス指向の設計とデータ・モデリングに関する考慮事項と併せて説明します。続いてプロジェクトで実装した 1 つのビジネス・プロセスを詳しく調べ、WebSphere Integration Developer を使用して BPEL プロセスと SCA サービス・コンポーネントを開発する手法を説明します。" }
,{ "title": "BPM と Webform の統合: Lotus Webform Server を使用したビジネス・スペースでのヒューマン・タスク (第 3 回)", "category": "webservices", "body": "連載第 3 回目となるこの記事では、プロジェクト・ライフサイクルのモデルおよび統合開発に焦点を絞り、ビジネス・アナリストと IT 開発者が Lotus フォームを構成して検証するための環境を構築する方法を紹介します。開発およびテスト・ツールをインストールして構成するための手順を、以下の 3 つの使用ケースのシナリオに沿って具体的に説明します。これらのシナリオは、IBM のお客様が BPM 製品を新しくインストールする際に最もよく使用する導入パターンを表します。" }
,{ "title": "BPM と Webform の統合: Lotus Webform Server を使用したビジネス・スペースでのヒューマン・タスク (第 1 回)", "category": "webservices", "body": "今日の企業は経営効率における数々の問題に直面しています。特に、協調的な取り組みが欠けていることから、必要以上に煩雑になっているビジネス・プロセスが組織内には数多くあります。そこで、ヒューマン・タスクと自動化されたサービスを組み合わせて適切なオーケストレーションを行った一連のビジネス・プロセスを開発することで、企業は経営の合理化と無駄の削減を行い、競合他社との差別化を図れるようになるはずです。" }
,{ "title": "BPM と Webform の統合: Lotus Webform Server を使用したビジネス・スペースでのヒューマン・タスク (第 2 回)", "category": "webservices", "body": "この記事では、標準フォーム・ユーザー・インターフェース技術の 1 つとして選ばれている Lotus Webform Server を BPM 製品スイートに統合する方法を説明します。" }
,{ "title": "Spring 3 MVC の HttpMessageConverter 機能を使って RESTful な Web サービスを作成する", "category": "webservices", "body": "この記事では、HttpMessageConverter を使用して多様な表現を作成する方法を説明し、RestTemplate を HttpMessageConverter と組み合わせることでサービスと通信する方法の例を紹介します。" }
,{ "title": "SOA ベースの統合環境で共通情報モデル (CIM) が持つさまざまな様相", "category": "webservices", "body": "サービス指向アーキテクチャー (SOA: Service Oriented Architecture) ベースのアーキテクチャー・スタイルは、共通情報モデル (CIM: Common Information Model) を組み合わせると複雑になってきます。これは、統合のためにデータ要素を追加で組み込んだり、サービス・コンポーネントがビジネス・ロジックを実行するために必要となる要素を組み込んだりと、さまざまな理由から実際には設計者が CIM を拡張しなければならないためです。このような拡張によってコアとなる CIM にどのような影響が及ぼされるかを理解すれば、CIM を容易に管理できるようになります。この記事ではコア CIM および拡張 CIM に関するさまざまな側面を説明します。" }
,{ "title": "Java Web サービス: クライアント証明書を使用しない WS-Security", "category": "webservices", "body": "クライアントとサーバーの間でクライアント証明書を使わなくてもセキュアなメッセージ交換を行えるようにする WS-Security の対称暗号化は、Web サービス構成を単純化すると同時に、パフォーマンスにもメリットをもたらします。この暗号化手法はそのまま使用することも、WS-SecureConversation メッセージ交換のブートストラップで使用することもできます。この記事では、Axis2、Metro、CXF という代表的な 3 つのオープンソースの Java Web サービス・スタックを例に、対称暗号化を構成して使用する方法を説明します。さらに、基本的な WS-Security 対称暗号化のパフォーマンスを WS-SecureConversation のパフォーマンスと比較します。" }
,{ "title": "Spring 3 を使って RESTful な Web サービスを作成する", "category": "webservices", "body": "Java の世界では、さまざまな方法で RESTful な Web サービスを作成することができます。JSR 311(JAX-RS) とそのリファレンス実装である Jersey を使用する人もいれば、Restlet フレームワークを使用する人、さらにはゼロの状態から実装する人もいるかもしれません。Java EE アプリケーションを作成するためのフレームワークとしてよく知られた Spring は、今や MVC レイヤーで REST をサポートしています。この記事では、RESTful な Web サービスを Spring を使って作成する方法について紹介します。Spring の API とアノテーションを使用して RESTful な Web サービスを作成する方法について、また Spring がどのような形でこの新機能を元の Spring フレームワークにシームレスに統合しているかについて学びましょう。" }
,{ "title": "CBM-SOMA を利用して RCM (Resource and Capacity Management) センターに最新の技術を取り入れる手法", "category": "webservices", "body": "この記事で取り上げるのは、IT システムの変換を支援する RCM (Resource and Capacity Management) のビジネス業務とプロセスです。この記事で説明する手法によって、SOA を使用したエンド・ツー・エンドの自動ビジネス・プロセスを実現する際に、現在の資産とツールに手を加えて統合できるようになります。RCM センターを企業の視点で検討した私たちは、ビジネス・コンポーネント・モデルを構築して重要なコンポーネントを特定し、SOA ソリューションによる階層型エンタープライズ・アーキテクチャー・モデルを開発しました。ビジネス・サービスを識別し、候補となる IT サービスに変換する方法としては、SOMA のサービス識別および分析手法を適用します。この事例研究では、既存の RCM IT システムとそのビジネス業務に最新の技術を取り入れる上で IBM が適用している CBM-SOMA 方法論と IBM SOA ソリューションの例も紹介します。" }
,{ "title": "WSS4J/Axis2 API を使う: 第 2 回、WS-Security によって署名、暗号化された MTOM/XOP 対応の添付ファイルを Axis2/Rampart Web サービスに送信する", "category": "webservices", "body": "この連載記事の第 1 回では、WS-Security によって署名、暗号化された SOAP メッセージを WSS4J/AXIS2 API を使って送信する方法について説明しました。今回の記事では、WS-Security によって署名、暗号化された MTOM/XOP 対応の SOAP メッセージを WSS4J/AXIS2 API を使って送信する方法について説明します (MTOM: Message Transmission Optimization Mechanism、XOP: XML-binary Optimized Packaging)。" }
,{ "title": "ルール・ベースの決定サービスを Web サービスとして実現する", "category": "webservices", "body": "JRules を利用すると、決定サービスを Web サービスとして公開することができますが、その際に新たなコーディングをする必要がありません。この記事では、ビジネス決定サービスを Web サービスとして公開し、ビジネス・ルールのアジリティーと SOA の柔軟性とを組み合わせる方法について説明します。ここで説明する方法は、SOA 対応の他の製品にも容易に統合することができます。" }
,{ "title": "Java Web サービス: WS-SecureConversation のパフォーマンス", "category": "webservices", "body": "WS-SecureConversation によって、進行中の Web サービス・メッセージ交換を単純な WS-Security よりも少ない処理オーバーヘッドでセキュアにすることができます。この記事では、Apache Axis2、Metro、Apache CXF という代表的な 3 つのオープンソースの Java Web サービス・スタックで WS-SecureConversation を構成して使用する方法を説明します。さらに、この 3 つのスタックで WS-SecureConversation を使用した場合のパフォーマンスの違いを調べます。" }
,{ "title": "REST、Web サービス、そして RESTful なサービス", "category": "webservices", "body": "最近ではバックエンドのエンタープライズ・サービスに統合する Web サービスとして、SOAP よりも REST ベースの Web サービスが選ばれることが次第に多くなってきています。その理由は、REST の単純さです。この記事では、Java ビジネス・サービスを REST 風のサービスとして公開する、単純で拡張可能なフレームワークを提案し、その設計について詳細に説明します。さらに、このフレームワークを拡張するさまざまな手法についても探っていきます。" }
,{ "title": "クラウド・コンピューティング ― 企業戦略を推進するプラットフォーム", "category": "webservices", "body": "この記事では企業活動に関連したクラウド・コンピューティングの概念に焦点を当てます。この記事の中では、企業にとってのクラウド・コンピューティングの重要性、クラウド・コンピューティングの方法論、クラウド・コンピューティングの効率、クラウド・コンピューティングによる長期的な影響、そして最後にクラウド・コンピューティングのインフラストラクチャーについて説明します。" }
,{ "title": "Jt - Java パターン指向フレームワーク", "category": "webservices", "body": "Jt は Java アプリケーションを迅速に実装するためのデザイン・パターン・フレームワークです。Jt フレームワークのアーキテクチャーはメッセージング・デザイン・パターンに基づいています。メッセージング・デザイン・パターンは、SOA 機能や ESB 機能の他、多くの有名なデザイン・パターンの実装に使われています。" }
,{ "title": "Java Web サービス: WS-Trust と WS-SecureConversation", "category": "webservices", "body": "WS-Security は、SOAP メッセージ交換にエンタープライズ・レベルのセキュリティー機能を追加しますが、同時にパフォーマンス面でかなりの犠牲を伴います。WS-Trust は、WS-Security をベースとしてセキュリティー・トークンを交換するための手段です。そして WS-SecureConversation は WS-Security と WS-Trust をベースに、進行中のメッセージ交換のパフォーマンスを改善します。今回の連載「Java Web サービス」では、Dennis Sosnoski が WS-Trust と WS-SecureConversation を紹介します。" }
,{ "title": "Web サービスの SOAP メッセージの検証", "category": "webservices", "body": "この記事では Web サービスの歴史とその基礎となる技術について説明した後、ボトムアップ開発方式の Web サービスを構築します。また Web Services Validation Tool for WSDL and SOAP を使って SOAP メッセージを送信、受信する手順、暗号化を解除して検証する手順、さらに SOAP メッセージのデジタル署名を検証する手順を紹介します。そして最後に実際の Web サービスとして、米国国立気象局の Web サービスを Web Services Validation Tool for WSDL and SOAP を使って詳しく調べます。" }
,{ "title": "Web サービスと Ajax とを組み合わせて使う", "category": "webservices", "body": "Web サービスは、言語やプラットフォームに依存しない形で機能を公開するための優れた手段です。Ajax (Asynchronous JavaScript and XML) は、現在の Web ページで新たなリクエストを呼び出さずに別リソースのコンテンツにアクセスするための技術的な手段です。この 2 つを組み合わせることで、最新の技術を活用して高度なユーザー・エクスペリエンスを提供する、強力なアプリケーションを作成することができます。" }
,{ "title": "Zend Framework を使って SOAP サービスを実装する", "category": "webservices", "body": "Zend Framework は、堅牢でスケーラブルな PHP Web アプリケーションを構築できる MVC 準拠のフレームワークです。このフレームワークに組み込まれた Zend_Soap コンポーネントを使うことで、開発者は素早く効率的に SOAP ベースの Web サービスをアプリケーションに追加することができます。この記事では Zend_Soap コンポーネントの詳細を探り、SOAP Web サービスを作成する手順を説明するとともに、入力の検証、エラーの生成、WSDL の自動作成などの機能を探ります。" }
,{ "title": "pureXML と JSON に対応したアプリケーションを構築する: 第 2 回 JSON を公開する pureXML 対応の Universal Services を作成する", "category": "webservices", "body": "pureXML Universal Services for JSON (この記事では以降、JSON Universal Services とします) は、挿入、更新、削除、照会をはじめとするデータベース操作の一式であり、Web サービスとして公開されます。アプリケーションはこれらのサービスを利用することにより、pureXML で JSON を永続化し、その JSON に対してクエリーを実行することが WebSphere Application Server と HTTP を介して容易に行えるようになります。この記事で説明する手順に従って、JSON Universal Services を構成し、テストしてください。" }
,{ "title": "Java Web サービス: CXF のパフォーマンス比較", "category": "webservices", "body": "Apache CXF のベースとなっているコンポーネントは Apache Axis2 および Metro とある程度共通していますが、CXF はこの 2 つとは全く異なるアーキテクチャーでコンポーネントを構成しています。Dennis Sosnoski の連載「Java Web サービス」では今回、CXF、Metro、そして Axis2 の各スタックのパフォーマンスを WS-Security を使用した場合と使用しない場合の両方で比較します。" }
,{ "title": "Jackson JSON プロセッサーと Apache Wink を組み合わせて使う", "category": "webservices", "body": "Apache Wink は急速に JAX-RS 1.0 仕様のデファクト実装の 1 つになりつつあります。JSON へのマーシャリング/JSON からのアンマーシャリング用として、標準的な Apache Wink ディストリビューションには JSON.org や Jettison などのプロバイダーが含まれていますが、これらのプロバイダーは配列の表現に少し問題があると同時に、戻り型が制限されています。そのため、JAX-RS サービスのコーディングや、JAX-RS サービスのクライアントとしての Ajax (Asynchronous JavaScript and XML) アプリケーションのコーディングは簡単ではありません。この記事では、JSON プロバイダーとして Jackson を使うように既存の Apache Wink 対応 Web アプリケーションを構成し、いくつかの問題を解決する方法について学びます。一例として Jackson 対応の簡単な JAX-RS Web サービスのサンプル・コードを使用し、Jackson プロバイダーの長所について説明します。" }
,{ "title": "自動インターフェース・テスト・フレームワーク", "category": "webservices", "body": "自動化されたインターフェースのテストは、手動でテストする場合に生じる矛盾を軽減します。コードが変更されるたびにリグレッション・テストによってコードを保証するにはインターフェースのテストを包括的に行うことが極めて重要となりますが、テストを手動で行うのでは、すべてのテスト・ケースを完全にはテストしきれないものです。この記事で紹介するフレームワークは、サービス指向インテグレーション・ソリューション用の自動インターフェース・テストを作成するための基礎となります。" }
,{ "title": "TXSeries for Multiplatforms で Web サービスを使用し、構成する方法", "category": "webservices", "body": "この記事では、TXSeries で Web サービスを使用する方法を説明します。最初にこの記事で頻繁に使われる用語 (Web サービスや TXseries など) の基本的な定義をした上で、TXseries における Web サービスのアーキテクチャーと、サービスとしてそのままの形でデプロイできる、記事に付属のサンプルについて説明します。その後、コマンドラインまたは Java API モードを使用して成果物を生成し、構成する方法を手順に沿って案内します。最後に、RDZ を使用して WSBind、WSDL、およびログ・ファイルを生成する方法も説明します。" }
,{ "title": "Java Web サービス: CXF での WS-Security", "category": "webservices", "body": "Apache CXF Web サービス・スタックでは、WS-SecurityPolicy を使用したセキュリティー処理の構成を含め、WS-Security をサポートしています。CXF では、セキュリティー処理を実装するために実行時に使用されるデプロイメント・パラメーターを柔軟に構成することができ、クライアント・サイドでは静的構成オプションと動的構成オプションの両方がサポートされます。連載「Java Web サービス」の今回の記事では、著者の Dennis Sosnoski が単純な UsernameToken WS-Security の場合、そして署名および暗号化を使用する場合を例に、CXF の使い方を説明します。" }
,{ "title": "ポリシーとルール – ビジネス・アジリティーを高める: 第 1 回 ビジネス・アジリティーのサポート", "category": "webservices", "body": "最近のビジネス・ソリューションでアジャイルなシステムを設計し、実装する上で問題となるのは、ポリシーとルールという言葉の使い方が製品によって異なることです。連載第 1 回では、特定のビジネス戦略と戦術を実装するためのポリシーとルールに関して、その概念と関係を学びます。" }
,{ "title": "ポリシーとルール – ビジネス・アジリティーを高める: 第 2 回 ポリシーとルールの使用によってもたらされる価値の実証", "category": "webservices", "body": "この記事では、最近のビジネス・アプリケーションでビジネス・ポリシー (方針) とビジネス・ルール (規則) を利用および再利用するための協調的技術戦略を推奨します。ビジネス戦略、ビジネス戦術、そして業界の規制は頻繁に変わるため、この第 2 回ではビジネス・アジリティーを実現することによってビジネスにもたらされる価値、およびアジリティーを全体的なガバナンスの柱として組み込む方法に焦点を当てます。この目標を達成するため、第 2 回では具体的な例を用いて第 1 回で行った主張を実証します。アジャイルな考え方の練習だと思って、第 1 回または第 2 回のどちらか、あるいは両方を読んでください。" }
,{ "title": "RESTful な Web サービスを Java 技術で作成する", "category": "webservices", "body": "JAX-RS (JSR-311) は Java による RESTful なサービスを素早く容易に作成できる Java API です。この API には分散リソースを記述するためのアノテーション・ベースのモデルが用意されています。アノテーションを使用すると、リソースの場所、リソースの表現、そしてプラガブルなデータ・バインディング・アーキテクチャーを指定することができます。この記事では、どのように JAX-RS を使用すれば Java EE 環境で RESTful なサービスのアーキテクチャーによる可能性を実現できるかについて説明します。" }
,{ "title": "イベント処理システムの概念モデル", "category": "webservices", "body": "この記事では、イベント処理の概念モデルを紹介します。基礎をなすイベント処理ネットワーク、および関連するイベント処理の概念アーキテクチャーを説明し、イベント処理アーキテクチャーの概念ビュー、および有用なイベント処理システムを構築するために必要となる主要なコンポーネントを明らかにします。" }
,{ "title": "Java Web サービス: CXF の紹介", "category": "webservices", "body": "Apache CXF Web サービス・スタックは、JAXB 2.x データ・バインディング (およびそれに代わるその他のデータ・バインディング) および JAX-WS 2.x サービス構成をサポートしています。以前の記事で紹介した JAXB/JAX-WS と同様に、CXF では XML ファイルを使用して JAX-WS の構成情報を拡張します。この記事では、連載「Java Web サービス」の著者である Dennis Sosnoski が、CXF を使ってクライアントおよびサーバーの開発を行う際の基本事項を説明します。" }
,{ "title": "Java Web サービス: Metro と Axis2 のパフォーマンス比較", "category": "webservices", "body": "Metro Web サービス・スタックと Axis2 スタックが提供する機能は同じです。けれども、Axis2 ではオプションで JAXB および JAX-WS を使用できることを除けば、この 2 つが使用する関連技術の実装はまったく異なります。Dennis Sosnoski の連載「Java Web サービス」では今回、Metro スタックと Axis2 スタックのパフォーマンスの違いを、WS-Security を使用した場合と使用しない場合の両方で比較します。" }
,{ "title": "WebSphere Application Server V7 での JAX-WS 2.1 による WS-Addressing のサポート", "category": "webservices", "body": "IBM WebSphere Application Server V7 には JAX-WS (Java API for XML-Based Web Services) 2.1 仕様のサポートが組み込まれています。JAX-WS 2.1 は、JAX-WS 2.0 仕様で提供されている機能をさまざまな新機能で拡張する JSR (Java Specification Request) 224 のメンテナンス・リリースです。これらの新機能の中で最も重要な機能としては、API (Application Programming Interface) での WS-Addressing (Web Services Addressing) のサポートが挙げられます。この記事では、新しく追加された WS-Addressing のサポートを使用する方法を説明するとともに、この新機能によって Web サービスの開発者がステートフルな Web サービスを容易に作成できるようになる仕組みについても解説します。" }
,{ "title": "BPEL で作成したヒューマン・タスクを JSF を使って操作する", "category": "webservices", "body": "この記事では WebSphere Integration Developer 6.1 を使って、BPEL でヒューマン・タスクを作成し、JSF で Web ベースのユーザー・インターフェースを作成する方法を 1 つの事例で説明します。また、JSF を使って WebSphere Process Server の Business Process Choreographer Explorer の機能を提供し、ビジネス・プロセス・フローを操作する方法も説明します。そして最後に、BPEL で作成したヒューマン・タスクをユーザーにとって容易な方法で操作するための、カスタマイズされた Web インターフェースを提供する方法についても説明します。" }
,{ "title": "InfoSphere DataStage XMLおよび Web サービス・パックを使用したデータの変換と統合", "category": "webservices", "body": "IBM InfoSphere™ DataStage® XML および Web サービス・パックは、XML および Web サービスが含まれる環境において迅速なデータ統合ソリューションの提供を支援する DataStage のコンポーネントです。DataStage Web サービスおよび XML パックの主な機能と操作を詳しく調べてみましょう。データの変換および統合の方法を学び、これら 2 つのパックを使用した Google 検索の Web サービスを実現します。本資料では 4 つの例を上げ、それぞれに簡単な概要、詳細なステップ、説明、および図が付けられています。" }
,{ "title": "J2ME の PIM (Personal Information Management) の概要", "category": "webservices", "body": "JSR 75 によって定義されている PIM (Personal Information Management) API を利用すると、アドレス帳、タスク・リスト、予定表など、モバイル機器上にあるネイティブの個人データにアクセスすることができます。この記事では、PIM API を詳細に調べ、PIM MIDlet の作成、セキュリティー、デプロイメントに関する考慮事項について説明します。また、もう 1 つの J2ME API である RMS (Record Management Store) と PIM とを比較します。" }
,{ "title": "Java Web サービス: Metro での WS-Security", "category": "webservices", "body": "Metro Web サービス・スタックは JAXB 2.x および JAX-WS 2.x Java 標準のリファレンス実装をベースとしていますが、WS-* SOAP 拡張技術全般に対するサポートも組み込まれています。Dennis Sosnoski の連載「Java Web サービス」の今回の記事では、Metro での WS-Security の構成とその使用方法について説明します。" }
,{ "title": "ESB をテストするためのベスト・プラクティス", "category": "webservices", "body": "この記事の目的は、ESB (Enterprise Service Bus) の機能テストの方法とパフォーマンス・テストの方法を紹介することです。このテストの方法は、実際の顧客のプロジェクトの例を基にまとめたものであり、実証済みの方法です。" }
,{ "title": "WSS4J/Axis2 API を使う: 第 1 回、WS-Security の署名と暗号化プロファイルを Axis2/Rampart の Web サービスに送信する", "category": "webservices", "body": "Web サービスがセキュアに通信するために、また通信されるデータの正しさを保証するために、WS-Security 仕様ではいくつかのセキュリティー・プロファイルを規定しています。それらを使用することで、データの否認防止やデータの暗号化、ユーザー認証などを実現することができます。この記事では、WS-Security のプロファイル (UsernameToken、Timestamp、Signature、Encryption など) をどのようにして SOAP メッセージ・ヘッダーに含めて指定できるようにするのか説明します。" }
,{ "title": "pureXML と JSON に対応したアプリケーションを構築する: 第 3 回 pureXML 対応の OpenSocial ガジェットの作成", "category": "webservices", "body": "OpenSocial ガジェットの Web 2.0 技術を利用すれば、開発者は簡単に、iGoogle や MySpace、そして Hi5、LinkedIn などの人気の高い Web サイトに自分のアプリケーションを組み込むことができます。この記事で DB2 の pureXML 機能を使用したアプリケーションを作成しながら、OpenSocial ガジェットの詳細を学んでください。今回が最終回となるこの 3 回からなる連載では、OpenSocial 対応のあらゆる Web サイトにデプロイできるガジェットをユーザー・インターフェースとして備えた pureXML アプリケーションを構築する方法を説明しています。この記事で説明する手順に従えば、第 1 回目の記事で説明した JSON データを、第 2 回目の記事で作成した JSON Universal Services を使用して保管、取得するユーザー・インターフェースを作成することができます。" }
,{ "title": "pureXML と JSON に対応したアプリケーションを構築する: 第 3 回 pureXML 対応の OpenSocial ガジェットの作成", "category": "webservices", "body": "" }
,{ "title": "Java Web サービス: Metro の紹介", "category": "webservices", "body": "Metro Web サービス・スタックは、Web サービスを実装したり、Web サービスにアクセスしたりするための包括的なソリューションを提供します。そのベースとなっているのは JAXB 2.x および JAX-WS 2.x Java 標準のリファレンス実装であり、この実装に WS-* SOAP 拡張技術と実際の Web サービス・デプロイメントをサポートするためのコンポーネントが追加されています。Dennis Sosnoski の連載「Java Web サービス」では今回、この Metro のクライアントおよびサーバー開発の基本原則を取り上げます。" }
,{ "title": "JSF、Web サービス、OJB を使用した CRUD 操作", "category": "webservices", "body": "この記事では、WebSphere Integration Developer バージョン 6.1で、JSF、Web サービス、OJB を使用して追加、更新、検索、削除を行う方法について説明します。またこの記事では、ユーザー・インターフェース・レイヤーとサービス･レイヤー、そしてデータベース・レイヤーを作成するためのステップについて、各レイヤー同士を統合する方法を含めて説明します。" }
,{ "title": "企業システムでも使われるウィジェット技術: 第 1 回 IBM 共通のウィジェット技術 iWidget", "category": "webservices", "body": "本連載では、ウィジェット関連の技術動向についてご紹介していきます。第1回となる本稿ではユーザー・インターフェースにおいてウィジェットの果たす役割と価値を整理した上で、コードを交えてIBMが取り組むiWidget仕様に基づいたアプリケーションの仕組みを解説します。" }
,{ "title": "Spring フレームワークを利用して行う SCA コンポーネントの設計と開発: 第 1 回 Spring、SCA、そして Apache Tuscany の 3 点セット", "category": "webservices", "body": "この「Spring フレームワークを利用して行う SCA コンポーネントの設計と開発」シリーズでは、SCA (Service Component Architecture) と Spring フレームワークとを効果的に組み合わせ、分散サービス・アプリケーションを作成する方法を学びます。第 1 回の今回は、SCA とSpring とを組み合わせるメリットについて概説します。Spring フレームワークを使って SCA コンポーネントを設計、作成する方法、Spring Bean を SCA サービスとして公開する方法、そして Spring アプリケーションの中で SCA のサービスとプロパティーにアクセスする方法を学びましょう。この記事で紹介する例では、Apache Tuscany SCA Java 技術ランタイムを使用します。" }
,{ "title": "規模の大小よりもニーズの大小に対応する - IBM のパブリッククラウド戦略", "category": "webservices", "body": "IBMのクラウド戦略としては、プライベートクラウド環境であるIBM Research Compute Cloud（RC2）や、IBMのデータセンターのコンピュータリソースをオンデマンドで利用するIBM CoD（Computer on Demand）などが挙げられるが、Amazon EC2（Amazon Elastic Compute Cloud）といったオープン系のパブリッククラウドサービスでもDB2やWebSphere Application Server（以下、WAS）などを利用できるようになっているのをご存じだろうか。" }
,{ "title": "IBM Watson を利用して言語翻訳機能をアプリケーションに追加する", "category": "web", "body": "IBM Cloud アプリケーションに、言語翻訳機能を追加してください。このチュートリアルでは、Node-RED と Language Translation サービスを利用して、ユーザーが入力したテキストを翻訳し、そのテキストを基にセンチメント分析を実行するアプリケーションを作成します。" }
,{ "title": "HTTP/2 の内幕", "category": "web", "body": "1996 年以来の初の HTTP プロトコルのメジャー・アップデートである HTTP/2 は、開発者たちがそれまで 20 年間にわたって積み重ねてきた進歩と発見を正式な形にしたものです。HTTP/2 がリッチな Web アプリケーションをさらに充実させることを目的に、転送パフォーマンスを改善し、待ち時間を短縮し、アプリケーションのスループット向上を促す仕組みを学んでください。" }
,{ "title": "マイクロサービス入門", "category": "web", "body": "このチュートリアルでは、マイクロサービスによって、クラウド・アプリケーションがより管理しやすくなるとともに、アプリケーションのスケーラビリティーと信頼性が向上する仕組みを説明します。クラウド・アーキテクチャーにおけるマイクロサービスの役割を概説し、マイクロサービス・ベースのシステムと従来型のモノリシックなモデルを比較対照します。" }
,{ "title": "Node-RED: bot 操作の基礎: コースの概要", "category": "web", "body": "音声からテキストへの変換、トーンの分析、別の言語へのテキスト翻訳、Twitter 経由でのツイートの送信、音声機能とビデオ機能の追加、および IBM Watson Conversation サービスと Facebook Messenger を使用したチャット・ボットのセットアップを行う方法を、実地体験を通じて学習します。プログラミング経験も必要ありません。" }
,{ "title": "Node-RED: bot 操作の基礎: まとめ", "category": "web", "body": "音声からテキストへの変換、トーンの分析、別の言語へのテキスト翻訳、Twitter 経由でのツイートの送信、音声機能とビデオ機能の追加、および IBM Watson Conversation サービスと Facebook Messenger を使用したチャット・ボットのセットアップを行う方法を、実地体験を通じて学習します。プログラミング経験も必要ありません。" }
,{ "title": "Node-RED: bot 操作の基礎: ラボ 4: コグニティブな Web ページと Messenger ボットの作成", "category": "web", "body": "音声からテキストへの変換、トーンの分析、別の言語へのテキスト翻訳、Twitter 経由でのツイートの送信、音声機能とビデオ機能の追加、および IBM Watson Conversation サービスと Facebook Messenger を使用したチャット・ボットのセットアップを行う方法を、実地体験を通じて学習します。プログラミング経験も必要ありません。" }
,{ "title": "Node-RED: bot 操作の基礎: ラボ 3: コミュニティー・ノードと Watson サービスの追加", "category": "web", "body": "音声からテキストへの変換、トーンの分析、別の言語へのテキスト翻訳、Twitter 経由でのツイートの送信、音声機能とビデオ機能の追加、および IBM Watson Conversation サービスと Facebook Messenger を使用したチャット・ボットのセットアップを行う方法を、実地体験を通じて学習します。プログラミング経験も必要ありません。" }
,{ "title": "Node-RED: bot 操作の基礎: ラボ 2: Web ページおよび REST API の構築", "category": "web", "body": "音声からテキストへの変換、トーンの分析、別の言語へのテキスト翻訳、Twitter 経由でのツイートの送信、音声機能とビデオ機能の追加、および IBM Watson Conversation サービスと Facebook Messenger を使用したチャット・ボットのセットアップを行う方法を、実地体験を通じて学習します。プログラミング経験も必要ありません。" }
,{ "title": "Node-RED: bot 操作の基礎: ラボ 1: Node-RED ボイラープレート・アプリケーションの作成", "category": "web", "body": "音声からテキストへの変換、トーンの分析、別の言語へのテキスト翻訳、Twitter 経由でのツイートの送信、音声機能とビデオ機能の追加、および IBM Watson Conversation サービスと Facebook Messenger を使用したチャット・ボットのセットアップを行う方法を、実地体験を通じて学習します。プログラミング経験も必要ありません。" }
,{ "title": "Kubernetes への NodeJS プロジェクトの移動", "category": "web", "body": "IBM Cloud で NodeJS アプリを CloudFoundry から Kubernetes に移す方法について学習します。" }
,{ "title": "IBM Cloud 上で Clojure Web アプリを作成する", "category": "web", "body": "関数型プログラミングを開始しませんか？ Lisp ベースの Clojure は、評判の高い関数型プログラミング言語です。Node.js を使用して、IBM Cloud 上にデプロイされた Web アプリケーションの一部として Clojure プログラムを実行する方法を学んでください。" }
,{ "title": "位置認識機能を備えた IoT アプリを作成する、第 2 回: ジオターゲティング広告を IoT デバイスに配信する PHP アプリを作成する", "category": "web", "body": "この記事は、全 2 回からなるシリーズ「位置認識機能を備えた IoT アプリを作成する」の第 2 回です。位置認識機能を備えたアプリを作成する場合、IoT デバイスからリアルタイムのデータを受信するようになってもまだ五合目にすぎません。このようなアプリを完成させるためには、受信したデータに対して何らかのアクションが実行されるようにする必要があります。この記事では、PHP、MySQL、そして IBM Watson IoT Platform のルールを使用して、IoT デバイスからの着信データ・ストリームを処理し、その計算結果またはコマンドをリアルタイムでクラウドに送信する方法を説明します。有用な IoT ベースのアプリケーションを構築するには、このような双方向通信が鍵となります。" }
,{ "title": "位置認識機能を備えた IoT アプリを作成する、第 1 回: IoT デバイスから GPS データを取得して使用する PHP アプリを作成する", "category": "web", "body": "この記事は、全 2 回からなるシリーズ「位置認識機能を備えた IoT アプリを作成する」の第 1 回です。IoT アプリを作成しようとする PHP 開発者にとって、作業に取り掛かるのは困難な場合があります。そのような PHP 開発者のために、このチュートリアルではPHP で駆動する IBM Cloud IoT アプリケーションを構築するプロセスをステップ・バイ・ステップで解説します。このアプリケーションは、接続されたデバイスから IBM Watson IoT Platform に送信される位置情報データにサブスクライブし、Google Maps API を使用して、その位置情報データを地図の画像に反映させます。" }
,{ "title": "OpenWhisk アクションを呼び出す", "category": "web", "body": "developerWorks サンドボックスの最大の利点の 1 つは、コードを IBM Cloud にデプロイできることです。コードをデプロイする場合、コードは OpenWhisk アクションになります。この記事では、デプロイした後の OpenWhisk アクションにアクセスする 4 つの方法を説明します。" }
,{ "title": "実行可能かつデプロイ可能な OpenWhisk 対応のコードを作成する", "category": "web", "body": "developerWorks サンドボックスの最大の利点としては、ブラウザー内でコードを実行することも、コードを IBM Cloud (Bluemix) にデプロイすることもできるという点が挙げられます。コードをデプロイする場合、コードは OpenWhisk アクションになります。ただし、OpenWhisk では JavaScript コードまたは Java コードが特定のインターフェースをサポートすることが要件となるため、そうなっていなければコードをデプロイすることができません。このチュートリアルでは、すべてを正常に機能させるためのルールと要件を説明します。" }
,{ "title": "WebSocket と SSE による HTTP サーバー Push", "category": "web", "body": "Web アプリケーションとモバイル・アプリケーションの中でリアルタイムのストリーミング配信を行うには、WebSocket と SSE という代表的なサーバー Push ソリューションがありますが、この 2 つはどのように異なるのでしょうか？このチュートリアルでは、Python Web アプリケーションを用いて、それぞれのプロトコルの長所と短所を明らかにします。さらに、WebSocket フロントエンド内での接続問題をトラブルシューティングで乗り越える方法を説明します。" }
,{ "title": "JavaScript 言語入門, 第 2 回: 変数", "category": "web", "body": "このインタラクティブなチュートリアルに従って、JavaScript 言語の学習を進めてください。今回取り上げるトピックは、変数です。変数には、後で取得したり、新しいデータで更新したりできるデータが格納されます。" }
,{ "title": "JavaScript 言語入門, 第 7 回: ループ", "category": "web", "body": "JavaScript 言語の基礎を学習するこのチュートリアルでは、今回、JavaScript 言語で使用できる 2 つのタイプのループを紹介し、それぞれの使用方法を説明します。" }
,{ "title": "JavaScript 言語入門, 第 6 回: 関数", "category": "web", "body": "JavaScript 言語の基礎を学習するこのチュートリアルでは、今回、JavaScript 言語での関数とその使用方法を説明します。説明のために記載するサンプル・コードは、学んだ知識を実践に移す場にもなります。" }
,{ "title": "JavaScript 言語入門, 第 5 回: 条件文", "category": "web", "body": "JavaScript 言語の基礎を学習するこのチュートリアルでは、今回、JavaScript 言語で使用できる条件文を紹介し、それぞれの使用方法を説明します。説明のために記載するサンプル・コードは、学んだ知識を実践に移す場にもなります。" }
,{ "title": "JavaScript 言語入門, 第 4 回: 配列", "category": "web", "body": "JavaScript 言語の基礎を学習するこのチュートリアルでは、今回、JavaScript 言語で使用できる配列を取り上げ、それぞれの使用方法を説明します。説明のために記載するサンプル・コードは、学んだ知識を実践に移す場にもなります。" }
,{ "title": "JavaScript 言語入門, 第 3 回: 演算子", "category": "web", "body": "JavaScript 言語の基礎を学習するこのチュートリアルでは、今回、JavaScript 言語で使用できるすべての演算子を取り上げ、それぞれの使用方法を説明します。説明のために記載するサンプル・コードは、学んだ知識を実践に移す場にもなります。" }
,{ "title": "JavaScript 言語入門, 第 1 回: 基礎", "category": "web", "body": "JavaScript 言語の基礎知識を身につけたいですか？このチュートリアル・シリーズでは、初心者向けに JavaScript の基本となる概念を紹介し、それぞれの概念を実際に使用したサンプル・コードを記載します。" }
,{ "title": "多忙な JavaScript 開発者のための ECMAScript 6 ガイド、第 4 回: 標準のライブラリーに追加された新しいオブジェクトと型", "category": "web", "body": "標準のライブラリーに追加された数々の価値ある機能のうち、いずれ JavaScript でのコーティング方法に大改革をもたらす可能性を秘めた新しいオブジェクトと型から使い始めてください。" }
,{ "title": "多忙な JavaScript 開発者のための ECMAScript 6 ガイド、第 1 回: 新しい JavaScript 内での変数宣言およびその他の新仕様の紹介", "category": "web", "body": "新しい JavaScript 標準を採用するライブラリーとパッケージが増えている中、開発者もこの新しい標準を採用する時機が来ています。この記事では、ECMAScript 6 で導入された新機能の概要を紹介し、これまでの主要な機能に加えられた微調整によって、新しい JavaScript でのコーディングが強化されている仕組みを説明します。" }
,{ "title": "多忙な JavaScript 開発者のための ECMAScript 6 ガイド、第 3 回: JavaScript 内でのクラス", "category": "web", "body": "好きか嫌いかに関わらず、JavaScript はこれまで常に、オブジェクト指向の言語ではなく、クラスを使用しないオブジェクト・ベースの言語でした。この流れが ECMAScript 6 でどのように一変しているのか、そして JavaScript プログラム内でのプロトタイプによる継承にとって ECMAScript 6 が持つ意味を調べてください。" }
,{ "title": "多忙な JavaScript 開発者のための ECMAScript 6 ガイド、第 2 回: 関数に関する機能強化", "category": "web", "body": "ECMAScript 6 に用意されている新機能の中には、例えばアロー関数やジェネレーター関数など、関数型プログラミングに関連するものがあります。これらの関数やその他の関数型要素を JavaScript プログラムでどのようにして利用するのかを学んでください。" }
,{ "title": "多忙な Java 開発者のための LoopBack ガイド, 第 2 回: モデル", "category": "web", "body": "LoopBack フレームワークを紹介するシリーズの第 2 回では、基本的な Web API を開発するプロセスを通して、モデルとデータ・ソースを定義し、使用する方法を説明します。" }
,{ "title": "Node.js のイベント・ループを効果的に使用する", "category": "web", "body": "駆け出しの Node.js アプリケーション開発者が学習の長い横ばい状態を経験する内容の 1 つが、シングルスレッド・イベント・ループがどのように機能するのか、そしてどのような場合にこのイベント・ループが予期しない結果を招くのかを十分に理解することです。このチュートリアルでは、3 つのインタラクティブなサンプルを通じて、イベント・ループの使用方法を実践できます。すぐに、非同期呼び出しに容易に対処できる高速で効率的なコードを作成できるようになるはずです。" }
,{ "title": "Bluemix Push サービスを利用して Angular Ionic モバイル・アプリをデプロイする", "category": "web", "body": "このチュートリアルでは、Ionic AngularJS モバイル・アプリ内で bms-push プラグインを適切に使用するために必要な最小限の手順を案内します。" }
,{ "title": "多忙な Java 開発者のための LoopBack ガイド, 第 1 回: Hello, World!", "category": "web", "body": "近頃、多くのオープンソース Node.js フレームワークがサーバー・サイド JavaScript 開発のさまざまな可能性を再び膨らませていますが、LoopBack もその 1 つです。LoopBack を開発環境にセットアップし、コマンド・ラインや API ライフサイクル管理プラットフォーム IBM API Connect を使用して初めての LoopBack API を作成してください。" }
,{ "title": "IBM OpenWhisk で簡単にアクションをプロビジョニングして起動するにはどのようにするのか", "category": "web", "body": "IBM OpenWhisk は、着信 REST リクエストに応答して、コードのさまざまな部分をオンデマンドで迅速に起動して実行する、シンプルなオープンソース・サービスです。このチュートリアルでは、OpenWhisk コマンドを手作業で発行するにはどのようにするのかを説明した後、コマンドの発行をさらに容易にする Python ライブラリーの使用方法を説明します。" }
,{ "title": "RESTful API の文書化と定義に Swagger を使用する", "category": "web", "body": "Swagger は RESTful API のドキュメントを生成するために役立ちますが、出力されたドキュメントに、必要な詳細やフィーチャーのすべてが含まれるとは限りません。カスタマイズした拡張機能、ツール、およびテンプレートを使用して、Swagger のネイティブ機能を拡張する方法を学んでください。" }
,{ "title": "IBM Bluemix の OpenWhisk および Watson を利用して、画像にタグを付けて特定の顔を検出するアプリを構築する", "category": "web", "body": "想像してみてください。あなたは今、カンヌ国際映画祭に出席しています。あるいは、大都市を訪れているという設定でも構いません。そこで撮った写真を友達やフォロワーとシェアしようとすると、アプリケーションが写真を解釈し、建物やランドマーク、そして有名人を識別して自動的にハッシュタグ候補を提示するとしたら、素晴らしいと思いませんか？よく使われている画像共有アプリにそのような機能が導入されるまで待つのではなく、IBM Bluemix を利用してそのような機能を作成してみませんか？" }
,{ "title": "Bluemix、Watson、および Apache Cordova を利用してハイブリッド・モバイル・アプリを構築する", "category": "web", "body": "この記事では、既存の Web アプリを簡単にハイブリッド・モバイル・アプリに変換する方法を説明します。ハイブリッド・モバイル・アプリを作成するために使用するツールは、皆さんがすでに愛用している JavaScript、HTML5、および CSS です。これらのツールで作成したコードをネイティブ・コードのシン・レイヤー内にラップして、位置情報、加速度計、カメラ、連絡先などの端末の機能にアクセスできるようにします。ハイブリッド・モバイル・アプリは、iOS、Android、Windows Phone などのプラットフォーム上でネイティブに実行されます。アプリ・ストアでも、ハイブリッド・モバイル・アプリが販売されています。" }
,{ "title": "D3 および Angular を使用したカスタム・データ視覚化", "category": "web", "body": "D3.js ライブラリーを使用してカスタム・データ視覚化を作成し、作成した視覚化を AngularJS アプリに統合します。" }
,{ "title": "Twitter のリストを RSS に変換する", "category": "web", "body": "Twitter ウィジェットからの HTML 出力を構文解析して RSS フィードに組み込むと、フィード・リーダーや、IFTTT レシピ、カスタム・アプリケーションなどで使用できるようになります。" }
,{ "title": "多忙な Java 開発者のための Sails.js ガイド: モデルとブループリント", "category": "web", "body": "Sails.js でのモデルは JavaScript オブジェクトによって表現されます。これらのオブジェクトは、リレーショナル・データベースやドキュメント指向データベースを含め、あらゆるタイプのデータ・ストアに保管することができます。このチュートリアルでは、Sails.js で初めてのモデルを開発し、データ駆動型アプリケーションにおなじみの機能である、作成、読み取り、更新、削除といった機能の組み込みサポートを提供する Sails のブループリントを導入します。" }
,{ "title": "次世代の JavaScript モジュールを利用するために jspm を使用する", "category": "web", "body": "jspm は、JavaScript によるクライアント・サイドの依存関係管理において、新しい境地を切り開くフレームワークです。このチュートリアルでは、jspm を使用することで、どのようにして次世代の JavaScript (ECMAScript 6) 言語の機能を今から利用することができるか、さらには jspm が npm や GitHub などのレジストリーを利用することで、どのようにしてモジュールを自動的に解決するかを説明し、jspm に組み込まれていて付加価値をもたらすツールについても見て行きます。" }
,{ "title": "Bluemix を利用したハイブリッド・クラウドに Java アプリケーションをマイグレーションする、パート 4", "category": "web", "body": "Secure Gateway サービスを利用して、Bluemix 内で実行される Java Platform, Enterprise Edition アプリケーションを、Bluemix の外部で実行されるリレーショナル・データベースに接続してください。" }
,{ "title": "Docker と Bluemix を使用して golang アプリをコンテナー化する", "category": "web", "body": "Docker、Bluemix、Object Storage を使用して、Go プログラミング言語で作成されてコンテナー化されたアプリケーションをビルドしてデプロイしてください。" }
,{ "title": "Docker: 今どきの開発者への朗報", "category": "web", "body": "Docker を使用することで、より生産的にコーディングを行い、より効率的にスキルを高めてください。コンテナー化されたアプリケーションを扱うことで、開発環境を整えて、依存関係の競合を取り除き、開発および学習にかかる時間を削減してください。" }
,{ "title": "PHP、MongoDB、IBM Bluemix を使ってメモ帳アプリケーションを作成する", "category": "web", "body": "この記事では、PHP、MongoDB、Bootstrap を使用して Web ベースのメモ帳アプリケーションを作成し、IBM Bluemix を利用してビルド、デプロイする方法を紹介します。このメモ帳アプリケーションでは、高速かつスケーラブルなドキュメント・ストレージとして MongoDB を使用し、アプリケーションのビジネス・ロジック用に Slim PHP マイクロフレームワークを使用し、応答性に優れたモバイル・フレンドリーなユーザー・インターフェースには Bootstrap を使用します。" }
,{ "title": "IBM Bluemix を利用して、クラウド内で投資追跡アプリケーションを作成してデプロイする: 第 1 回", "category": "web", "body": "この全 2 回からなる連載の第 1 回では、オープン API を使用して金融データに接続し、必要なデータを取得する方法を紹介します。モバイル対応のインターフェース・フレームワークを使用することで、アプリケーションはデスクトップ・コンピューター上でもモバイル端末上でも同じように有効に機能するようになります。さらにアプリケーションを IBM Bluemix 上にホストすることで、信頼性とスケーラビリティーが確保されます。" }
,{ "title": "IBM Bluemix を利用して、クラウド内で投資追跡アプリケーションを作成してデプロイする: 第 2 回", "category": "web", "body": "この全 2 回からなる連載の第 2 回では、第 1 回で開発した PHP アプリケーションの中で金融データを使用して、投資ポートフォリオを正確かつ即座に評価する方法を紹介します。" }
,{ "title": "Bluemix 上で実行される Node.js アプリの法的レポートの収集を自動化する", "category": "web", "body": "新しいソフトウェア・バージョンをリリースする前に、開発者やリリース・マネージャーは、そのソフトウェアに含まれるライブラリーが営利目的で使用できることを確認しなければなりません。Node.js アプリケーションを作成する場合、使用する数多くの外部ライブラリーのライセンス条項がそれぞれに異なる可能性がありますが、それらのすべてに関する情報を収集するのは、時間のかかる厄介な作業になりかねません。この記事では、こうした作業の一部を自動化して、プロジェクトで使用しているすべての依存関係のリストを生成する方法を説明します。このリストには、各依存関係に適用されるライセンスと、それらの依存関係ライブラリーを入手できる Web サイトまたはリポジトリーの情報が記載されます。" }
,{ "title": "Bluemixathon チャレンジの災害救援アプリ、トップ 5", "category": "web", "body": "この記事では、「Bluemixathon: Operation Rescue &amp; Recovery」チャレンジの受賞チームを紹介するとともに、グランプリ受賞チームと、カテゴリー別の受賞チームが IBM Bluemix のサービスをどのように利用して災害救援アプリを作成したかを紹介します。" }
,{ "title": "Play を使った Web アプリケーション開発: 第 1 回: Play Framework と Scala でユーザー認証を管理する", "category": "web", "body": "Play Framework アプリケーション用のユーザー管理を実装するために Scala のスキルを活用してください。このチュートリアルでは、認証と承認を扱う基本的な Play アプリケーションを作成する方法を Pablo Pedemonte が説明します。このアプリケーションのコードは、皆さん独自の Play プロジェクトのスターター・コードとして、ユーザー管理機能の開発時間を短縮するために利用することもできます。" }
,{ "title": "Secure Gateway サービスと API Management サービスを利用してオンサイトの REST API を Bluemix に公開する", "category": "web", "body": "Secure Gateway サービスと API Management サービスを利用すると、Bluemix 上にオンサイトの REST API サービスを新規カスタム・サービスとして簡単に公開することができます。この記事では、オンサイトのサンプル REST API サービスを出発点として、REST API を Bluemix に公開し、その REST API を管理して、新規カスタム・サービスとして公開した後、検証用のサンプル・アプリを作成します。Bluemix アプリからオンサイト環境にアクセスする必要がある場合には、この記事が役に立つはずです。" }
,{ "title": "Play を使った Web アプリケーション開発: 第 2 回: クラウドで Play の力を解き放つ", "category": "web", "body": "IBM Bluemix 内で実行される重要な Play Framework アプリケーションを準備して、セキュアにし、デプロイするためのステップバイステップのガイドに従ってください。このアプリケーションでは、永続化サービスには MongoDB を使用し、e-メール・サービスには SendGrid を使用して、ユーザー管理とユーザー認証を実装します。" }
,{ "title": "多忙な Java 開発者のための Sails.js ガイド: Sails を使用して基本的な Web アプリを作成してデプロイする", "category": "web", "body": "数あるサーバー・サイド JavaScript フレームワークと同じく、Sails.js を使用すれば、従来型の Web アプリケーションを容易に開発できるようになります。Sails は、Rails を画期的なフレームワークにした考え方を一部採用しており、Node.js を利用した Web 開発とモバイル開発に新たなレベルの生産性をもたらします。このシリーズの第 1 回では、Sails を他のフレームワークとは差別化しているものは何であるか、その概要を、Salis の MVC アーキテクチャーに対する革新的アプローチも含めて説明します。また、Salis を使用した開発環境を構築し、基本的な Sails アプリケーションを作成して、そのアプリケーションを IBM Bluemix にデプロイします。" }
,{ "title": "Node.js クラウド・アプリのシングル・サインオンをスケーリングする", "category": "web", "body": "Redis を使用して express-session のための永続化機能を実装し、IBM Single Sign On サービスを利用した Node.js アプリの水平スケーリングを実現します。" }
,{ "title": "Intro.js を使用して JavaScript アプリにインタラクティブなマニュアルを追加する", "category": "web", "body": "Intro.js を使用して、すぐに理解できるインタラクティブなユーザー・マニュアルを JavaScript アプリに追加しましょう。アプリのフィーチャーをアプリの UI の中からいまどきの手法でデモする方法をサンプル・ツアーの実装から学んでください。" }
,{ "title": "企業で利用する Node.js 用の IBM ツール: IBM SDK for Node.js のコア・ダンプ・デバッグ機能", "category": "web", "body": "IBM SDK for Node.js と連動する Eclipse アドオンを使用して、Node.js アプリケーションの異常終了とメモリー・リークをデバッグしてください。" }
,{ "title": "単純な顔検出 Web アプリケーションを作成する", "category": "web", "body": "IBM Bluemix 上で AlchemyAPI サービスの強力なコグニティブ・コンピューティング機能を利用する単純なアプリケーションを PHP で開発してください。このアプリケーションは、AlchemyAPI サービスの顔検出機能がどのようにして、画像を学習して顔を検出し、性別を判定し、年齢を推定し、多くの場合に具体的な人物を特定することができるかをデモンストレーションします。Bluemix 上でコグニティブ・アプリケーションを開発する上では、このステップバイステップの例の数行のコードさえあれば、コグニティブ・コンピューティングや深層学習のアルゴリズムについて何も知っている必要はありません。" }
,{ "title": "Vaadin を使用したフルスタック Java の Web 開発", "category": "web", "body": "Web アプリで魅力的な対話型のユーザー・エクスペリエンスを創り出すために、Java Web 開発者が (最新のブラウザーの基礎となっている) JavaScript、CSS、HTML5 を学ばなければならないことはよくあります。Java 開発者は、オープンソースの Vaadin フレームワークを使用することで、100% Java の世界の中でフルスタックの制御をできるようになります。" }
,{ "title": "Vaadin を使用してクラウド内でフルスタック Java のアプリを開発する", "category": "web", "body": "Vaadin Rich Web Starter ボイラープレートを利用して、DB2 をバックエンドに持つ 3 層構造の注文デスク・アプリを数分でカスタマイズして Bluemix クラウドにデプロイしてください。" }
,{ "title": "LAMP アプリケーションを Bluemix にマイグレーションする", "category": "web", "body": "昔ながらの LAMP アプリケーション (Drupal) を IBM Bluemix にマイグレーションする方法を学んでください。" }
,{ "title": "SOA からコグニティブ・サービスに至るまでのサービス・コンポジションの進化を見ていく", "category": "web", "body": "最近では、開発者がまったく新しいタイプのコグニティブ・コンピューティング・サービスを利用して、多種多様なサービス・コンポジションを作成できるようになっており、サービス・コンポジションを作成する上での可能性は無限に広がっています。しかし、SOA (Service-Oriented Architecture) のサービスが登場して間もない頃は、このような状況だったわけではありません。この記事では、サービス・コンポジション開発の歴史を振り返り、現在の状況に至るまでにどれだけ進化したのかを明らかにします。" }
,{ "title": "社内のシングル・サインオンを Bluemix Web アプリへと拡張する", "category": "web", "body": "この記事では、皆さんの会社の既存の SSO を利用して、Bluemix Web アプリケーション用の簡単なシングル・サインオン・ソリューションを実装する方法を説明します。この SAML 対応のソリューションは、1 時間足らずで作成することができ、会社の既存のインフラストラクチャーに変更を加える必要もなければ、新しいソフトウェアを導入する必要もありません。" }
,{ "title": "大規模なデータ統合: OSLC と Linked Data Platform", "category": "web", "body": "今回の記事では、この連載で紹介している概念を、OSLC (Open Services for Lifecycle Collaboration) コミュニティーがコラボレーションによるソフトウェア開発にどのように適用しているかを学んでください。OSLC は、ソフトウェア・ライフサイクル全体を通して、要件追跡ツールと、開発ツール、テスティング・ツールを連動させやすくする目的で、Linked Data とその他のセマンティック Web 標準を使用しています。" }
,{ "title": "Bluemix に「Hello World」Web ページをデプロイする", "category": "web", "body": "HTML と静的ビルドパックだけを使って、シンプルな Hello World Web ページを IBM Bluemix 上にデプロイしましょう。" }
,{ "title": "MEAN をマスターする: MEAN スタックのテスト", "category": "web", "body": "MEAN スタックのテスティング・インフラストラクチャーを構成する、疎結合の小さなピースについて見て行きましょう。MEAN でも MEAN でなくても、アプリケーションを本番環境へ移行するには、その前に厳格かつ総合的なテスト・スイートに合格しなければなりません。この記事では、(PhantomJS の助けを借りて) Karma、Mocha、Jasmine、istanbul を使用して UGLI アプリケーションをテストする方法を説明します。" }
,{ "title": "React Native: 迅速な iOS 開発の新しい世界へ", "category": "web", "body": "iOS 開発用プラットフォームとツール・セットとして最も急成長している React Native を使用して、モバイル開発を迅速に行ってください。React Native を使用すれば、Objective-C や Swift のチュートリアルは脇に置いて、JavaScript で iOS アプリのコーディングを始めることができます。この記事では React Native の概要を紹介し、そのアーキテクチャーと内部動作を説明した後、React Native のプログラミング手法に焦点を当てたサンプル・アプリに取り組みます。" }
,{ "title": "大規模なデータ統合: Linked Data", "category": "web", "body": "Linked Data テクノロジーは、実質的に多数のデータ・セットから 1 つのデータ・セットを作成します。この連載でこれまでに学んだ RDF (Resource Description Framework) データ・モデルと SPARQL (SPARQL Protocol and RDF Query Language) の知識を基に、今回の記事ではこれらの標準を Web のアーキテクチャーと結び付け、簡単に利用できる相互に接続されたデータを作成して使用する方法を学んでください。" }
,{ "title": "一新された PHP: Vagrant と PuPHPet を使用して環境を構築する", "category": "web", "body": "Vagrant と PuPHPet のおかげで、PHP による開発とデプロイを行うための複数の同一環境を、仮想マシン・テクノロジーを利用して簡単に構築することができます。この 2 つのオープンソース・ツールは、VirtualBox などのデスクトップ仮想化ソフトウェアと連動するので、システム間の違いが原因で生じる明らかなバグを排除しやすくなります。この記事では、PHP エキスパートの Eli White が、Vagrant と PuPHPet をチームに役立てる方法を説明します。" }
,{ "title": "Bluemix と MEAN スタックを使用して自動投稿 Facebook アプリケーションを作成する: パート 1 Facebook をログイン・ソースとして使用する", "category": "web", "body": "このチュートリアルのシリーズでは、Node.js 環境で実行されている Bluemix アプリケーションから Facebook の API と Facebook を通じた許可を使用する方法を紹介します。この方法によって、アプリケーションがスマート・エージェントとして機能することが可能になるとともに、ユーザーがログインしていないときでも、ユーザーに代わって Facebook から情報を読み込んだり、Facebook に投稿したりすることが可能になります。全 3 回からなるこのチュートリアルのシリーズのパート 1 では、Facebook をログイン・ソースとして使用する方法を説明します。" }
,{ "title": "Bluemix と MEAN スタックを使用して自動投稿 Facebook アプリケーションを作成する: パート 3 サーバーにユーザーの代理を務めさせる", "category": "web", "body": "このチュートリアルのシリーズでは、Node.js 環境で実行されている Bluemix アプリケーションから Facebook の API と Facebook を通じた許可を使用する方法を紹介します。この方法によって、アプリケーションがスマート・エージェントとして機能することが可能になるとともに、ユーザーがログインしていないときでも、ユーザーに代わって Facebook から情報を読み込んだり、Facebook に投稿したりすることが可能になります。全 3 回からなるこのチュートリアルのシリーズのパート 3 では、パズルの最後のピースとして、サーバーにユーザーの代理を務めさせる方法を説明します。" }
,{ "title": "Bluemix と MEAN スタックを使用して自動投稿 Facebook アプリケーションを作成する: パート 2 ユーザー情報をサーバーに保管する", "category": "web", "body": "このチュートリアルのシリーズでは、Node.js 環境で実行されている Bluemix アプリケーションから Facebook の API と Facebook を通じた許可を使用する方法を紹介します。この方法によって、アプリケーションがスマート・エージェントとして機能することが可能になるとともに、ユーザーがログインしていないときでも、ユーザーに代わって Facebook から情報を読み込んだり、Facebook に投稿したりすることが可能になります。全 3 回からなるこのチュートリアルのシリーズのパート 2 では、サーバーにユーザー情報を保管する方法を説明します。" }
,{ "title": "Meteor を使用したインスタント Web アプリケーション", "category": "web", "body": "Web アプリケーション開発プラットフォームとして Meteor を使用すれば、JavaScript 開発者は極めてインタラクティブで応答性に優れたリッチ・クライアント Web アプリケーションを迅速かつ簡単に設計して構築することができます。この記事で、業界標準の JavaScript ライブラリーを利用して、Meteor によるアプリケーションを構築する実践的な経験をしてください。Sing Li が Meteor の真実に迫り、ありきたりではない機能的なサンプル・アプリケーションを通して Meteor の有望さを探ります。編集者注: このチュートリアルは、2013年の初期ベータ版から現在のバージョンである 1.1.x に Meteor フレームワークがバージョンアップされたことによる変更内容を反映するように更新されました。" }
,{ "title": "Heroku から Bluemix にアプリケーションを移植する", "category": "web", "body": "現在市場にあるクラウド・プラットフォームでは、アプリケーションを移植すると問題が生じる可能性があります。このチュートリアルでは、サンプル・アプリケーションを Heroku から Bluemix に移植する方法をステップ・バイ・ステップで紹介します。" }
,{ "title": "IBM Bluemix を使って管理される API を作成する", "category": "web", "body": "Bluemix の API Management サービスを利用して、クラウド内で独自の API を作成して公開してください。このチュートリアルは、API エコノミーに参加する上で API Management と Bluemix がいかに役立つかを詳しく探る手助けをします。" }
,{ "title": "サッカーのスコアを通知するモバイル・アプリを IBM Bluemix 上で作成する", "category": "web", "body": "Joe Lennon が、Occer アプリをどのように作成して IBM の Bluemix プラットフォームにデプロイしたかを説明しているので、それを理解してください。バックエンドの API 層は、Ruby、Sinatra、MongoDB を使って作成されています。サッカーの試合の最新のスコアは、無料で入手できる football-data.co.uk のデータ・フィードから取得します。アプリそのものは Swift で作成した iOS アプリですが、IBM Bluemix のMobile SDK を利用してプッシュ通知に対処します。" }
,{ "title": "一新された PHP: Composer による PHP 依存関係の処理", "category": "web", "body": "最近の複雑な PHP プロジェクトでは、複数のサード・パーティー・ライブラリーを使用することがよくありますが、これらのライブラリー自体にも依存関係があります。PHP コミュニティーのために PHP で作成された、Composer というオープンソース・プロジェクトが、最新の PHP アプリケーションから依存関係処理の大変な部分をどのように取り除くかを学んでください。" }
,{ "title": "Java、Weka、そして dashDB サービスを利用してデータ・マイニング・アプリケーションを構築する", "category": "web", "body": "dashDB サービス (以前は Analytics Warehouse サービス、または BLU Acceleration サービスと呼ばれていました) は、IBM Bluemix 上でデータウェアハウジングとアナリティクスをサービスとして提供します。開発者は、クラウド内で提供される、極めて高速に動作する IBM BLU データベースのテクノロジーを利用して重要な分析アプリケーションを開発し、デプロイすることができます。IBM BLU 列指向データベースを活用し、Weka 統計分析ツールを使用してデータ・マイニング・アプリケーションを開発する方法を学んでください。" }
,{ "title": "Bluemix Single Sign On サービスを利用してソーシャル・ネットワークのログインを使用できるようにする", "category": "web", "body": "このチュートリアルでは、Single Sign On サービスを利用することで、IBM Bluemix アプリケーションにユーザー認証を追加する方法を紹介します。Node.js アプリケーションを作成してデプロイする方法、Single Sign On サービスをアプリケーションにバインドする方法、LinkedIn、Facebook、Google+ などの人気の ID ソースや、カスタムのクラウド・ディレクトリーをアプリケーションに追加する方法を学んでください。" }
,{ "title": "IBM Content Navigator におけるカスタム・ビューアーの開発", "category": "web", "body": "この記事では ICN プラグイン・フレームワークを利用したカスタム・ビューアーの開発手順について紹介します。ICN の利用者はこのフレームワークを利用することで、独自の機能をもったカスタム・ビューアーを開発し、簡単に ICN 上で利用することができます。本記事では具体的な開発手順として、画像を原寸大で読み込んで表示するだけの機能をもつ単純なビューアーを作成する手順を紹介します。また、今回紹介する手法をベースにして作成したカスタム・ビューアーの有用性を示す例として、上記ビューアーに拡大・縮小・回転などの拡張機能を追加したビューアーについても紹介します。" }
,{ "title": "IBM Bluemix アプリを対象とした、リモート制御の Raspberry Pi 2 モニターを作成する", "category": "web", "body": "IBM Internet of Things Foundation を利用してデバイスとアプリケーションを相互接続する実践プロジェクトを通して、モノのインターネットについて理解してください。このチュートリアルでは、実行中の IBM Bluemix アプリケーションのアップタイムと、このアプリケーションへのアクセス時間をモニタリングするように Raspberry Pi 2 をセットアップして、Bluemix にデプロイできるグラフ作成アプリケーションにそのモニタリング結果を取り込みます。さらに、この Raspberry Pi 2 モニターをリモートで制御するデスクトップ・アプリケーションのコーディングを行います。" }
,{ "title": "大規模なデータ統合: SPARQL を使用して RDF データに対してクエリーを実行する", "category": "web", "body": "前回の記事では、RDF (Resource Description Framework) データ・モデルについて学んだので、今回の記事では、SPARQL (SPARQL Protocol and RDF Query Language) を使用して RDF データ・セットから答えを引き出す方法を学んでください。データ統合の標準とテクノロジーに関するこの全 5 回からなる連載の以降の記事では、OSLC (Open Services for Lifecycle Collaboration) データに対してクエリーを実行する際に、今回学ぶ SPARQL の知識が活かされることになります。" }
,{ "title": "PHP の新しい側面: 一新された PHP: 最新の PHP でのパスワード・セキュリティー", "category": "web", "body": "PHP による Web アプリケーションのパスワードをハッカーから守ってください。PHP が Web とともに進化し続ける中、パスワードを安全に保管しなければならない Web アプリケーションが増えてきています。この全 4 回からなる連載「一新された PHP」の第 2 回では、PHP 5.5 で新たに追加されたパスワード処理機能について学んでください。" }
,{ "title": "React を使用して IBM Watson エクスプローラーを作成する", "category": "web", "body": "React ライブラリーと Material-UI コンポーネントを使用して、IBM Bluemix 上で IBM Watson のサービスを探るアプリを作成してください。" }
,{ "title": "IBM クラウド内で WordPress ブログをホストする", "category": "web", "body": "この記事では、自分が使用している IBM SoftLayer 仮想サーバー上にベーシックな WordPress ブログをセットアップできるようにします。" }
,{ "title": "ブラウザーから離れることなく Node.js アプリを開発する", "category": "web", "body": "このチュートリアルでは、ブラウザーから離れることなく、クラウド内でアプリを開発、デバッグ、デプロイするために Bluemix Live Edit、Bluemix Debug、そして Bluemix シェルを使用する方法を紹介します。" }
,{ "title": "大規模なデータ統合: RDF を使用してデータの Web を作成する", "category": "web", "body": "データ統合の標準とテクノロジーに関する、全 5 回からなる連載記事の第 1 回では、Brian Sletten が OSLC (Open Services for Lifecycle Collaboration) と呼ばれる新しい標準一式の基礎となっている RDF (Resource Description Framework) について紹介します。RDF は、World Wide Web Consortium (W3C) のセマンティック Web テクノロジー・スタックの一部として、複数の参加者の間で大々的な事前調整を行うことなく情報の統合を容易に行えるように設計されたものです。" }
,{ "title": "React: 保守しやすいハイパフォーマンスの UI コンポーネントを作成する", "category": "web", "body": "UI ビュー・コンポーネントを作成して組み合わせ、今風の Web UI を構成するという作業を容易にするために、オープンソースの JavaScript ライブラリー React を使い始めてください。このチュートリアルの例に従い、保守しやすく再利用可能な React コンポーネントを作成するために定められたベスト・プラクティスについて学んでください。" }
,{ "title": "PHP のニュー・フェイス: 一新された PHP", "category": "web", "body": "PHP はテンプレート言語として使用されていた初期の頃から、目覚ましい進化を遂げています。最近の PHP プログラミングについて取り上げる全 4 回からなる連載の第 1 回では、PHP のエキスパートである Eli White が、PHP 5.3 以降での進化をいくつか取り上げて詳しく説明します。名前空間、トレイト、クロージャー、ジェネレーターなどについて理解してください。" }
,{ "title": "アーキテクチャー・ラボ: コンテナーを使用した Web アプリケーションのホスティング (Etherpad ラボ 1)", "category": "web", "body": "このラボでは、Bluemix 内で Etherpad Web アプリケーションをホストする手順を説明します。この手順を完了することが、他のすべての Etherpad ラボ・シリーズの前提条件となります。" }
,{ "title": "IBM DevOps Services と Bluemix による Node.js アプリ", "category": "web", "body": "IBM DevOps Services を利用して Node.js アプリケーションを開発し、そのアプリケーションを Bluemix にデプロイするのがいかに容易であるかを理解してください。" }
,{ "title": "アーキテクチャー・ラボ: コグニティブ・サービスを利用した Web アプリケーションのホスティング (Etherpad ラボ 4)", "category": "web", "body": "このラボでは、Bluemix 上でコグニティブ・サービスを統合して Web アプリケーションを拡張するシナリオを紹介します。" }
,{ "title": "アーキテクチャー・ラボ: キャッシング・サービスを利用した Web アプリケーションのホスティング (Etherpad ラボ 3)", "category": "web", "body": "このラボでは、IBM Bluemix 上にデプロイされて実行されている、既存の Web アプリケーションに変更を加えます。" }
,{ "title": "アーキテクチャー・ラボ: データベース・サービスを利用した Web アプリケーションのホスティング (Etherpad ラボ 2)", "category": "web", "body": "Bluemix 上にホストされた MySQL データベース・サービスを利用して Web アプリケーションを拡張する方法を学んでください。" }
,{ "title": "MEAN をマスターする: OAuth と Passport による認証の管理", "category": "web", "body": "連載「MEAN をマスターする」の前回の記事では、Meetup.com の RESTful API を使用して、ミーティング情報が格納された JSON を取り込みました。今回はサンプル・アプリケーションにログイン機能を追加するために、Meetup.com の OAuth サービスを利用します。" }
,{ "title": "初めての Node.js Webサイトを構築する、第 1 回", "category": "web", "body": "Node.js を使用して動的 Web サイトを構築したいけれども、どこから始めればよいかがわからないのであれば、ソフトウェアのインストール不要の Node.js 開発をステップバイステップで紹介する、この全 3 回からなる連載記事を読んでください。これらの記事では、Web ブラウザーのみを使用して、Node.js アプリケーションの作成、サーバー・サイド JavaScript の作成、HTML ページ上での動的データの表示、Redis データベースへのデータの保管を行います。" }
,{ "title": "初めての Node.js Webサイトを構築する、第 3 回", "category": "web", "body": "Node.js を使用して動的 Web サイトを構築したいけれども、どこから始めればよいかがわからないのであれば、ソフトウェアのインストール不要の Node.js 開発をステップバイステップで紹介する、この全 3 回からなる連載記事を読んでください。これらの記事では、Web ブラウザーのみを使用して、Node.js アプリケーションの作成、サーバー・サイド JavaScript の作成、HTML ページ上での動的データの表示、Redis データベースへのデータの保管を行います。" }
,{ "title": "初めての Node.js Webサイトを構築する、第 2 回", "category": "web", "body": "Node.js を使用して動的 Web サイトを構築したいけれども、どこから始めればよいかがわからないのであれば、ソフトウェアのインストール不要の Node.js 開発をステップバイステップで紹介する、この全 3 回からなる連載記事を読んでください。これらの記事では、Web ブラウザーのみを使用して、Node.js アプリケーションの作成、サーバー・サイド JavaScript の作成、HTML ページ上での動的データの表示、Redis データベースへのデータの保管を行います。" }
,{ "title": "OCR とアナリティクス・テクノロジーを使用して PDF ファイルから表の情報を抽出する", "category": "web", "body": "PDF 文書を変換してテキストにする Web サービスを提供する REST アプリケーションを、IBM Bluemix を使用して作成する方法を学んでください。このサービスは PDF ファイルを受け取って、その PDF ファイルをテキスト・ファイルに変換し、表として識別された部分を文書 (つまり XML または HTML) に取り込んで、その結果をユーザーに返します。XML 版は OCR エンジンからの出力である一方、HTML 版は OCR エンジンによって表として識別された部分の構造に含まれるエラーを修正する、エラー修正プロセスの出力結果です。" }
,{ "title": "Web ユーザーと Pebble ユーザーのための Where? アプリを作成する", "category": "web", "body": "「どこ?」の質問に答えるアプリケーションを作成します。クライアント・アプリケーションをサポートするための REST API を提供するバックエンド Node.js   アプリケーションを、Bluemix 上でビルドしてデプロイします。 次に 2 つのクライアント・アプリケーション (1 つは Web 用、1 つは Pebble スマートウォッチ用)   をビルドします。" }
,{ "title": "「モノのインターネット」を使用して節水する: パート 1", "category": "web", "body": "3 部構成シリーズのこの最初のチュートリアルでは、Raspberry Pi をベースにした室内用鉢植え植物をモニターするソリューションを低コストで作成する方法を説明します。このソリューションでは、センサー・データの収集とビジュアライゼーション、およびソーシャル・ネットワークへの更新情報の投稿に IBM Bluemix を使用します。" }
,{ "title": "「モノのインターネット」を使用して節水する: パート 3", "category": "web", "body": "3 部構成シリーズのこの 3 番目のチュートリアルでは、Raspberry Pi をベースにした低コストの植物モニター・ソリューションの作成方法を説明します。この最後のチュートリアルでは、デスクトップ・デバイスおよびモバイル・デバイス用にセンサー・データをビジュアライズする HTML5 アプリケーションを作成します。データを Cloudant データ・ストアから利用可能にするためにオープン・データ API を作成します。" }
,{ "title": "「モノのインターネット」を使用して節水する: パート 2", "category": "web", "body": "3 部構成シリーズのこの 2 番目のチュートリアルでは、Raspberry Pi をベースにした低コストの植物モニター・ソリューションを作成する方法を説明します。Node-RED アプリケーションを保護し、コードの変更に応じた Bluemix への自動デプロイメントをセットアップします。" }
,{ "title": "大規模なデータ統合: OSLC と Linked Data Platform", "category": "xml", "body": "今回の記事では、この連載で紹介している概念を、OSLC (Open Services for Lifecycle Collaboration) コミュニティーがコラボレーションによるソフトウェア開発にどのように適用しているかを学んでください。OSLC は、ソフトウェア・ライフサイクル全体を通して、要件追跡ツールと、開発ツール、テスティング・ツールを連動させやすくする目的で、Linked Data とその他のセマンティック Web 標準を使用しています。" }
,{ "title": "大規模なデータ統合: Linked Data", "category": "xml", "body": "Linked Data テクノロジーは、実質的に多数のデータ・セットから 1 つのデータ・セットを作成します。この連載でこれまでに学んだ RDF (Resource Description Framework) データ・モデルと SPARQL (SPARQL Protocol and RDF Query Language) の知識を基に、今回の記事ではこれらの標準を Web のアーキテクチャーと結び付け、簡単に利用できる相互に接続されたデータを作成して使用する方法を学んでください。" }
,{ "title": "大規模なデータ統合: SPARQL を使用して RDF データに対してクエリーを実行する", "category": "xml", "body": "前回の記事では、RDF (Resource Description Framework) データ・モデルについて学んだので、今回の記事では、SPARQL (SPARQL Protocol and RDF Query Language) を使用して RDF データ・セットから答えを引き出す方法を学んでください。データ統合の標準とテクノロジーに関するこの全 5 回からなる連載の以降の記事では、OSLC (Open Services for Lifecycle Collaboration) データに対してクエリーを実行する際に、今回学ぶ SPARQL の知識が活かされることになります。" }
,{ "title": "DITADoclet と DITA API 特殊化を利用して DITA Java API リファレンス・マニュアルを生成する", "category": "xml", "body": "DITADoclet と DITA API 特殊化を組み合わせることで、時間を節約しながらも、品質の高い API ドキュメントを Java ソース・コードから直接作成します。" }
,{ "title": "独自のブラウザー拡張機能を作成する: 第 1 回、Chrome を拡張する", "category": "xml", "body": "どのブラウザーにも、それぞれに固有の長所と短所があり、支持する人もいれば、批判する人もいます。そのなかで、すべてのブラウザーに共通して言えることは、人々がブラウザーで費やす時間がますます増えているということです。この連載では、Chrome、Firefox、および Safari を対象に、共通のベーシックな拡張機能を作成する方法を検討します。それによって、それぞれのブラウザーを拡張する作業とはどのようなものなのか、また共通する作業の難易度はどの程度なのか、さらには拡張機能を配布する方法とはどのようなものなのかを説明します。今回の記事では、Chrome の拡張機能を作成します。" }
,{ "title": "PHP アプリケーションと Instagram の統合: 第 2 回", "category": "xml", "body": "Instagram は、ユーザーがスマートフォンで写真を撮って、その写真を Web を介して他のユーザーと共有できる、人気の高い写真共有サービスです。アプリケーション開発者は Instagram REST API を使用して、これらの写真を検索し、写真とそれに関連付けられているコメントや「いいね!」の情報を取得することができます。この全 2 回からなる記事では Instagram API を紹介するとともに、Instagram のユーザーが生成した豊富なコンテンツのリポジトリーを利用して革新的な Web アプリケーションを作成するために、この API を PHP で使用する方法を説明します。" }
,{ "title": "PHP の学習: 第 3 回 認証、オブジェクト、例外、ストリーム処理", "category": "xml", "body": "このチュートリアルは、単純なワークフロー・アプリケーションの構築プロセスを通して PHP の使用方法を説明する 3 部構成のシリーズ「PHP の学習」の第 3 回です。今回のチュートリアルでは、HTTP 認証の使用方法、ファイルをストリーム処理する方法、そしてオブジェクトと例外の作成方法を学びます。" }
,{ "title": "PHP の学習: 第 2 回 ファイルをアップロードし、ファイルの情報を XML または JSON 形式で保管し、表示する", "category": "xml", "body": "このチュートリアルは、単純なワークフロー・アプリケーションの構築プロセスを通して PHP の使用方法を説明する 3 部構成のシリーズ「PHP の学習」の第 2 回です。PHP の基礎知識を基に、ブラウザーからファイルをアップロードする方法や、セッションについて、あるいは PHP で XML または JSON を処理する方法について学ぶには、このチュートリアルに従ってください。" }
,{ "title": "HTML からフォーマット化オブジェクト (FO) への変換ガイド", "category": "xml", "body": "HTML 文書を PDF に変換するための手助けが必要ですか？このリファレンス・ガイドでは、よく使用されている 45 の HTML 要素を取り上げ、XSLT テンプレートを使って (XSL-FO 語彙の) フォーマット化オブジェクトに変換し、XSLT を使用して簡単に PDF に変換できるようにする方法を具体的な例で説明します。記載するサンプル・コードは、読者が Apache XML Project の FOP ツールを使用していることを前提としますが、これらの手法のほとんどは、他の XSL-FO ツールを使用する場合にも有効に機能します。" }
,{ "title": "Slim マイクロフレームワークで REST アプリケーションを作成する", "category": "xml", "body": "Slim は、PHP アプリケーションを開発するための機能を完備したオープンソースのマイクロフレームワークです。Slim はその高度な URL ルーターおよびミドルウェア・アーキテクチャーから、静的 Web サイトや API プロトタイピングにとって最適なフレームワークとなっています。この記事では、Slim について詳しく探り、Slim を使用して認証および各種のリクエスト/レスポンス・フォーマットに対応する REST API を迅速に作成してデプロイする方法を説明します。" }
,{ "title": "MicroXML の紹介: 第 1 回 MicroXML の基本原則を探る", "category": "xml", "body": "XML コミュニティーのなかでは、「XML は理解するのも、処理するのも難しい」という XML に対する不満の声が常々聞かれます。XML はさまざまな歴史的理由から、基本的に複雑であるため、この 10 年以上の間に XML を単純化したバージョンがいくつか提案されました。一方で、JSON と HTML5 は XML の最も基本的な考え方の一部を脅かしています。これまでの XML のバージョンと互換性を持ちつつ、XML を単純化した MicroXML は、こうした問題点に関する議論の中から生まれました。現在 MicroXML は、W3C コミュニティー・グループ主導の下で、ドラフト仕様の基本実装が既にいくつか公開されています。全 2 回からなる連載の第 1 回となるこの記事では、MicroXML コミュニティー・グループの共同議長の 1 人である Uche Ogbuji が、MicroXML について、さらには MicroXML と中核的な標準である XML 1.x との技術的な違いについて説明します。" }
,{ "title": "MicroXML の紹介: 第 2 回 microxml-js を使用して MicroXML の処理を行う", "category": "xml", "body": "MicroXML は、これまでの XML のバージョンと互換性を持ちつつ、XML を単純化したものです。この全 2 回からなる連載の第 1 回では MicroXML の基本原則について説明しました。MicroXML は単純な文法で設計されており、数多くある最近の汎用構文解析ツールを使用して処理することができます。MicroXML の当初の活動を率いた James Clark 氏は、MicroXML コミュニティーの仕様に対応するパーサーを検討して開発を行った 1 人です。この記事では、Clark 氏が開発した、JavaScript による MicroXML パーサーを使用して、MicroXML フォーマットを試す方法を説明します。" }
,{ "title": "PHP アプリケーションと Instagram の統合: 第 1 回", "category": "xml", "body": "Instagram は、ユーザーがスマートフォンで写真を撮って、その写真を Web を介して他のユーザーと共有できる、人気の高い写真共有サービスです。アプリケーション開発者は Instagram REST API を使用して、これらの写真を検索し、写真とそれに関連付けられているコメントや「いいね!」の情報を取得することができます。この全 2 回からなる記事では Instagram API を紹介するとともに、Instagram のユーザーが生成した豊富なコンテンツのリポジトリーを利用して革新的な Web アプリケーションを作成するために、この API を PHP で使用する方法を説明します。" }
,{ "title": "XSLT を使用して Atom 1.0 を処理する", "category": "xml", "body": "Atom 1.0 は、Web サイトのコンテンツに関する情報の更新である Web フィードのための新しい IETF (Internet Engineering Task Force) 標準です。Atom は XML フォーマットであることから、Atom を処理するには XSLT が強力なツールになります。このチュートリアルでは、著者である Uche Ogbuji が、XSLT を使用して Atom 文書を処理する手法を実際の事例への対処方法と併せて説明します。" }
,{ "title": "Confluence の Wiki を IBM Connections へマイグレーションする方法", "category": "xml", "body": "developerWorks が Confluence の Wiki のサポートを終了するのに伴い、Confluence の Wiki にページを持つチームや個人は IBM Connections の Wiki にデータをマイグレーションする必要があります。この記事では、その方法について説明します。" }
,{ "title": "外部のコード・チェッカーを Eclipse CDT に統合する", "category": "xml", "body": "Eclipse CDT に組み込まれている C/C++ 用コード解析フレームワークのユーザーにとって、朗報があります。それは、今や皆さんのお気に入りのコード解析ツールを Eclipse 内部で Codan に統合できるようになったことです！" }
,{ "title": "音声処理におけるオープンソース標準への移行", "category": "xml", "body": "多くのオープンソース・プロジェクトは FOSS (Free and Open Source Software) 標準が登場する前に開始されたものであるため、これらのプロジェクトの構成ファイルやリソース・ファイルは単純なフラット・テキスト・ファイルです。これらのファイルを関連するオープンソース標準に対応した形式に変換することで、プロジェクト間での互換性、柔軟性、信頼性を高められる可能性があります。その好例が音声認識における語彙目録です。この記事では Python を使用して、既存の語彙目録のフラット・ファイルを PLS (Pronunciation Lexicon Specification) で定義される XML フォーマットに変換し、その新しい PLS ファイルを再度フラット・ファイルに戻す方法について説明します。さらに、XML フォーマットを使用して語彙目録に情報を追加する方法や、語彙目録の保守を厳密に行う方法についても詳しく説明します。また、Unicode などの問題や、音響モデルの生成にデータを使用しつつ新しい語彙目録を他の XML ファイルとマージする方法についても取り上げます。" }
,{ "title": "Google+ のアクティビティー・ストリームを検索し、PHP アプリケーションと統合する", "category": "xml", "body": "Google の新しいソーシャル・ネットワーキング・サービス、Google+ を使用すると、ユーザーは近況メッセージや最近の出来事を投稿することができます。さらに Google+ API を使用すると、それらのメッセージにアクセスしたり、メッセージを検索したりすることができます。この記事では Google+ API の基本を説明します。例を示しながら、Google+ API を PHP と組み合わせて動的な Web アプリケーションを作成する方法について説明します。" }
,{ "title": "リッチなレイアウトの出版物を HTML5 と CSS3、そして MathML を使用して EPUB 3 で作成する", "category": "xml", "body": "業界標準の XML 電子書籍フォーマットの最新改訂版である EPUB 3.0 は、HTML5 と CSS3 に対応することで、最新の Web 技術を採り入れています。EPUB 3.0 の焦点は引き続き XML 駆動型ツールキットに置かれ、XHTML シリアライズを必要とする他、MathML や SVG などの補足的な XML 語彙を追加しています。EPUB 3 は、デジタル技術の特徴を生かした高度な出版物を作成するための多彩なオプションを提供します。この記事で、EPUB 3 の新機能を使ってリッチなレイアウトのページを作成する方法を学んでください。" }
,{ "title": "PHP で XPath を使用する", "category": "xml", "body": "CRUD 操作以上のことを行う PHP アプリケーションを作成したことがある方は、おそらく XML を扱ったことがあるはずです。しかし XML 文書や XML データ・ストリームをナビゲートして必要なデータ要素を検出する作業は煩雑なものになりかねず、PHP 開発者にとっては尻込みしたくなるほどかもしれません。XML データの構造が複雑な場合は、尚のこと圧倒されてしまうものです。XPath は、まさにそれを唯一の目的とした W3C の標準です。つまり XPath の目的は、適切なデータ要素 (具体的には、目的のノード) にアクセスすることにあります。PHP は XML クラスや XML 関数の一部として XPath をサポートしています。この記事では、XML の中にある情報を検出するためのいくつかの基本シナリオと、XPath が PHP アプリケーションにおける煩雑な処理をどのようにして行うのかを説明します。" }
,{ "title": "型とスキーマを使用して XSLT 2.0 スタイルシートを改善する", "category": "xml", "body": "XSLT 2.0 には型やスキーマを認識する機能があります。この機能はスタイルシートのデバッグに非常に役立ち、あらゆる入力データを処理する上で、スタイルシートの質と確実さを高めます。この記事では、型とスキーマを認識する XSLT 2.0 をデバッグやテストに使用することで、無効なパス、データ型に対する誤った想定、カーディナリティーといった一般的な問題を回避する方法を説明します。また、スキーマ認識機能を使用しない限り検出できない誤りを含む XSLT スタイルシートの例を紹介し、型を明示的に指定することでエラー・メッセージがいかに有用なものになるかについても説明します。" }
,{ "title": "XML データ・マイニング: 第 1 回 さまざまな XML データ・マイニング手法の調査", "category": "xml", "body": "XML はデータを表現、保管、交換する手段として、多種多様な分野で使用されています。この連載では、XML データ分析の一面である XML データ・マイニングについて詳しく探ります。第 1 回となるこの記事では、XML 文書に対して、そこに隠された知識をマイニングするための技術と手法を紹介します。そのなかで、データ、情報の階層構造、そして要素の相関関係をマイニングする方法について説明します。以降の記事で、XML 相関ルールのマイニング、そして複数バージョンの XML 文書のクラスタリングについて、さらに深く掘り下げていきます。" }
,{ "title": "XML データ・マイニング: 第 3 回 XML 文書のクラスタリングによるデータ・マイニングの改善", "category": "xml", "body": "XML 文書のクラスタリングは、XML 文書から相関ルールをマイニングするタスクと同様で、リレーショナル・データをクラスタリングする場合とは異なります。XML フォーマットには、特有の構造と、柔軟性、そして階層構成があるからです。連載「XML データ・マイニング」の第 3 回の記事では、XML データ・マイニングの主要なタスクとして、XML 文書のクラスタリングについて説明します。" }
,{ "title": "XML データ・マイニング: 第 2 回 XML 相関ルールのマイニング", "category": "xml", "body": "この連載の第 2 回では、XML 文書に対して相関ルールをマイニングする手法を説明します。XML 文書とリレーショナル・データとでは、相関ルールのマイニング手法は異なります。XML 言語の柔軟性とその階層構成により、XML では、リレーショナル・データとは異なる方法で情報を構造化できるためです。この記事では、動的相関ルールの概念についても紹介します。XML 文書が変更された場合に、相関ルール検出アルゴリズムを完全に実行し直すことなく、新しいバージョンの XML 文書で相関ルールをマイニングする手法を詳しく探ります。" }
,{ "title": "HTML 用のスタイルシートとして XSLT を使用する", "category": "xml", "body": "XSLT (Extensible Stylesheet Language Transformations) は、名前からもわかるようにスタイルシートとして使用することができます。XSLT を使用すると、CSS (Cascading Style Sheets) を使用したときのようにコンテンツからスタイルを分離することができるだけでなく、XHTML 文書を単純なものにすることや、XHTML 文書に簡単な内容を追加することができるため、XHTML 文書のナビゲーションが容易になります。この記事では XSLT をスタイルシートとして使用する方法について説明します。XSLT はサーバー上で実行することも、最近のブラウザーであれば、どのブラウザーでも実行することができます。この記事で取り上げるいくつかの例から、皆さんも XSLT スタイルシートを作成する方法がわかるはずです。" }
,{ "title": "HTML5 の microdata を活用する: 第 1 回、microdata に対して jQuery を使用する", "category": "xml", "body": "microdata の仕様には microdata を使用する理由が 2 つ挙げられています。1 つは microdata を使用することで、カスタマイズされたサービスを汎用のスクリプトによって Web ページに提供できるようになるからであり、もう 1 つは協力作業に伴う多様な作成者のコンテンツを 1 つのスクリプトによる一貫した方法で処理できるようになるからです。全 2 回からなる連載記事では、この 2 つの目的で microdata を使用する方法を説明します。まず始めに、microdata を使用することによって汎用のスクリプトを適用する方法を取り上げます。今回の記事では 1 つの HTML スニペットを作成します。この HTML スニペットはインタラクティブなイベント・マップを提供すると同時に、リッチ・スニペットを利用することによって Google、Bing、Yahoo に表示される皆さんの Web ページの検索結果を効果的なものにします。" }
,{ "title": "HTML5 の microdata を活用する: 第 2 回、microdata を使用した次世代のアグリゲーション", "category": "xml", "body": "この連載の第 1 回では、microdata を schema.org の用語と組み合わせて使用することで、検索エンジンが検索結果のコンテンツを適切に表示できるようにする方法について説明しました。また、それと同じ microdata のマークアップを再利用し、Web サイト上の表示を改善する方法についても説明しました。この記事では、連携して作業を行うサイト所有者のグループのメンバーが microdata を使用することによって容易にサイト同士を接続し、中央のサイトでコンテンツを共有する方法について説明します。" }
,{ "title": "XQuery を使用した開発: データベース・プログラマーのための優れたプログラミング言語", "category": "xml", "body": "ほとんどのプログラマーは、XQuery 言語はニッチ市場を満たすために開発されたものと考えています。XQuery はデータの照会と変換のための言語であり、XML データの処理用に設計されています。リレーショナル・データベースの場合、XML 以外のデータに SQL を使用し、XML には XQuery を使用するという使い方が増えています。この記事では、XQuery 言語ではプログラミング用に強力な構成体を使用できるため SQL よりもプログラミング言語として優れていること、また優れた表現力と使いやすさから、XQuery を活用することによって XML データ型に重点を置いたデータベースを設計できることを説明します。" }
,{ "title": "HTML5 での SVG (Scalable Vector Graphics)", "category": "xml", "body": "SVG (Scalable Vector Graphics) はベクター・グラフィックスの 1 つです。SVG には JPEG や GIF、PNG などのラスター・グラフィックスよりも優れている点がいくつかあります。この記事では、まず HTML5 での SVG の基本的な概念と使い方について説明し、続いて描画の方法、フィルターとグラデーションの適用方法、テキストの生成方法、そして Web ページに SVG の XML を追加する方法を説明します。" }
,{ "title": "JDBC を使用してデータを XML に抽出する", "category": "xml", "body": "データを保管するには XML が最も適していることから、いずれは、データベースから情報を引き出して、その情報を XML であるかの如く操作することを依頼される日がやって来るはずです。このチュートリアルでは、JDBC を使用してデータベースにアクセスし、SQL を使用して情報を抽出する方法、そして抽出したデータから所定のマッピングに従って XML 文書を作成する方法を説明します。" }
,{ "title": "Flex マイクロブロギング・アプリケーションで pureXMLを利用する: 第 1 回 DB2 pureXML を使って Web サービスを機能させる", "category": "xml", "body": "IBM DB2 の pureXML 機能を使用すれば、XML をそのままの形式でデータベースに保管することができ、XML を変更する必要がありません。一方 Adobe Flex アプリケーションは、XML を直接読み取って Flex ユーザー・インターフェースに取り込むことが可能です。この 3 回の連載記事で作成するマイクロブロギング・アプリケーションでは、pureXML、Web サービス、そして Adobe Flex を利用するだけでなく、さらにマイクロブロギングでの近況アップデートを Twitter に公開することもできます。" }
,{ "title": "QTI の徹底調査", "category": "xml", "body": "IMS QTI (Question and Test Interoperability) 仕様は、e-ラーニングで使われるさまざまな要素 (例えば、設問など) をマークアップするために広く使用されている標準です。QTI アイテムに対する応答処理と結果処理に着目し、受講者が設問に解答すると何が行われるのかを学んでください。" }
,{ "title": "1 つの XSLT スタイルシートを使用して HTML と PDF で XML データを公開する", "category": "xml", "body": "CSSToXSLFO ユーティリティーを使用して HTML と PDF で XML 文書を公開する方法を学びましょう。" }
,{ "title": "RDF の概念と一部のオントロジーに関する最新情報", "category": "xml", "body": "RDF (Resource Description Framework) は、セマンティック Web のための標準的なフレームワークであり、また Linked Data への動きのなかで推奨されるフレームワークでもあります。この記事では RDF の概念に関する仕様の最新情報と、その意味について詳細に説明します、また、データ・カタログ語彙や RDF データベース・マッピング・システムなどの新しいオントロジー仕様についても説明します。" }
,{ "title": "Apache Pivot を使用して iTunes 検索クライアントを作成する", "category": "xml", "body": "Apache Pivot は、Java 環境でリッチ・インターネット・アプリケーション (RIA) を構築するためのオープンソースのプラットフォームです。このプラットフォームには、最近の RIA ツールキットが持つ高い生産性およびユーザビリティーと、業界標準 Java プラットフォームの堅牢性を兼ね備えています。Apache Pivot アプリケーションは XML をベースとしたユーザー・インターフェース設計用の言語である WTKX を利用するため、アプリケーションの出力を簡単に視覚化することができます。このチュートリアルでは、ユーザーが iTunes Storeのコンテンツを検索できるようにする、単純ながらも実用的な Pivot アプリケーションを実装する方法を手順に沿って説明します。" }
,{ "title": "iPad 用の iOS スライドショー・アプリケーションを作成する", "category": "xml", "body": "iOS スライドショー・アプリケーションの作成方法を学びましょう。この記事ではそのプロセスを順を追って説明します。このサンプル・アプリケーションは Web サーバーと通信し、XML で定義されたスライドショーを取得し、そのスライドショーに含まれる画像を表示します。" }
,{ "title": "Drupal と HTML5、さらに microdata を組み合わせる", "category": "xml", "body": "Google、Yahoo、Bing の 3 社が共同で schema.org を発表したことで、microdata はさまざまな Web サイトのデータを利用したアプリケーションを作成する手段として急速に普及が進んでいます。この記事では、Web ページに microdata を追加するために、Drupal を使用する方法を説明します。microdata を追加して、Web ページのコンテンツを Google リッチスニペットなどのアプリケーションで簡単に利用できるようにしてください。" }
,{ "title": "より正確な XSLT スタイルシートを作成する", "category": "xml", "body": "XSLT スタイルシートには、エラーが気付かれないまま簡単に紛れ込んでしまいます。静的エラー・チェックでも、動的エラー・チェックでも検出できないエラーを見つけ出すには、徹底的な機能テストを行うしかありません。XSLT 2.0 では新しいオプションがいくつか導入され、新たな可能性がもたらされるようになりました。そのなかには、スタイルシートの正確性を高め、テストを容易にしてくれるものもあります。この記事では、今までは検出できなかったエラーのチェック機能をスタイルシートに追加する、型システムをはじめとする XSLT 2.0 の新機能を紹介します。" }
,{ "title": "Android 3.0 プラットフォームで XML を作成および構文解析する", "category": "xml", "body": "最もよく使われているスマートフォン・プラットフォームである Android は、モバイル・タブレットでも機能します。XML はデータ交換の標準手段であり、標準的な XML を構文解析および変換するためのビルダー、パーサー、トランスフォーマー API は Android にも適用することができます。この記事では、DocumentBuilderFactory から取得した DocumentBuilder オブジェクトを使用して、Android 機器上で XML 文書を作成して、構文解析を行います。XML 文書の構文解析には、ある XML プル・パーサーを拡張したものを使用します。" }
,{ "title": "Apache HttpClient による Android クライアントを JAX-RS Web サービスに展開する", "category": "xml", "body": "Apache HttpClient ライブラリーを使用して JAX-RS Web サービスにアクセスしてみましょう。RESTful な Webサービスを作成するには、JAX-RS のリファレンス実装である Jersey を使用すると、 Java 環境で簡単に作成することができます。Androidは人気のスマートフォンです。この記事では、Android による JAX-RS クライアントを作成します。具体的には、Apache HttpClientライブラリーを使用して、JAX-RS Web サービスにアクセスするためのクライアントを作成します。" }
,{ "title": "Apache HttpClient による Android クライアントを JAX-RS Web サービスに展開する", "category": "xml", "body": "" }
,{ "title": "Blogger Data API を使用して Blogger のコンテンツを PHP アプリケーションに統合する", "category": "xml", "body": "Blogger は (米国で) 人気のある無料のブログ・プラットフォームであり、このプラットフォームを使用することで、ユーザーは WYSIWYG 編集インターフェースによって独自のブログを作成したり、メッセージやニュースを投稿したりすることができます。REST ベースの Blogger Data API を使用すると、XML 準拠の任意のプログラミング・ツールキットを使用して Blogger のコンテンツにアクセスすることができます。この記事では、Blogger Data API と Zend Framework の Zend_Gdata コンポーネントを使用してブログ・コンテンツの一覧を表示する方法、ブログ記事を追加または編集する方法、ブログ・コメントを操作する方法などについて学びます。そして最後に、Blogger API の強力さを示す単純なアプリケーションを作成します。" }
,{ "title": "Saxon-CE と HL7 CDA を使用してクライアント・サイドのヘルスケア・アプリケーションを実装する", "category": "xml", "body": "XML Prague 2011 カンファレンスにおいて、Saxon XSL/XQuery パーサーの中心的開発者、Michael Kay 博士が Saxon-CE を発表しました。Saxon-CE は JavaScript を使用して Web ブラウザーで実行するクライアント・サイドの XSLT 2.0 パーサーです。この記事では、HL7 CDA (Health Level 7 Clinical Document Architecture) を使用して作成された医療文書を基に動作する単純な医療アプリケーションのビューを、XSLT 2.0 と Saxon-CE を使用して作成する方法を説明します。" }
,{ "title": "モバイル・ブラウザーにチャート機能を追加する", "category": "xml", "body": "PHP、XML、jQuery、jQuery Mobile、そして jQuery のチャート機能を使用して、指で操作しやすくユーザー・フレンドリーな、モバイル環境用のオンライン・アプリケーションを作成しましょう。この記事ではチャート機能を使用してそれぞれのアンケートの結果を表示する、アンケート・アプリケーションのバックエンドとフロントエンドを作成します。" }
,{ "title": "音声と xdotool でキーボードとマウスのアクションをトリガーする", "category": "xml", "body": "xdotool は、プログラマーがキー入力やマウス・アクションをエミュレートする場合に便利な命令ライブラリーです。キーボードやマウスがない場合や、通常の入力方法を使用することが物理的に不可能なユーザーのためのアクセシビリティーに対応する場合、xdotool は特に力を発揮します。この記事の目的は 2 つあります。1 つは Linux デスクトップ環境での xdotool の使い方を紹介すること、そしてもう 1 つは、通常はハードウェア入力によって行われるアクションを音声入力でトリガーすることです。最終的な例では、自動生成されるダイアログ・マネージャー・コードに xdotool 用のコード・フラグメントを挿入し、そのコード・フラグメントを格納するために XML を使用します。" }
,{ "title": "EPUB の完成度を上げる", "category": "xml", "body": "EPUB 文書には、通常の検証方法では検出できない問題が存在する場合があります。EPUB 文書が整形式 XML であると検証され、EPUB 標準に従っている限り、問題はないように見えますが、それでも電子書籍リーダーで正しく読み込めないことがあります。そのような事態が発生するのは、例えば OCR スキャンによってパラグラフの分断、誤ったページ番号付け、スペル・ミスなどが発生した場合です。それでも、2 つの手段を使えば、このような問題を目で確認して修正することができます。その手段とは、Sigil という EPUB エディター、そして SimpleXML と Enchant ライブラリーを組み合わせた PHP スクリプトです。そして正規表現を使用することが、効果的な処理をする鍵となります。" }
,{ "title": "Android で実行するネットワーク対応の○×ゲームを作成する", "category": "xml", "body": "この記事では、フロントエンドとして Android のネイティブ・アプリケーションを使用し、マルチプレイヤーでネットワーク対応の○×ゲームのバックエンドを作成します。" }
,{ "title": "Android の Spring クライアントを JAX-RS Web サービスに展開する", "category": "xml", "body": "Java エンタープライズ・アプリケーションを実行するためのプラットフォームである Spring には、生産性やランタイム・パフォーマンスを向上させることができるなど、さまざまな利点があります。この Spring フレームワークを、Android アプリケーションの開発を単純化する目的で拡張したのが、Spring Android です。Spring Android の主な特徴としては、Android 対応の REST クライアント、そしてセキュア API にアクセスするための Auth サポートがあります。この記事では、Spring Android REST クライアントを使って RESTful な Web サービスにアクセスします。" }
,{ "title": "Identi.ca で PHP を使用する: 第 2 回", "category": "xml", "body": "Identi.ca は、ユーザーが近況メッセージやニュースを投稿できる、人気の高い無料のマイクロブロギング・サービスです。Web アプリケーション開発者は Identi.ca API を使用して、これらのメッセージにアクセスしたり、これらのメッセージを作成、検索したりすることができるようになっています。この 2 回連載の記事では Identi.ca API について紹介し、この API を PHP で使用して動的な Web アプリケーションを作成する方法を説明します。" }
,{ "title": "GPS 対応の Web アプリケーションを作成する", "category": "xml", "body": "この記事では PHP を使用して、GPS 対応の Web アプリケーションのバックエンドとフロントエンドを作成する手順を説明します。" }
,{ "title": "jQuery Mobile で Web アプリケーションのセキュリティーを強化する", "category": "xml", "body": "多くの Web 開発者は、セキュリティーをあまり高い優先順位で考えていません。セキュリティーについては後から補足すればよいものとして、ソフトウェア開発ライフサイクルの最後に追いやられることがよくあります。時には、ソフトウェア・セキュリティーがまったく無視されて、その結果、一般的な脆弱性に溢れたアプリケーションになることもあります。このようなバグは攻撃されて初めて明らかになるため、脆弱性を悪用するプロセスがどのように機能するかを知っていなければ、攻撃される前にバグを検出するのは困難です。このチュートリアルでは、jQuery Mobile、PHP、および MySQL で作成した Web アプリケーションを使用して、さまざまな脆弱性がどのようにして生じるのかを、それらの脆弱性を悪用する一般的な手法とともに説明し、さらに最も重要な点としてそれぞれの対策について説明します。" }
,{ "title": "PHP を使用した実用的なデータ・マイニングと構文解析の手法を探る", "category": "xml", "body": "データ・マイニングがカバーしている分野は広範にわたるため、2 人の開発者とデータ・マイニングについての話をすると、2 人が持っているデータ・マイニングの概念は非常に異なることがわかります。この記事では、データ・マイニングとは何か、データ・マイニングの重要性、そしてデータ・マイニングを実現する (つまり Web ベースのデータ・マイニング・ツールを設計する) ためのさまざまな方法を学びます。そして、XML 構造を理解した上で、PHP 技術を使用して XML およびその他のデータを構文解析する方法を学びます。" }
,{ "title": "EPUB で電子書籍を作成する", "category": "xml", "body": "文書を配布したり、電子書籍を作成したり、あるいは単にお気に入りのブログ投稿をアーカイブしたりする必要はありませんか？ EPUB は、XML、CSS、XHTML などのお馴染みの技術をベースとした電子書籍のためのオープン仕様です。EPUB ファイルは携帯型の電子書籍リーダーや携帯電話、そしてデスクトップ・コンピューター上でも読み取ることができます。このチュートリアルでは EPUB フォーマットを詳細に説明し、Java 技術を使用して EPUB を妥当性検証する方法を説明した後、DocBook と Python を使ってEPUB の作成を自動化する手順をステップ・バイ・ステップで説明します。" }
,{ "title": "最先端の XML 圧縮手法の調査", "category": "xml", "body": "XML は、World Wide Web でデータを表現し、交換するための標準と見なされています。優れた柔軟性を持つ XML は幅広く受け入れられていますが、XML 文書のサイズが大きいという難点があります。サイズが大きいということは、送信、処理、保管、問い合わせ処理の対象となる情報の量が他のデータ形式よりも多くなりがちであることを意味します。この問題に対処するための XML 圧縮手法には、いくつかの選択肢があります。そこで、この記事では最新の XML 圧縮手法について概説します。" }
,{ "title": "Identi.ca で PHP を使用する: 第 1 回", "category": "xml", "body": "Identi.ca は、ユーザーが近況メッセージやニュースを投稿できる、人気の高い無料のマイクロブロギング・サービスです。Web アプリケーション開発者は Identi.ca API を使用して、これらのメッセージにアクセスしたり、これらのメッセージを作成、検索したりすることができるようになっています。この 2 回連載の記事では Identi.ca API について紹介し、この API を PHP で使用して動的な Web アプリケーションを作成する方法を説明します。" }
,{ "title": "XSLT 2.0 を使用してコンテンツに構造とセマンティクスを追加する", "category": "xml", "body": "既存のコンテンツを 電子書籍形式や DITA、あるいはその他の構造化標準の形式に変換するときには、その構造を推測して文書に追加することがよくあります。このように構造の追加によってコンテンツを変換して強化するには、高度な正規表現とグループ化機能を備えた XSLT 2.0 が理想的な言語です。この記事では、構造化されていない、あるいは半構造化された、文章によるコンテンツをより構造化された XML 語彙の形式に変換する際にとりわけ役立つ XSLT 2.0 の機能を紹介し、いくつかの一般的なシナリオでこれらの機能を使ってみます。" }
,{ "title": "PHP を使用して PDF ファイルを動的に作成する", "category": "xml", "body": "この記事では PHP を使用して PDF ファイルを動的に作成するプロセス全体を見て行きます。Free PDF ライブラリー (FPDF) や PDFLib-Lite などのオープンソース・ツールと PHP コードを使用し、内容に合わせて PDF フォーマットを制御する方法を試してみましょう。" }
,{ "title": "データの増大とそれに関連する標準", "category": "xml", "body": "" }
,{ "title": "データの増大とそれに関連する標準", "category": "xml", "body": "" }
,{ "title": "データの増大とそれに関連する標準", "category": "xml", "body": "" }
,{ "title": "データの増大とそれに関連する標準", "category": "xml", "body": "" }
,{ "title": "データの増大とそれに関連する標準", "category": "xml", "body": "この記事ではデータの急増によってもたらされる問題と、それに関するアナリティクスについて詳しく探り、この問題に関連する標準を紹介します。サンプル・シナリオでは、大量のデータを取り込んで、それを解釈して操作するシステムを用いて、特定の標準が統合および相互運用性を促進する仕組みを説明します。" }
,{ "title": "ペーパーレス・オフィスへの移行に向けて、会計監査への対応に画像を使用する", "category": "xml", "body": "経営陣は監査役に対して定期的に解説文書を提供しますが、紙ベースのオフィスでは、これは不便なうえに困難なタスクになりがちです。そこでこの記事では、XML を PHP および画像関数と組み合わせて使用して監査プロセスを支援し、さらに複数の経営陣を対象とした効率的かつ包括的な索引付けサポートを提供する方法について説明します。" }
,{ "title": "テスト不能な PHP コードをリファクタリングするための戦略", "category": "xml", "body": "最近の開発者の多くは、スパゲティー・コードとお粗末な設計が多々見られるレガシー・プロジェクトを引き継いでいます。彼らが最初にする仕事はたいていの場合、ユニット・テストの作成とリファクタリングですが、設計の目的が明確ではないコードのユニット・テストはどこから手を着ければよいのでしょう？この記事では、テストの容易な PHP コードに関するいくつかのアンチパターンと、コードをリファクタリングして容易にテストを行う方法について説明します。" }
,{ "title": "3270 または 5250 のデータを Webベースのマッシュアップ・アプリケーション内で活用する", "category": "xml", "body": "IBM® Rational® Host Access Transformation Services を使用して 3270 または 5250 のデータを抽出する方法を学習します。抽出したデータは Atom データ・フィードに変換できます。このデータ・フィードを IBM Mashup Center で活用し、他のデータ・ソースと統合することにより、ビジネス・ユーザー向けの新しい状況依存型アプリケーションを作成できます。また、3270 財務アプリケーションからデータを抽出する例も紹介します。この例では、抽出したデータから Atom フィードを作成してカタログに登録し、そのデータを使ってローン担当者用の情報ダッシュボードを作成します。" }
,{ "title": "現在利用できる XML ツールの調査", "category": "xml", "body": "" }
,{ "title": "現在利用できる XML ツールの調査", "category": "xml", "body": "" }
,{ "title": "現在利用できる XML ツールの調査", "category": "xml", "body": "" }
,{ "title": "EXPath HTTP Client を使用して Web サービスを扱う", "category": "xml", "body": "" }
,{ "title": "現在利用できる XML ツールの調査", "category": "xml", "body": "XMLは e-コマースからニュース・フィード、そして検索エンジンに至るまで、多種多様な領域で使用されています。さらに XMLに関連した技術として、XSLT、XPath、XPointer などの技術もあります。このように XML がますます広く使われるようになるなか、XMLのツールとこれらのツールが提供する機能を認識しておくことは、特に重要になってきています。XMLの処理には、フォーマット設定、構文解析、編集、妥当性検証、そして他のフォーマットへの変換がありますが、市場に出回っている XMLツールのほとんどは、その多くの機能をまとめて提供しています。この記事ではさまざまなカテゴリーの XMLツールについて、その代表例をさまざまなベンダーが提供しているなかから取り上げて、詳しく探ります。" }
,{ "title": "EXPath HTTP Client を使用して Web サービスを扱う", "category": "xml", "body": "さまざまな XML 技術に共通の拡張機能を定義する EXPath は、明確に定義された関数ライブラリーを使用して簡単に移植可能なアプリケーションを作成できるようにすることを目標とした、コミュニティーの主導による取り組みです。この取り組みによって定義された EXPath HTTP Client モジュールでは、HTTP および HTTPS リクエストの送信を可能にする関数一式を定義しています。この記事では、この EXPath のライブラリーを使用して XSLT と XQuery の両方から HTTP の処理を行う方法について説明します。さらに、XQuery と EXPath HTTP Client モジュールを使用して作成した基本的な HTTP テスターで HTTP リクエストをテストする方法についても説明します。" }
,{ "title": "データ・マイニング・ツールとして XML を追加する", "category": "xml", "body": "この記事では、データ・マイニングにおける XML の使用法と機能について調べ、パターン・マッチング、変更検出、検索および類似性検出、データ・アノテーション、セマンティクスのために XML を使用するヒントと手法について説明します。" }
,{ "title": "Erlang プログラミング入門: 第 2 回 高度な特徴や機能を使用する", "category": "xml", "body": "Erlang は、主に並行システムの開発と分散システムの開発に使用される、多目的のプログラミング言語です。この記事では基本的な関数から並行プログラミング、プロセス、そしてメッセージングへと話題を移し、高度な特徴や機能のいくつかを使用してみます。これらの高度な特徴や機能が連動することによって、Erlang の強力な特徴である分散プログラミングをサポートします。" }
,{ "title": "XPath の道を外れないために", "category": "xml", "body": "この記事で説明する 5 つのヒントを適用して XPath を使ってみてください。この記事では、2 値論理に関する意外な事実を明らかにし、XPath の position() 関数の値がコンテキストによってどのように変わるのかを説明します。さらに、XPath を使用して特定の名前を持つ最初の要素を選択する方法、そして最もよく起こりがちで、しかも難しい不具合をデバッグする方法を伝授します。" }
,{ "title": "SugarCRM の REST Web サービスを拡張し、XML を使用する", "category": "xml", "body": "SugarCRM 5.5 の登場により、Web サービスのフレームワーク全体が強化されました。既存の SOAP のサポートを補完するために REST のサポートが追加されただけではなく、ビジネス・アプリケーションを容易にサポートするために、安全にアップグレードできる形で Web サービスをカスタマイズできるようになりました。SugarCRM の REST Web サービスは、その初期設定では Web サービスとやり取りをするデータ・フォーマットとして、JSON と、シリアライズされた PHP データを使用します。この記事では、SugarCRM のインスタンスでデータを送受信する際のデータ・フォーマットとして XML を追加するのがいかに容易であるかを説明します。" }
,{ "title": "PHP と MediaWiki API を使ってウィキペディアの情報に接続する", "category": "xml", "body": "究極のオンライン百科事典であるウィキペディアには、人間の知識のさまざまな側面に関する何百万ものエントリーがあります。これらのエントリーに対して、Web アプリケーション開発者は Wikipedia API を使用してアクセスし、検索することができます。この記事では Wikipedia API を取り上げ、この API を PHP アプリケーションのコンテキストで使用する例として、ウィキペディアのコンテンツに含まれる各種の要素を PHP を使って検索および取得する方法を説明します。" }
,{ "title": "Erlang プログラミング入門: 第 1 回 基本", "category": "xml", "body": "Erlang は、主に並行システムの開発と分散システムの開発に使用される、多目的のプログラミング言語です。Erlang の始まりは、Ericsson 社が自社の電気通信アプリケーション開発用に設計した専用のプログラミング言語でしたが、1998年以降はオープンソースとして公開されています。Erlang は Facebook チャット・システムなどの注目度の高いプロジェクトや、CouchDB ドキュメント指向データベース管理システムなどの革新的オープンソース・プロジェクトに採用されていることから、ここ数年の間、広範に使用されるようになってきました。この記事では、Erlang の概要、そして Erlang の関数型プログラミング・スタイルと他のプログラミング・パラダイム (命令型、手続き型、そしてオブジェクト指向のプログラミングなど) との違いを説明した後、初めての Erlang プログラム、フィボナッチ再帰関数を作成します。次に、C や C++、そして Java や Python を使い慣れている開発者にとって最初は難関となりがちな、Erlang 言語の基本をひと通り説明します。" }
,{ "title": "W3C の SKOS 標準を使用してタクソノミー管理を改善する", "category": "xml", "body": "最近まで、統制語彙、タクソノミー、シソーラスのためのツールは、どのツールも独自フォーマットでデータを保存していたため、それらのデータを外部システムと統合するのは困難でした。W3C の SKOS 標準では、柔軟で移植可能な統制語彙フォーマットを定義しています。このフォーマットは次第によく使われるようになってきていると同時に、セマンティック Web 技術を使用するための初歩的なステップに適しているというメリットがあります。" }
,{ "title": "DITA の特殊化と拡張により、ユース・ケース・ドキュメントを作成する", "category": "xml", "body": "要件の収集とドキュメント作成とを組み合わせ、それを開発マネージャー、開発者、テスター、テクニカル・ライターが開発サイクル全体にわたって活用できるようにする方法を学びましょう。DITA (Darwin Information Typing Architecture) の柔軟な拡張メカニズムは、この種の作業の業界標準になりつつあります。この記事では、ユース・ケース・ドキュメントを作成するための特殊化されたスキーマを作成します。" }
,{ "title": "高度なスプレッドシート・エクスポート機能と PHP を組み合わせてピボットテーブルを作成する", "category": "xml", "body": "Microsoft Excel の高度なエクスポート機能と PHP を使って、柔軟なピボットテーブルを XML フォーマットで作成しましょう。すると皆さんもユーザーも、ピボットテーブルのデータを瞬時にソートしたり分析したりすることができます。" }
,{ "title": "WebSphere Application Server 7.0 XML Feature Pack Technology Preview の概要", "category": "xml", "body": "IBM WebSphere Application Server 7.0 Feature Pack for XML 1.0.0.9 Technology Preview には、XQuery モジュールのサポート、組み込み拡張機能関数、ランタイム・エラー発生時のソースの場所の情報提供など、重要な新しいフィーチャーが含まれています。これらのフィーチャーは、開発者がクエリーやスタイルシートを管理および操作するのを支援し、開発の効率を高め、保守コストを削減します。" }
,{ "title": "IBM Mashup Center で FusionCharts Free グラフ・ウィジェットを使用する", "category": "xml", "body": "カスタマイズ可能で非常に豊富な表示機能を持つグラフ・ウィジェットの構築を学習します。グラフ化するデータと表示のカスタマイズは XML で指定します。また、IBMMashup Center のデータ・マッシュアップ・エディターを使用して、このようなウィジェット用の XMLを生成する方法も学習します。最後に、データに基づいて表示エレメントが動的に変化するサンプル・マッシュアップを構築します。" }
,{ "title": "XML と PHP を使用し、複数の電話機に対応した柔軟性のある電話帳と連絡先リストを作成する", "category": "xml", "body": "出張や外出の多いビジネスマンは、どのような電話機を使用する場合にも、常に同じ、信頼できる連絡先リストにアクセスする必要があります。卓上の SIP フォンやスマートフォンにデータを提供する MySQL データベースのサンプルと PHP を使用して、同じデータベースから取得したデータを卓上の電話機またはスマートフォンに合うようにカスタマイズした XML として出力する方法、あるいはどちらの電話機にも適した XML として出力する方法を学びましょう。" }
,{ "title": "XQuery を使ってコンテンツを分類する", "category": "xml", "body": "XML などの半構造化データと非構造化データの増加に伴い、簡単かつ迅速に、より関連性を持ったクエリーを行えるように、コンテンツをカテゴリー分けして分類する必要が出てきています。この記事では、XQuery を使用したコンテンツおよび構造の解析に基づくコンテンツのカテゴリー分けにより、XML 文書に自動的にタグを付ける数々の手法について試してみます。" }
,{ "title": "JavaScript による手軽なデータ・アクセス・レイヤーを構築する", "category": "xml", "body": "この記事では、バックエンドのデータベースにアクセスするためのラッパーを PHP で作成し、そのラッパーと JavaScript で作成したユーザー・インターフェース・レイヤーのアクセス・ラッパーを接続するというプロセス全体について、順を追って説明します。" }
,{ "title": "XML の論考: SVG、そしてスクリプトを使わずに作成するスクリプト", "category": "xml", "body": "今、さまざまな形で力を発揮できる SVG (Scalable Vector Graphics) ブラウザーが主流になってきています。David による以前の SVG に関する記事の続編として、Dethe がアニメーション用のスクリプトやその他のスクリプト作成タスクの代わりとして宣言型マークアップを使用する方法を検討します。その過程のなかで、スクリプトを他の XML 方言の宣言型マークアップに置き換える場合についても簡単に説明します。一般的なスクリプト作成タスクを宣言型マークアップにすることで、面倒なボイラープレート・コードを作成する必要がなくなり、エラーが減り、スクリプトの意図に沿いやすくなることから、コード固有の側面に専念できるようになります。" }
,{ "title": "oEmbed と PHP を使ってサード・パーティーのコンテンツにアクセスする", "category": "xml", "body": "oEmbed は、サード・パーティーのコンテンツ共有サイトにあるコンテンツを Web ページに埋め込んで表示するための仕様です。oEmbed API について紹介するこの記事では、PHP アプリケーションのコンテキストで oEmbed API を使用する具体的な例として、Flickr、YouTube、Slideshare、Wikipedia などの人気のサイトからのコンテンツを埋め込む方法を説明します。" }
,{ "title": "JAXB を使用して IBM Cloud イメージのパラメーターを Java に変換する", "category": "xml", "body": "IBM Cloud (IBM Smart Business Development and Test on the IBM Cloud) イメージのイメージ・パラメーターを取得するには、イメージの記述に含まれているマニフェストと呼ばれる URL を使用します。この URL からは、XML レスポンスが返されます。この記事では、POJO (Plain Old Java Object) を作成して JAXB の unmarshal メソッドを呼び出すことで、この返された XML レスポンスを Java で扱うのに適した形に変換する方法を説明します。この方法では、一旦このレスポンスが得られると、パラメーターを必要とするイメージをベースに新しいインスタンスを作成するためのリクエストを Java クラスから容易に送信できるようになります。" }
,{ "title": "履歴書に XML 構造を追加する", "category": "xml", "body": "この記事では、XML による構造を使用して履歴書関連のデータを格納する方法を探ります。HR-XML プロジェクトと OAGIS (Open Applications Group Integration Specification) プロジェクトの要素を使用してデータ・ファイルとスタイルシート・ファイルを作成し、Apache FOP (Formatting Objects Processor) を使用して履歴書のサンプルを PDF ファイルとして生成します。特に興味深い点として、複数の名前空間を扱う方法、スタイルシートを使って基本的な PDF に装飾を追加する方法についてのヒントを説明します。" }
,{ "title": "移植可能な XSLT ユーティリティーを作成する", "category": "xml", "body": "ヘルプ・システム、保守用のドキュメント、ウィキなどのオーサリング・プロジェクト用に作成される XML 文書は、複雑であると同時に、文書間および文書内でのリンクに大きく依存しがちです。この実用的なガイドでは、XML 文書を作成する際の繰り返し作業を自動化するために役立つ軽量のユーティリティーを作成します。" }
,{ "title": "W3C XSD と OASIS CAM を使用して、3 つのレベルで分類するタクソノミーによるモデリング戦略を作成する", "category": "xml", "body": "問題領域を記述するための語彙を作成する場合、問題領域を 3 つのレベルで分類するタクソノミーを使用していることに気付くことがよくあります。例えば会計アプリケーションの場合、ある 1 つの元帳レコードをカテゴリー (借方または貸方) で区別し、次にそれらのカテゴリーの中でタイプとサブタイプに分類する場合があります (例えば「以前の未払いによる累積利息」の場合であれば、貸方/利息/未払費用、という 3 つに分類することができます)。XML 内のこうした構造をデータの要件に応じてモデリングする方法は何通りもあり、また多種多様なスキーマの手法を利用することで、そうしたモデリングを強制することができます。ここでは 2 つのスキーマによる方法について説明します。1 つは W3C の XSD (XML Schema Definition) による方法、もう 1 つは OASIS (Organization for the Advancement of Structured Information Standards) の CAM (Content Assembly Mechanism) による方法です。" }
,{ "title": "Excel 2007 XML を OASIS コード・リストに変換する", "category": "xml", "body": "OASIS 仕様の 1 つである Genericode は、コード・リストまたは権限リストをXML にエンコードするための XML 語彙です。これらのリストを作成および保守するビジネス・ユーザーは、一般に Microsoft Office のソリューションに慣れてはいても、XML 技術には堪能ではありません。この記事では、コード・リストの作成および保守に Microsoft Office Excel 2007 スプレッドシートを使用する方法を説明し、さらに XSLT を使用してそのスプレッドシートをオンライン・フォームなどのアプリケーションからも容易に利用できる標準準拠の Genericode に変換する方法を説明します。" }
,{ "title": "ヒント: XSLT の極意", "category": "xml", "body": "XSLT のコーディングは尻込みしたくなる作業に思えるかもしれませんが、2 つの単純な質問に答えることができれば、あとはそれほど難しくありません。この記事で説明する単純な方法を使えば、10 分で今までよりもはるかに明確に XSLT の基本を理解することができます。" }
,{ "title": "土台から構築する iPhone のチャット・アプリケーション", "category": "xml", "body": "この記事では、サーバーからフロントエンドのユーザー・インターフェースに至るまで、iPhone のチャット・アプリケーションを構築する全過程を説明します。" }
,{ "title": "ヒント: XSLT の識別テンプレートを使って XHTML を変換する", "category": "xml", "body": "XHTML は単なる整形式の HTML ではありません。XHTML では特定のタグを適切に閉じなければなりません。適切に閉じられていないタグは妥当な XML ですが、ブラウザーはそれらのタグを適切に構文解析することができないため、動的な Web 2.0 機能で問題が発生する可能性があります。XML を XHTML に変換する場合であれ、単に XHTML をフィルタリングする場合であれ、その XHTML が W3C 推奨のプラクティスに従った適切な XHTML になるようにするには、どんな XSLT テンプレートが必要であるかを学びましょう。" }
,{ "title": "Facebook API 入門", "category": "xml", "body": "皆さんのアプリケーションに Facebook の機能を組み込むことができます。モバイルの観点から見ると、Facebook Platform はモバイル Web アプリケーション用の API をサポートしており、また iPhone、iPad、および Android プラットフォームにネイティブなモバイル・アプリケーション用のモバイル SDK もサポートしています。この記事では、Facebook Platform API と Facebook SDK for Android (Facebook のモバイル・チームがリリースした SDK) について説明します。" }
,{ "title": "Facebook API 入門", "category": "xml", "body": "" }
,{ "title": "Google スプレッドシートのデータを PHP で統合する: 第 1 回", "category": "xml", "body": "Google スプレッドシートは、よく知られているクラウド・ベースのスプレッドシート・アプリケーションです。Web アプリケーション開発者は、Google Spreadsheets Data API を使用してオンライン・スプレッドシートにアクセスし、データを検索できるようになっています。この記事では Google Spreadsheets Data API を取り上げ、この API を PHP アプリケーションのコンテキストで使用する例として、スプレッドシートに含まれるさまざまな要素を検索し、取得する方法を説明します。" }
,{ "title": "Google スプレッドシートのデータを PHP で統合する: 第 2 回", "category": "xml", "body": "Google スプレッドシートは、よく知られているクラウド・ベースのスプレッドシート・アプリケーションです。Web アプリケーション開発者は、GoogleSpreadsheets Data API を使用してオンライン・スプレッドシートにアクセスし、データを検索できるようになっています。この記事では GoogleSpreadsheets Data API を取り上げ、この API を PHPアプリケーションのコンテキストで使用する例として、スプレッドシートのさまざまな要素を追加、変更、そして削除する方法を説明します。" }
,{ "title": "Google スプレッドシートのデータを PHP で統合する: 第 2 回", "category": "xml", "body": "" }
,{ "title": "IBM Blockchain Platform Starter プランで Hyperledger Fabric ネットワークを立ち上げよう", "category": "cloud", "body": "IBM Blockchain Platform Starter プランの立ち上げ方とその活用方法についてご紹介します。" }
,{ "title": "IBM Blockchain Platform を支えるハイセキュリティ基盤「LinuxONE」", "category": "cloud", "body": "ブロックチェーンを稼動させるうえにおいて、そのプラットフォーム基盤におけるセキュリティは非常に重要なポイントになります。本稿では IBM Blockchain Platform Enterprise プランを基盤として支える LinuxONE のセキュリティについて解説させていただきます。" }
,{ "title": "ラムダ関数による迅速なプロトタイピング", "category": "cloud", "body": "管理作業を可能な限り少なくするという、クラウドが提示する展望は、ラムダの持つサーバーレスであるという特性によって満たされます。この新しいクラウド・パラダイムでは、より簡単にプロトタイピングや実験を行うことができ、これまでよりも短時間でフィードバックを収集できるようになります。この記事では、ワークフローをいかに効率化できるか、ワークフローの効率化が初期段階のクラウド・プロジェクトにどのような意味を持つのか、そしてこの新しいパラダイムがどのようにコンテナーに適合するのかを探ります。" }
,{ "title": "スマートフォンを IoT デバイスに変身させる", "category": "cloud", "body": "スマートフォンをセンサー・デバイスに変身させる方法、スマートフォンからクラウド内の Watson IoT プラットフォームにセンサー・データを送信する方法、そしてセンサー・データを処理して視覚化する IBM Cloud アプリケーションを作成する方法を学んでください。このチュートリアルでは、Internet of Things サービスと Node-RED サービスを利用する Android アプリと 2 つの IBM Cloud アプリを作成します。" }
,{ "title": "Hyperledger Fabric 入門, 第 3 回: コンセンサス/Ordering Service/Kafka/Zookeeper", "category": "cloud", "body": "第 3 回は Hyperledger Fabric のコンセンサス、Ordering Service について紹介します。" }
,{ "title": "IBM Cloud 上の Decision Composer で大きく視野を広げる", "category": "cloud", "body": "このチュートリアルの手順に従って、Decision Composer アプリケーションを Business Rules サービスにデプロイし、Hadoop 内で実行する方法を学んでください。IBM Cloud Liteは無償で利用できます。" }
,{ "title": "IBM Cloud Continuous Delivery の紹介, パート 2: IBM Cloud サービスを利用するアプリをデプロイする", "category": "cloud", "body": "IBM Cloud と IBM Cloud Continuous Delivery を紹介するこのシリーズで、これらの製品をどのように利用して時間の無駄をなくすのかを把握してください。このパート 2 では、パート 1 で作成した単純なアプリを使用して、IBM Cloud サービスを利用するアプリをデプロイする方法を説明します。続くパート 3 では、IBM Cloud の新しいサービスを利用するコードを作成する方法を説明します。パート 4 では、Delivery Pipeline サービスを利用する方法を説明します。このサービスを利用して、チームの他のメンバーがプロジェクトのリポジトリーにコードをプッシュするたびに自動的にアプリケーションが IBM Cloud にデプロイされるようにします。" }
,{ "title": "Hyperledger Fabric 入門, 第 2 回: Peer/チャネル/Endorsement Policy の解説", "category": "cloud", "body": "今回は第 1 回でも取り上げた Peer について詳しく紹介します。また Peer と関係性のあるチャネル、Endorsement Policy についてもあわせて紹介します。" }
,{ "title": "マイクロサービス / Dockerコンテナー / Kubernetes 概要", "category": "cloud", "body": "本プレゼンテーションは 2018年3月7日 (水)、3月13日 (火) 実施の Web セミナー &quot;今日から始めるクラウド・ネイティブ・コンピューティング&quot; の説明資料を改編したものです。" }
,{ "title": "IBM Cloud をプラットフォームとして選択する理由のトップ10", "category": "cloud", "body": "このトップ 10 リストでは、なぜ開発者はクラウド・プラットフォームとして IBM Cloud を選択することになるのかという点について Carl Osipov が見解を示します。" }
,{ "title": "IBM Cloud の Node.js アプリケーション用に多要素認証を構成する", "category": "cloud", "body": "パスワードは完全なセキュリティー・ソリューションではありません。パスワードは盗まれることもあれば、共有されることもあります。このチュートリアルでは、2 つ目の認証要素として e-メールによって提供されるランダムな文字列を使用する方法を説明します。さらに、2 つ目の認証要素を要求するのが妥当かどうかを判断するためにアプリケーションが使用する、リスク分析のいくつかの方法についても取り上げます。" }
,{ "title": "Data Science Experience (Watson Studio) で始めるデータ分析", "category": "cloud", "body": "Data Science Experience（DSX）とは、分析に必要なツールがまとまった環境です。この記事では、DSX を IBM Cloud から利用し、データの可視化や予測を行います。" }
,{ "title": "Hyperledger Fabric 入門, 第 1 回: 基本的な構成", "category": "cloud", "body": "Hyperledger Fabric の基本的な構成について紹介します。" }
,{ "title": "IBM Blockchain Platform にアプリケーションをデプロイする", "category": "cloud", "body": "このチュートリアルでは、IBM Blockchain Platform (Enterprise Membership Plan) 上にネットワークを作成し、そのネットワーク上のチャネル内にスマート・コントラクト (チェーンコード) をインストールして、サンプル・アプリケーションをネットワークにデプロイする方法を説明します。さらに、共有レジャーにデータを取り込む方法、レジャーに対してクエリーを実行する方法、レジャーを更新する方法も学んでください。" }
,{ "title": "PHP アプリケーションを自動的にテストして IBM Cloud にデプロイする", "category": "cloud", "body": "このチュートリアルで、無償の IBM Cloud Continuous Delivery サービスを利用して、IBM Cloud へのデプロイと GitHub コード・リポジトリーを関連付ける方法を学んでください。このチュートリアルでは、PHP アプリケーションをモニターして GitHub から IBM Cloud 開発環境にデプロイするように IBM Cloud Continuous Delivery ツールチェーンを構成するプロセスを案内します。さらに、Travis CI を統合して、GitHub コード・リポジトリー内でプル・リクエストを作成、テスト、マージできるようにする方法も説明します。" }
,{ "title": "Hyperledger Composer を使用して強力なブロックチェーン・クエリーを作成する", "category": "cloud", "body": "Hyperledger Composer に組み込まれているネイティブのリッチなクエリー言語を使用すると、資産、トランザクション、その他のリソースに関する複雑かつ強力なクエリーを簡単に実行できます。それにはまず、Hyperledger Composer を使用してクエリーをモデル化し、そのクエリーをランタイム Hyperledger Fabric にデプロイします。後は、アプリケーション内で名前別にクエリーを使用すればよいだけです。さらに、Hyperledger Composer によって自動的に生成される REST API を使って、簡単にクエリーを使用することもできます。この機能がなかったとしたら、コード内でアドホック・クエリーを作成した後、返される結果を理解するのに苦労することになっていたでしょう。" }
,{ "title": "IoT アーキテクチャーによって IoT ソリューションの開発を単純化する", "category": "cloud", "body": "データ駆動型 IoT アーキテクチャーを計画する際は、この記事で説明する戦略を適用してください。これらの戦略は、開発を単純化し、複雑さに対処するのに役立ちます。さらに、IoT ソリューションのスケーラビリティー、柔軟性、堅牢性を確保する上でも効果があります。" }
,{ "title": "ビジネスブロックチェーン本格展開のためのプラットフォーム「IBM Blockchain Platform」", "category": "cloud", "body": "ビジネスでブロックチェーンを使うためのプラットフォーム「IBM Blockchain Platform」をご紹介します。" }
,{ "title": "モノのインターネットに関する人気の記事とチュートリアル", "category": "cloud", "body": "この記事に、これまでに抜粋した最もよく読まれているチュートリアルのすべてを集めています。" }
,{ "title": "PHP、jQuery Mobile、Google ToDo リストを活用してモバイル・フレンドリーな ToDo リスト・アプリを作成する", "category": "cloud", "body": "ToDo リストを作成および管理するためのシンプルなモバイル・アプリを作成したければ、Slim PHP マイクロフレームワーク、jQuery Mobile、Google ToDo リスト API を使用すると簡単です。この記事では、私がそれを行った方法を紹介します。" }
,{ "title": "IoT 初級編: IoT 開発を開始する", "category": "cloud", "body": "この developerWorks クイック・スタート・ガイドに従って、IoT ソリューションの開発を開始してください。「IoT 初級編」は、モノのインターネット・テクノロジーに初めて取り組むアプリケーション開発者と、迅速に開発を進めるための手段を探しているアプリケーション開発者を対象としています。" }
,{ "title": "次の IoT プロジェクトに最適なハードウェアを選択する", "category": "cloud", "body": "この記事では、IoT で一般的に使用されているマイクロコントローラー (例えば Arduino)、シングル・ボード・コンピューター (例えば Raspberry Pi)、組み込みデバイスなどの各種のハードウェアについて、特定の機種に偏ることなく概観します。IoT のコンテキストで、ハードウェアの大まかな構成要素と主要な特性を、必要なセキュリティー機能とファームウェア機能の概要を織り交ぜて紹介するとともに、特定の IoT プロジェクト向けに開発者が特定のタイプのハードウェアを他に優先して選択することになる局面、場所、理由に関するガイダンス、そしてさまざまな業界での使用事例を説明します。" }
,{ "title": "モノのインターネットの中ですべてのモノを接続する", "category": "cloud", "body": "この IoT 接続ガイドでは、IoT ネットワーキング向けに広く採用されているテクノロジーと標準を紹介し、特定のネットワーク・プロトコルを優先的に選択するほうがよいことがあるのはなぜなのかを説明します。また、IoT でのネットワーキングに関する主な考慮事項と課題についても取り上げます。" }
,{ "title": "IBM Cloud の紹介", "category": "cloud", "body": "IBM Cloud 内でアプリケーションの開発とデプロイを開始する方法をご覧ください。Doug Tidwell が、世界中で利用できるアプリを開発してデプロイする際の基本的な手順を説明します。" }
,{ "title": "Watson Assistant (Watson Conversation) の使い方を学ぶ", "category": "cloud", "body": "この記事ではチャットボットを開発するために必要な Watson Assistant の技術的な解説をします。最低限必要な Watson Assistant の知識を付け、この記事をベースにユニークなサービスを作りましょう。なお、今回の解説範囲にチャット画面 (LINE や Slack、独自開発の UI) との連携部分については含まれません。予めご了承ください。" }
,{ "title": "Clojure を使用して OpenWhisk のアクションを作成する, 第 2 回: Clojure OpenWhisk の複数のアクションを結合して有用なシーケンスにする", "category": "cloud", "body": "全 3 回からなるチュートリアル・シリーズの第 2 回では、Clojure OpenWhisk の複数のアクションを結合してシーケンスにすることで、実際にブラウザーからリクエストを受信し、処理し、有用な結果を返すサンプル・アプリケーションに仕上げます。" }
,{ "title": "Clojure を使用して OpenWhisk のアクションを作成する, 第 1 回: Lisp ダイアレクトを使用して OpenWhisk のわかりやすく簡潔なコードを作成する", "category": "cloud", "body": "このチュートリアルでは、Lisp ベースの関数型プログラミグ言語 Clojure を使用して、OpenWhisk のアクションを作成する方法を説明します。Clojure では、JavaScript で作成されたアクションよりもわかりやすく、簡潔なアクションを作成することができます。副次効果に依存しないプログラミングを促す関数型プログラミングは、FaaS (Function as a Service) にはぴったりのパラダイムです。コードのさまざまな部分を異なるアクションに組み込むことによって、コードが細分化されたモジュールになり、保守しやすくなります。" }
,{ "title": "IBM Cloud Continuous Delivery の紹介, パート 1: 単純なアプリをデプロイして更新する", "category": "cloud", "body": "IBM Cloud と IBM Cloud Continuous Delivery を紹介するこのシリーズで、これらの製品を利用して、時間の無駄をなくす方法を発見してください。このシリーズでは、単純なアプリケーションを迅速かつ簡単にデプロイする方法、IBM Cloud サービスを使用するアプリをデプロイする方法、および新しい IBM Cloud サービスを利用するためのコードを作成する方法を説明します。セットアップ不要の Web IDE を試し、アジャイルな計画ツールを使用する方法を学ぶこともできます。このシリーズのサンプルに取り組むことで一連の知識を得られるだけでなく、おまけとして、オンライン・ストアで商品の価格を自動的にチェックしてくれるアプリケーションを手に入れることができます。このアプリケーションがあれば、お気に入りの商品がセールに出されているかどうかを確かめるために Web を見て回る必要がなくなります！" }
,{ "title": "Minecraft とIBM Cloud, 第 2 回: Docker と Eclipse を使って Minecraft 用のプラグインを作成する", "category": "cloud", "body": "このチュートリアル・シリーズでは、Docker、Eclipse、IBM Cloud を使用して独自の Minecraft サーバーを開発、拡張、ホストする方法を説明します。具体的には、Eclipse を使用して Minecraft プラグインを作成し、作成したプラグインをローカルで Docker を使用してテストした後、IBM Cloud を利用してインターネット上で Docker コンテナーをホストする方法を説明します。また、Minecraft 内から IBM Watson の強力な機能を利用して、より教育的かつ対話型のゲームへと拡張します。第 2 回では、Eclipse でローカル開発環境を構築してから、独自のサーバー・サイド Minecraft プラグインを開発、作成して、そのプラグインをローカル Docker イメージにエクスポートします。" }
,{ "title": "Minecraft とIBM Cloud, 第 3 回: Kubernetes 内で Spigot サーバーを稼働させる", "category": "cloud", "body": "このチュートリアル・シリーズでは、Docker、Eclipse、IBM Cloud を使用して独自の Minecraft サーバーを開発、拡張、ホストする方法を説明します。具体的には、Eclipse を使用して Minecraft プラグインを作成し、作成した Minecraft プラグインをローカルで Docker を使用してテストした後、IBM Cloud を利用してインターネット上で Docker コンテナーをホストする方法を説明します。また、Minecraft 内から IBM Watson の強力な機能を利用して、より教育的かつ対話型のゲームへと拡張します。この第 3 回では、第 2 回で作成したプラグインを次の段階に進めるために、Web 上の IBM Cloud 内でプラグインが動作するようにします。" }
,{ "title": "Minecraft とIBM Cloud, 第 1 回: Docker 内で Minecraft サーバーを実行する", "category": "cloud", "body": "このチュートリアル・シリーズでは、Docker、Eclipse、IBM Cloud を使用して独自の Minecraft サーバーを開発、拡張、ホストする方法を説明します。具体的には、Eclipse を使用して Minecraft プラグインを作成し、作成した Minecraft プラグインをローカルで Docker を使用してテストした後、IBM Cloud を利用してインターネット上で Docker コンテナーをホストする方法を説明します。また、Minecraft 内から IBM Watson の強力な機能を利用して、より教育的かつ対話型のゲームへと拡張します。第 1 回では、Minecraft および Docker の開発環境をローカルに構築するとともに、Minecraft 用のカスタム・サーバーを構築する上での Docker の強力さを確かめます。さらに、ローカルにホストされた独自のサーバー上で実際に Minecraft をプレイし始めます！" }
,{ "title": "Docker Registry を Raspberry Pi 上のプルスルー型キャッシュとしてセットアップする", "category": "cloud", "body": "低速のインターネット接続で、複数のユーザーが Docker イメージをダウンロードして作業しているとしたら、Docker Registry を Raspberry Pi 上のキャッシュとして使用することをお勧めします。こうすることによって、Docker を使用する際の時間と帯域幅の節約が可能になります。Raspberry Pi は持ち運びできて、値段が手頃で、しかも消費電力がごくわずかという、卓越したコンピューターです。このチュートリアルで説明するソリューションを作成すると、イメージをダウンロードするたびにイメージが Pi 上でキャッシュされて、以降のすべてのリクエストでは、ローカル・キャッシュから同じイメージが配信されるようになります。" }
,{ "title": "IBM Blueworks Live REST API を活用する, 第 4 回: Blueworks Live REST API を利用して Java アプリケーションを作成する", "category": "cloud", "body": "Blueworks Live REST API に関するこのシリーズの第 4 回では、REST API 呼び出しの結果を Java™ アプリケーションで処理する方法を説明します。" }
,{ "title": "IBM Blueworks Live REST API を活用する, 第 2 回: 汎用テスト・ツールを使用して Blueworks Live REST API リソースの詳細を探る", "category": "cloud", "body": "このチュートリアルは、シリーズ「IBM Blueworks Live REST API を活用する」の第 2 回です。今回は、Blueworks Live 内に保管されているビジネス・プロセス情報に関するレポートをカスタマイズして取得する方法を学びます。" }
,{ "title": "IBM Blueworks Live REST API を活用する, 第 5 回: IBM Cloud 上の Node.js を使用して Blueworks Live REST API 用の Web アプリケーションを作成する", "category": "cloud", "body": "このチュートリアルは、全 5 回からなるシリーズ「IBM Blueworks Live REST API を活用する」の最終回です。Node.js と IBM Cloud を使用して作成した Web アプリケーションから Blueworks Live API にアクセスする方法を学んでください。" }
,{ "title": "IBM Blueworks Live REST API を活用する, 第 3 回: cURL と組み合わせて Blueworks Live REST API リソースをインタラクティブに使用する", "category": "cloud", "body": "IBM Blueworks Live の REST API に関するこのシリーズの第 3 回では、REST API 呼び出しの結果をシェル環境内で処理する方法を学びます。" }
,{ "title": "ペットではなく家畜として扱う: IBM Integration Bus を使用して軽量の統合を実現する", "category": "cloud", "body": "IBM Integration Bus を使用した、軽量の「家畜」スタイルによる統合には、アジリティー、弾性のあるスケーラビリティー、そしてより個別のレジリエンス・モデルという点で、魅力的なメリットがあります。この記事では、家畜スタイルの統合における主要な概念について詳しく探ります。また、Docker などのコンテナー用イメージの作成に関する推奨事項も記載します。" }
,{ "title": "IBM Cloud 上の Weather Data サービスと Business Rules サービスを利用して、事業運営に関する意思決定を自動化する, 第 1 回: サンプル Weather Cancellation サービスを導入する", "category": "cloud", "body": "気象事象に対応して気象データを考慮した上で、IT 業務に関する意思決定が行われるように自動化することで、企業はよりスマートに事業を運営できるようになります。この記事では、複数のサービスを結合して、ビジネス・ルールを実行するという方法で気象データを考慮した意思決定を自動化する手順を説明します。ビジネス意思決定を自動化すると、通知の送信、価格の調整、プロモーションの生成、IoT デバイスのトリガー、ビジネス・プロセスの開始などといった、さまざまなアクションを実行できるようになります。" }
,{ "title": "Node-RED を使用してリアルタイムのチャット・アプリケーションを 5 分で作成する", "category": "cloud", "body": "今や、IBM Cloud と Node-RED を使用すれば、リアルタイムの Web アプリケーションを作成するのは簡単です。この記事では、コンポーネントをドラッグ・アンド・ドロップして互いにつなぎ合わせるだけで、リアルタイムのチャット・アプリケーションを数分で作成する方法を紹介します。" }
,{ "title": "Hyperledger Fabric がブロックチェーン・ネットワークにもたらす上位 6 つの技術的メリット", "category": "cloud", "body": "現在、地球上で最も画期的な新しいテクノロジーとして挙げられるのは、業界の運用モデルを一変させる可能性を秘めたブロックチェーンです。業界向けブロックチェーン・ソリューションに使用するプラットフォームを選ぶ際に検討しなければならない最も重要な特性は何でしょうか？この記事では、最も重要な上位 6 つの特性について説明します。" }
,{ "title": "PowerVC の OpenStack REST API を探る", "category": "cloud", "body": "IBM PowerVC (Power Virtualization Center) は、Power Systems 環境における仮想リソースの管理を単純化することを目的として OpenStack をベースに設計された、IBM Power プラットフォーム用 IaaS クラウド・ソリューションです。PowerVC では、GUI でも RESTful API でも、Power System の仮想管理タスクを行えるようになっています。この記事では、PowerVC Standard Edition と Cloud PowerVC Manager の両方の REST API にハイライトを当てます。" }
,{ "title": "Docker コンテナーを使用して迅速にモノのインターネット・アプリケーションを開発する", "category": "cloud", "body": "無線モジュール、センサー、マイクロコントローラーがコモディティー化されて入手しやすくなったこともあって、モノのインターネット (IoT) の急速な成長が進んでいます。しかし、IoT は機器の製造業者にとってだけのビッグ・ニュースではありません。相互に接続された機器の数が増えるにつれ、これらの機器とインターフェースを取って、機器から生成される膨大な量のデータを処理するアプリケーションの需要も高くなってきています。この高まる需要に対応するには、Web およびモバイル・アプリケーションの開発者は、IoT を対象とした開発をスタートさせて、現在の開発プラクティスをこの新しいアプリケーション領域の課題に対処するように適応させていかなければなりません。そのような開発プラクティスの 1 つが、コンテナーを使用する方法です。コンテナーは、仮想化を実現するための軽量の手法であり、開発者はコンテナーを広範に適用することで、IoT アプリケーションの開発、テスト、デプロイ、更新を迅速に行えるようになります。" }
,{ "title": "IBM Cloud でカスタムの Go ビルドパックを使用する", "category": "cloud", "body": "IBM Cloud では Go プログラミング言語をデフォルトでサポートしていませんが、この記事で、IBM Cloud でも Go で作成されたアプリケーションをホストできることをデモンストレーションします。著者は、単純な数学演算を実行する Web アプリケーションを開発し、カスタム・ビルドパックを使用してそのアプリケーションを IBM Cloud にデプロイする方法を紹介します。" }
,{ "title": "Eclipse Orion の紹介: クラウドの中でクラウドに対応", "category": "cloud", "body": "Eclipse Orion プロジェクトの目標は、Web の中で Web を対象に開発することのみに焦点を合わせた、ブラウザー・ベースでオープンソースのツール統合プラットフォームを作成することです。Orion のツールは JavaScript で作成されており、ブラウザー内で実行されます。また、Orion のコンポーネントは個別に利用することもできます。この記事では Orion の概要を紹介するとともに、Orion のツールを理解する上で役立つリソースと解説を提供します。" }
,{ "title": "Geospatial Analytics サービスを利用してモバイル端末をモニターする", "category": "cloud", "body": "IBM Cloud の Geospatial Analytics サービスを利用する Node.js スターター・アプリケーションを取得して実行し、拡張してください。Geospatial Analytics サービスを利用すると、モノのインターネットに接続された移動中の端末をモニターすることができます。Geospatial Analytics サービスは、MQTT からの端末メッセージ・ストリームを分析し、1 つ以上の地域に関して端末の位置情報をリアルタイムで追跡します。" }
,{ "title": "IBM のさまざまなクラウド・テクノロジー: その全体像", "category": "cloud", "body": "現在利用可能な各種のクラウド・コンピューティング・システムについて詳しく探るとともに、クラウド・インフラストラクチャー上に実際のアプリケーションをデプロイする上で役立つガイドラインを参考にしてください。" }
,{ "title": "IBM ブロックチェーンの基礎: 開発者向けクイック・スタート・ガイド", "category": "cloud", "body": "ブロックチェーン革命に参加してください！この developerWorks クイック・スタート・ガイドの対象読者は、現在ブロックチェーン・テクノロジーについて調べていて、迅速にブロックチェーン・ネットワークを開発し、アプリケーションをデプロイする方法を探しているアプリケーション開発者です。このガイドの単純な手順に従えば、最新の Hyperledger Fabric フレームワークをベースにブロックチェーン・ネットワークをアクティブ化し、チェーン・コード (ブロックチェーン・ネットワーク用のビジネス・ロジック) を作成してインストールし、ビジネス・プロセスとデジタル・インタラクションを効率化するクライアント・アプリケーションを作成できます。" }
,{ "title": "ブロックチェーンの基礎: 分散型レジャー入門", "category": "cloud", "body": "ブロックチェーン・テクノロジーが組織や機関の取引業務の方法をどのように一変させるようになるのか、その行く末について盛んに予測が行われています。ブロックチェーン・ネットワークの仕組み、ブロックチェーン・ネットワークを利用する方法、そして IBM がこのテクノロジーの進歩に貢献している取り組みについて見ていきましょう。" }
,{ "title": "ブロックチェーンの基礎: 用語集と使用事例", "category": "cloud", "body": "最近、ブロックチェーンが盛んに話題になっています。馴染みのない言葉の意味を理解して、どの業界がこのテクノロジーから利益を得られるかを見極めてください。" }
,{ "title": "ビジネス・ルールと予測モデル・マークアップ言語を使用して、十分な情報に基づく意思決定を自動化する", "category": "cloud", "body": "専門家が作成したビジネス・ルールを使用すれば、ビジネスの意思決定を自動化できます。けれども最近では、より優れた意思決定の基盤として、データ・マイニングによって作成された予測モデルを使用するという傾向が強まってきています。この記事では、ビジネス・ルールと予測モデルという異なる 2 つの要素がそれぞれに持つ利点を生かすために、予測モデルによる評価をビジネス・ルールに統合する方法を説明します。" }
,{ "title": "IBM Watson を利用して言語翻訳機能をアプリケーションに追加する", "category": "cloud", "body": "IBM Cloud アプリケーションに、言語翻訳機能を追加してください。このチュートリアルでは、Node-RED と Language Translation サービスを利用して、ユーザーが入力したテキストを翻訳し、そのテキストを基にセンチメント分析を実行するアプリケーションを作成します。" }
,{ "title": "モノのインターネットに関する人気の記事とチュートリアル (2017 年 12 月)", "category": "cloud", "body": "この記事ではご参考までに、モノのインターネットに関する記事のうち、最も人気の高い 5 件を抜粋し、そのハイライトを紹介します。" }
,{ "title": "モノのインターネットに関する人気の記事とチュートリアル (2017 年 8 月)", "category": "cloud", "body": "この記事ではご参考までに、モノのインターネットに関する記事のうち、最も人気の高い 4 件を抜粋し、そのハイライトを紹介します。" }
,{ "title": "IBM Cloud ハンズオン・セミナー 中級編 資料", "category": "cloud", "body": "最新の IBM Cloud (Bluemix) の提供機能を利用しつつ、Node.js でチャット・ボットのアプリ開発を体験していただきます。Node.js を少しでも触ったことのある方を対象としてお勧めしますが、一部のコードを修正して動作確認していく流れで進みますので、IBM Cloud 初心者の方でも体験可能です。IBM Cloud (Bluemix) で本格的な開発に入る前の、アプリ開発の手順や Watson を用いたアプリ開発をお考えの方に最適なトレーニングとなっています。" }
,{ "title": "VMware 環境および復旧ソリューションを IBM Cloud Local System 内でホストする、第 1 回: ホスト型 VMware 環境を導入する", "category": "cloud", "body": "IBM Cloud Local System および PureApplication System ファームウェア V2.2.3 のリリースにより、ワークロードをより柔軟に実行して管理できる、構成済みのホスト型 VMware 環境を自動的に作成できるようになっています。このシリーズは、W1500、W2500、W3500、および W3550 モデルのユーザーを対象に、このファームウェアに備わっている高度な機能を利用する方法をステップ・バイ・ステップで説明するためのものです。第 1 回では、ホスト型 VMware 環境を IBM Cloud Local System 内で作成してデプロイします。説明する手順をとおして、リソースを割り当てる方法、VMware コンポーネントに対する外部アクセスを構成する方法、仮想マシンを構成して VMware にデプロイする方法の詳細を学んでください。" }
,{ "title": "Watson の API を組み合わせた音声自動翻訳アプリケーション「Speech to Speech」", "category": "cloud", "body": "「Speech to Speech」は、IBM Watsonの APIを組み合わせ、リアルタイムで音声を多言語に翻訳するアプリケーションです。以下の一連の処理を動的に行うことで、通訳のようなアプリケーションを簡単に作成することができます。ここでご紹介するWatson APIは無料、期限なし、カード不要で使えるIBM Cloudライト・プランに含まれますので気軽に作ることができます。" }
,{ "title": "マイクロサービス入門", "category": "cloud", "body": "このチュートリアルでは、マイクロサービスによって、クラウド・アプリケーションがより管理しやすくなるとともに、アプリケーションのスケーラビリティーと信頼性が向上する仕組みを説明します。クラウド・アーキテクチャーにおけるマイクロサービスの役割を概説し、マイクロサービス・ベースのシステムと従来型のモノリシックなモデルを比較対照します。" }
,{ "title": "IBM Quantum Computing で計算してみよう", "category": "cloud", "body": "IBM は 2016年5月4日に世界で初めて、量子コンピューターをクラウドで公開し、誰でも使えるようにしました。2017年11月には 50 量子ビットの試作機の製作と稼働に成功、12月には 20 量子ビットのお客様への提供を始めました。この記事では、この IBM Quantum Experience の使い方や量子コンピューターの概念、簡単なアルゴリズムについて解説します。" }
,{ "title": "Node-RED: bot 操作の基礎: コースの概要", "category": "cloud", "body": "音声からテキストへの変換、トーンの分析、別の言語へのテキスト翻訳、Twitter 経由でのツイートの送信、音声機能とビデオ機能の追加、および IBM Watson Conversation サービスと Facebook Messenger を使用したチャット・ボットのセットアップを行う方法を、実地体験を通じて学習します。プログラミング経験も必要ありません。" }
,{ "title": "Node-RED: bot 操作の基礎: ラボ 3: コミュニティー・ノードと Watson サービスの追加", "category": "cloud", "body": "音声からテキストへの変換、トーンの分析、別の言語へのテキスト翻訳、Twitter 経由でのツイートの送信、音声機能とビデオ機能の追加、および IBM Watson Conversation サービスと Facebook Messenger を使用したチャット・ボットのセットアップを行う方法を、実地体験を通じて学習します。プログラミング経験も必要ありません。" }
,{ "title": "Node-RED: bot 操作の基礎: ラボ 2: Web ページおよび REST API の構築", "category": "cloud", "body": "音声からテキストへの変換、トーンの分析、別の言語へのテキスト翻訳、Twitter 経由でのツイートの送信、音声機能とビデオ機能の追加、および IBM Watson Conversation サービスと Facebook Messenger を使用したチャット・ボットのセットアップを行う方法を、実地体験を通じて学習します。プログラミング経験も必要ありません。" }
,{ "title": "Node-RED: bot 操作の基礎: ラボ 1: Node-RED ボイラープレート・アプリケーションの作成", "category": "cloud", "body": "音声からテキストへの変換、トーンの分析、別の言語へのテキスト翻訳、Twitter 経由でのツイートの送信、音声機能とビデオ機能の追加、および IBM Watson Conversation サービスと Facebook Messenger を使用したチャット・ボットのセットアップを行う方法を、実地体験を通じて学習します。プログラミング経験も必要ありません。" }
,{ "title": "Node-RED: bot 操作の基礎: ラボ 4: コグニティブな Web ページと Messenger ボットの作成", "category": "cloud", "body": "音声からテキストへの変換、トーンの分析、別の言語へのテキスト翻訳、Twitter 経由でのツイートの送信、音声機能とビデオ機能の追加、および IBM Watson Conversation サービスと Facebook Messenger を使用したチャット・ボットのセットアップを行う方法を、実地体験を通じて学習します。プログラミング経験も必要ありません。" }
,{ "title": "Node-RED: bot 操作の基礎: まとめ", "category": "cloud", "body": "音声からテキストへの変換、トーンの分析、別の言語へのテキスト翻訳、Twitter 経由でのツイートの送信、音声機能とビデオ機能の追加、および IBM Watson Conversation サービスと Facebook Messenger を使用したチャット・ボットのセットアップを行う方法を、実地体験を通じて学習します。プログラミング経験も必要ありません。" }
,{ "title": "Travis CI を使用して Kubernetes ポッドを IBM Cloud Container Service にデプロイする", "category": "cloud", "body": "Travis CI を使用して Kubernetes アプリケーションを IBM Cloud にデプロイする方法について学習します。" }
,{ "title": "マイクロサービスへのリファクタリング: 第 1 回 モノリスから移行する際の考慮事項", "category": "cloud", "body": "ここのところ、マイクロサービスが開発の世界に旋風を巻き起こしています。この全 3 回からなるシリーズでは、マイクロサービスが重要な理由、マイクロサービスへの移行手法を計画する際に考慮すべき要因、データ分析の役割を取り上げ、マイクロサービスへの移行プロセスをステップ・バイ・ステップで説明します。第 1 回ではマイクロサービスについて紹介し、アプリケーションをリファクタリングしてマイクロサービス・アーキテクチャーを利用する際の考慮事項を説明します。" }
,{ "title": "非開発者向け Watson API 使用ガイド", "category": "cloud", "body": "このレシピでは、プログラミング言語を使用せずに Watson REST 呼び出しを行う方法を示します。" }
,{ "title": "IBM Cloud によってホストされる専用レジストリー入門", "category": "cloud", "body": "IBM Cloud Container Service を使用するメリットの 1 つに、IBM Cloud によってホストされる専用レジストリーにアクセスできることがあります。それによってユーザーは、それぞれの専用レジストリーで Docker イメージをプッシュ/プルできるようになります。" }
,{ "title": "Kubernetes への NodeJS プロジェクトの移動", "category": "cloud", "body": "IBM Cloud で NodeJS アプリを CloudFoundry から Kubernetes に移す方法について学習します。" }
,{ "title": "PHP と Passport サービスを利用して IBM Cloud アプリケーション内で容易にユーザーを管理、認証する, 第 2 回: ロール・ベースのアクセス制御機能とパスワード回復機能を PHP アプリケーションに追加する", "category": "cloud", "body": "この全 2 回からなるチュートリアル・シリーズでは、カスタム・コードを一切作成せずに、IBM Cloud アプリケーションに迅速にユーザー管理機能とアクセス制御機能を追加する方法を紹介します。第 2 回では、ユーザーの追加、変更、削除をサポートする、アプリケーション用にカスタマイズしたユーザー管理ダッシュボードを開発する方法、ユーザー・ロールに応じてアプリケーション・リソースへのアクセスを保護する方法、そしてパスワードを回復するためのワークフローを実装する方法を説明します。このシリーズでは、Slim PHP マイクロフレームワークと併せて、IBM Cloud の Passport アイデンティティーおよびアクセス管理サービスを利用します。" }
,{ "title": "PHP と Passport サービスを利用して IBM Cloud アプリケーション内で容易にユーザーを管理、認証する, 第 1 回: ゼロから始めることなく、ユーザー認証および管理機能をアプリケーションに追加する", "category": "cloud", "body": "この全 2 回からなるチュートリアル・シリーズでは、カスタム・コードを一切作成せずに、IBM Cloud アプリケーションに迅速にユーザー認証を追加する方法を紹介します。ユーザーの追加、アクティブ化、非アクティブ化をサポートするユーザー・ダッシュボードをアプリケーションに追加するにはどのようにするのかを説明するとともに、アプリケーション・リソースへのアクセスを保護するために、パスワード・ベースの認証によるログイン・ワークフローを実装する方法を説明します。このシリーズでは、Slim PHP マイクロフレームワークと併せて、IBM Cloud の Passport アイデンティティーおよびアクセス管理サービスを利用します。" }
,{ "title": "サンプル Liberty アプリケーションを作成して IBM Cloud にデプロイする", "category": "cloud", "body": "IBM は 2014年 10月初旬に IBM Cloud プラットフォームに Watson サービスを導入しました。このチュートリアルでは、現在利用可能なサービスと SDK を紹介するとともに、Watson Question and Answer サービスを利用したアプリケーションを IBM Cloud にデプロイする方法を紹介します。このチュートリアルでデプロイするのは、Java ベースのアプリケーションです。" }
,{ "title": "ニューラル・ネットワークの徹底調査", "category": "cloud", "body": "このチュートリアルでは、ニューラル・ネットワークを掘り下げて調べます。ニューラル・ネットワークの背景について説明し、現在の機会学習においてニューラル・ネットワークが優勢な勢力になっているわけを明らかにします。" }
,{ "title": "IBM Cloud 上で Clojure Web アプリを作成する", "category": "cloud", "body": "関数型プログラミングを開始しませんか？ Lisp ベースの Clojure は、評判の高い関数型プログラミング言語です。Node.js を使用して、IBM Cloud 上にデプロイされた Web アプリケーションの一部として Clojure プログラムを実行する方法を学んでください。" }
,{ "title": "IBM Cloud ハンズオン・セミナー 初級編 資料", "category": "cloud", "body": "AIやIoTなど最新テクノロジーを活用したアイディアを素早く実現できるIBM Cloudをご紹介するハンズオン資料を公開いたします。本ハンズオンは特別なスキルが無くても実施いただけるように最小限のプログラミングでIoTやAIアプリを作成できる内容となっております。AI、IoT活用にご興味のある方は、是非本ハンズオンにチャレンジしてみてください。" }
,{ "title": "IBM Cloud と IBM Containers を利用して、Linux ベースのチェス・アプリをクラウド上に配置する", "category": "cloud", "body": "WebSocket を使用して既存の Linux CLI チェス・エンジンをクラウド・サービスとして公開する Docker コンテナーを作成してください。このチュートリアルでは、Docker コンテナーを作成し、それを実行中のコンテナーとして IBM Containers for IBM Cloud にデプロイするプロセスをステップ・バイ・ステップで説明します。チュートリアルにはサンプル・コードの他、ブラウザー内で実行されて WebSocket ベースのサービスを使用する方法を説明する JavaScript チェス・ゲームも付属しています。ここでデモする手法を適用すれば、ほぼすべてのパイプ・ベースの Linux アプリケーションをコンテナー化し IBM Cloud 上でクラウド・サービスとして利用することができます。" }
,{ "title": "Go プログラミング言語で SoftLayer Cloud API を操る", "category": "cloud", "body": "Go プログラミング言語で SoftLayer Cloud API を使用する場合の一部始終を学んでください。このチュートリアルでは、SoftLayer 内のサービスを利用する方法、データ構造をナビゲートして使用する方法、オブジェクトのマスクとフィルターを設定する方法、ならびに VM の順序付け方法などを、簡潔かつ慣用的な形で説明します。" }
,{ "title": "Watson Discovery のパッセージ取得機能を利用して関連する情報を迅速に見つける", "category": "cloud", "body": "大量の非構造化データの中から関連する情報を見つける際に、IBM Watson Discovery サービスに含まれるパッセージ取得機能がどのようにして役立つのかを学んでください。" }
,{ "title": "Flask と Python を使用して、スケーラブルで耐障害性を備えた REST エンドポイントを作成する", "category": "cloud", "body": "Cloud Foundry コマンド・ライン・ツールを使用して、AngularJS ユーザー・インターフェースを備えた単純な Flask アプリケーションを IBM Cloud にデプロイする方法を学んでください。このチュートリアルでは、Django、Pyramid、web2py のようなフレームワークではなく、Flask を選びました。それは、Flask は非常に軽量であることから、簡単に理解できるためです。REST エンドポイントを作成するだけであれば、Flask はまさにぴったりの選択肢です。さらに、このチュートリアルでは単一の REST エンドポイントを使用して複数の異なる機能を多重化する方法も紹介します。" }
,{ "title": "IBM Bluemix (IBM Cloud プラットフォーム *) テクニカル・セミナー 2017 説明資料", "category": "cloud", "body": "IBM Bluemix PaaS の最新のテクノロジー情報や事例などを交えてご紹介するものです。 ぜひこの機会に IBM Bluemix を理解いただき、ICT システムのイノベーション実現にお役立てください。" }
,{ "title": "日本で作成された Watson サンプルアプリケーションのご紹介", "category": "cloud", "body": "日本の Watson チームが作成したサンプルアプリケーションをご紹介します。リンク先の README.md も日本語ですので、ぜひアクセスして詳細説明や実際のコードをご参照ください。" }
,{ "title": "声に出して言う", "category": "cloud", "body": "今や私たちは、自然言語処理やその他の人工知能関連のテクノロジーに取り巻かれています。この記事では、自然言語処理という科学の発祥と今後の行方について探ります。" }
,{ "title": "Bluemix、Watson Discovery、Cloudant を利用して、他のアプリを分析するモバイル・アプリを作成する", "category": "cloud", "body": "このチュートリアルで作成するアプリは、App Store から無料で入手できるアプリのうち、最も人気の高い上位 10 個のアプリに関するレビューを分析してから、それらのアプリの詳細を Cloudant を利用して保管します。" }
,{ "title": "Docker Compose を使用して IBM Operational Decision Manager トポロジーをデプロイする", "category": "cloud", "body": "Docker テクノロジーは、開発者と IT がランタイム・コンポーネントを標準化し、事前にアセンブルされたトポロジーをプロビジョニングすることを可能にします。IBM Operational Decision Manager (ODM) は、ビジネス・ポリシーを自動化するためのビジネス・ルールをモデル化、オーサリング、テスト、デプロイする際に、ビジネス・ユーザーと開発者がコラボレーションすることを可能にします。このチュートリアルでは、継続的ビルドおよび最新式 DevOps に役立てるために Docker マイクロコンテナー・テクノロジーを IBM ODM Standard に適用する方法を紹介します。WebSphere Liberty サーバー上で稼働する Decision Server (Rule Execution Server) と Decision Center の Docker イメージをビルドしてインスタンス化する方法、そして Docker Engine と Compose を使用して再現可能なクラスター・トポロジーと非クラスター・トポロジーのオーケストレーションを行う方法を学んでください。" }
,{ "title": "人工知能、機械学習、コグニティブ・コンピューティングの入門ガイド", "category": "cloud", "body": "この記事では、人工知能の歴史を簡単に辿り、ニューラル・ネット・ネットワークと深層学習という最新の手法について概説します。これまで、AI と機械学習の歴史は浮き沈みの繰り返しではあったものの、深層学習やコグニティブ・コンピューティングなどの新しい手法により、この 2 つの分野での水準が大幅に上がっていることは確かです。それはなぜなのかを学んでください。" }
,{ "title": "コグニティブ IoT アプリケーション対応のブロックチェーンを実装する、第 1 回: IBM Blockchain 内のスマート・コントラクトにデバイスのデータを統合する", "category": "cloud", "body": "医療業界、倉庫業、運送業、物流業をはじめとする多種多様な業界で、モノのインターネット (IoT) ソリューションが採用されて成功を収めています。けれども現在のクラウド・ベースの集中型 IoT ソリューションではスケーリングするのが難しく、大企業が直面するセキュリティーの課題に対処できない可能性があります。そのようなセキュリティー問題を解決する手段となるのが、参加ノード間のトランザクションおよびピア・ツー・ピア通信の分散型レジャーとしてのブロックチェーンです。この記事では、ブロックチェーン対応の IoT ソリューションの概要を説明し、マルチパートナー環境での IoT アプリケーションに IBM Blockchain プラットフォームを利用する方法をデモします。" }
,{ "title": "コグニティブ IoT アプリケーション対応のブロックチェーンを実装する、第 2 回: 車載センサーのデータを使用して Blockchain 内でスマート・トランザクションを実行する", "category": "cloud", "body": "コグニティブ IoT アプリケーション対応のブロックチェーンの実装を開始してください。この全 2 回からなるシリーズの第 1 回では、IoT ソリューション内でブロックチェーンを使用するという手法について説明し、さまざまな業界でこの 2 つのテクノロジーを利用して完全に自動化されたセキュアなソリューションを構築している例を取り上げました。この第 2 回では、BM Watson IoT Platform と IBM Blockchain サービスを利用して使用ケースを構築する例を紹介します。" }
,{ "title": "Angular + Watson でプレゼンスライドを奇妙な冒険にしよう！", "category": "cloud", "body": "今話題の技術や最新技術への挑戦を応援する【IBM×teratail のコラボ企画】第三弾です。今人気を博している Angular を使用したオリジナルプレゼンテーションを作成するためのサンプルをご紹介いたします。" }
,{ "title": "Visual Recognition + Kotlin で撮影した画像で商品検索が出来る Android アプリを作ろう", "category": "cloud", "body": "これから 3回に渡って話題の技術と Watson API をかけ合わせた開発サンプルをご紹介していきます。記事を読み進めながら、ぜひみなさんも手を動かして作ってみてください。第一弾は、2017年5月に Google から Android の公式言語として認定されたことで人気に火がついた Kotlin を使ったサンプルをご紹介いたします。" }
,{ "title": "Watson×Unity！初心者でもできる、VR 空間で Unity ちゃんとおしゃべりアプリ！", "category": "cloud", "body": "今話題の技術や最新技術への挑戦を応援する【IBM×teratail のコラボ企画】第二弾です。今回は Watson×バーチャルリアリティ（以下 VR）を組み合わせたサンプルのご紹介です。" }
,{ "title": "IBM Bluemix を使用してビジネス上の意思決定プロセスを Kubernetes 内で実行する", "category": "cloud", "body": "IBM Operational Decision Manager (ODM) を IBM Bluemix 上の Kubernetes クラスター内にデプロイする方法を学んでください。このチュートリアルでは、Docker イメージを出発点に Kubernetes を使用して IBM ODM プラットフォームをクラスター化し、クラウド上で稼働する意思決定プラットフォームにアクセスする手順を説明します。" }
,{ "title": "デジタル企業におけるハイブリット統合プラットフォーム", "category": "cloud", "body": "企業のアプリケーション、データ、サービスがオンプレミスとクラウド内の両方に拡散するという状況では、ビジネス・プロセス・モデルのありとあらゆる要件に、単一の統合プラットフォームで対処することは不可能です。モバイルと IoT を含め、あらゆる統合のニーズを満たすには、多種多様な統合コンポーネントで構築されたハイブリッド統合プラットフォームが必須となります。この記事では、ハイブリッド統合プラットフォームを配置する使用ケースを 3 つ紹介し、最適に構成されたミドルウェア・コンポーネントを使用して、このようなプラットフォームを設計する手順を説明します。" }
,{ "title": "express-no-stress: Express.js と Swagger を使用して卓越した API を作成する", "category": "cloud", "body": "この簡潔にまとめた記事では、Node.js と最善のテクノロジーとアプローチの組み合わせを使用して SaaS を構築する方法を説明し、そのための手段となる scaffold ジェネレーターを紹介します。このジェネレーターを使用すれば、Express.js をベースとした新しい API アプリケーションの scaffold を迅速に作成できます。さらにこの scaffold 機能によって、構造化されたロギング、API リクエストの検証、インタラクティブな API ドキュメント、環境主導の構成、単純なビルド/トランスパイル・プロセスなどにも対応できます。scaffold を使ったアプリケーションは、IBM Bluemix のような最新のクラウド・プラットフォーム上にデプロイするのにも最適です。" }
,{ "title": "MQTT の基本知識", "category": "cloud", "body": "この記事では、MQTT プロトコルを技術の面から紹介します。MQTT とは何か、MQTT が IoT アプリケーションに適している理由、そして MQTT を使用したアプリの開発を始める方法を説明します。" }
,{ "title": "IBM Bluemix Container Service の API を使用してコンテナー・テクノロジーを最大限に活用する", "category": "cloud", "body": "コンテナーが情報テクノロジーにおいて果たす役割は次第に大きくなっていています。それに伴い、Docker の重要性はますます高くなり、Docker をアーキテクチャーの基礎とするようになっている IT 設計チームが増え続けています。コンテナーへの移行という時流に足並みを揃えるために、IBM は Docker をベースとした独自のコンテナー・ソリューションをリリースしました。それが、IBM Bluemix Container Service です。この記事では、Bluemix Container Service を、このサービス固有の API を介して操作する方法を説明します。" }
,{ "title": "コグニティブ・アプリを作成するときに知っていなければならない 5 つのこと", "category": "cloud", "body": "深層学習の力を活用するアプリケーションが増加する中、人工知能テクノロジーが市場とアプリケーション全体に価値を付加するようになっています。この記事では、インテリジェント・アプリケーションを開発する際に考慮しなければならない 5 つの主要な概念について詳しく探ります。" }
,{ "title": "たった 7 つのステップでコグニティブ IoT アプリを構築する", "category": "cloud", "body": "エッジ・コンピューティング・アーキテクチャーに従って、コグニティブ IoT ソリューションを構築してください。アナリティクスの実行場所をゲートウェイに移し、高度な機械学習によって異常を検出するアプリの作成方法を説明します。" }
,{ "title": "Bluemix 上の IBM Watson を利用して公開企業に対する感情シグナルを生成する", "category": "cloud", "body": "このチュートリアルでは、私たちのチームが IBM Bluemix の Watson Natural Language Understanding API を利用し、Web データと Twitter をクロールして集約した感情シグナルを複数の公開企業を対象にトラッキングする Web ページを作成した方法を説明します。また、株の調査でこの情報を利用するために考えられる 2 つの方法も紹介します。" }
,{ "title": "Watson Conversation を使用してチャットボットを作成する", "category": "cloud", "body": "Watson Conversation サービスに、さらにもう 1 つの Watson サービス Natural Language Understanding を統合して、ユーザーの音声から抽出可能なエンティティーのリストを拡充する方法を学んでください。" }
,{ "title": "Bluemix と Node.js を使用してユーザー向け OpenWhisk アプリケーションを作成する", "category": "cloud", "body": "OpenWhisk を使ってユーザー向けアプリケーションを作成するにはどのようにするのかを学んでください。このチュートリアルでは OpenWhisk の基礎をおさえる方法として、スタブ index.html から OpenWhisk を呼び出して実際のコンテンツを取得する、ユーザー向けサンプル・アプリケーションを作成します。" }
]
